{"data":{"wordpressPost":{"title":"","content":"<p>ARE YOU ORDINARY NOT EXTRAORDINARY?</p>\n<p>Are you an ordinary person who goes about your day doing plain and ordinary things when really inside you are extraordinary?</p>\n<p>Are you a person hiding behind the effort to be the best you can be? Do you have this feeling, this innate knowing that you have a gift, a talent, an ability to be more than you are right now?</p>\n<p>Have you always known there was something special about you, or that you could do something different or better than anyone else, but you don’t try?</p>\n<p>We do mediocre work and we put in very little effort even when we know we are more capable and can do better. Maybe you are a genius, but you are fearful of exploiting it, or you can’t find the right opportunity to do so.</p>\n<p>I know super smart people who don’t do anything more than what they have to do each day. They just exist. I wish I had one tenth of the intelligence I see go to waste.</p>\n<p>Maybe you are a really good singer but you are afraid to get up and sing. You dream in your head about how awesome it would be to sing like no one was watching, and you fantasize about trying out for American Idol or something similar, even something smaller, but you just can’t do it.</p>\n<p>Sure you could have stage freight and chalk it up to that, therefore, you feel better by justifying that it’s normal, so you will never live your dream. Instead of dreaming what you could be, take the steps to overcome the fear so you can be. I would bet that most singers had to overcome stage fright, too.</p>\n<p>There are rarely any naturals out there as most have to practice doing what they love to do. I have a fear of speaking in front of a group. Many do, but I imagine that mine is extreme, but it’s not. If you search on Google for this, it is the number one fear, even more so than dying.</p>\n<p>I can’t say I would rather die than speak because if God gave me only one choice, my fear would go right out the window to save my life. However, I don’t need to speak to groups because it’s not something I long to do, and not just because of the fear. I have no interest in speaking.</p>\n<p>Although this could change as life does, this is something that will never be in my way. However, if you have a passion along with some talent and the only way to get you to your dream is having to expose yourself to your fear, then you better do it rather than live a life half full.</p>\n<p>They say before you die you don’t regret what you did, but what you didn’t do. I love to write, not because I think I am a good writer, but because if I laid on my death bed and didn’t write than I would feel a sense of loss and disappointment.</p>\n<p>Have you ever profoundly regretted something? Maybe you should have said sorry, but you didn’t and now it’s too late, or you left a great relationship only to find the grass wasn’t greener and now you live with regret?</p>\n<p>If I listen to fear tell me I suck at writing (which it often does) and I don’t write, I am defeated and then I become ordinary, not extraordinary. Maybe I am not a great writer like Ernest Hemingway, but I am being extraordinary for trying because not many people write everyday.</p>\n<p>What is it that you need to begin and then finish? Only ordinary people don’t reach beyond what they are capable of doing. Being extraordinary doesn’t equate to being what society might view as successful but, instead, it means what’s successful in your eyes.</p>\n<p>I may feel extraordinary to myself and not to others, but isn’t that all that really matters anyway? In the end, aren’t we only in a race with ourselves? Which one are you, ordinary or extraordinary?</p>\n","featured_media":null},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"2f71f3b3-06c8-5078-ad86-e4c3b388aa04"}}