{"data":{"wordpressPost":{"title":"Women and Middle-Age","content":"<p style=\"text-align: justify;\">Women and Middle-Age</p>\n<p style=\"text-align: justify;\">From a social perspective, women tend to disengage as they get older. We are told or think that we need a hobby to keep us busy, and quietly bow out of society. When past roles and relationships are replaced or lost, we need to replace them with something in order to remain satisfied.</p>\n<p style=\"text-align: justify;\">I say be a little selfish and do something extraordinary for yourself! Do something that makes you feel ecstatic once in a while, or better yet, very often! If you don’t know what that is, then begin the journey to find out.</p>\n<p style=\"text-align: justify;\">It makes a big difference to do something for your soul rather than something because you need to fill the gap in time. Don’t under estimate how great it feels to jump into a car with your girlfriends and go away for the weekend, just like you did when you were younger. You remember those carefree days, don’t you? If not, it’s time to get back there. We have the opportunity to do that now.</p>\n<p style=\"text-align: justify;\">For me socially, it was down to going to dinner with my husband on Friday nights, going with my daughter to dinner once or twice a month, or going with a girlfriend once in a while for, yet again, dinner.</p>\n<p style=\"text-align: justify;\">Sure, as a couple we’d go to functions like weddings, funerals, benefits, graduations and all the other events we’re invited to for support of family and friends. I usually spend most of the time reading, working out and working at my job.</p>\n<p style=\"text-align: justify;\">I watch my daughter dress up in costumes, and go to pub runs and concerts, and all the things that her age group does. What does our age group do? I don’t want to dress up in costumes and go pub running by any means, but it would be fun to do things spontaneously and out of the ordinary instead of the same old things day in and day out. Maybe that’s another secret to getting older, spontaneity? Have we lost it? Are we and our lives too predictable?</p>\n<p style=\"text-align: justify;\">You have to admit, as we get older, we tend to get a little more rigid and structured. When was the last time you just up and went somewhere without a plan or, better yet, forgot everything you needed if you did.</p>\n<p style=\"text-align: justify;\">When we were younger, if we forgot something, we would just buy it, borrow it or live without it. We didn’t fret about it; we just had fun because having fun was the main goal. As we get older, unfortunately we create agendas and fun becomes second on the list. We care more about the plan, the map, getting there and arranging what we will do when we are there, and then we lose the ability to be curious and open to new things as we did when we were kids. Remember how fun it was to be a kid and explore?</p>\n<p style=\"text-align: justify;\">I can’t help but wonder if the actions I am taking today are preparing me for the ultimate slow down as I age.  I guess you could say I feel as though I am winding down. This is good in itself, but a little sad, as I comprehend slowing down as my mind and body age.</p>\n<p style=\"text-align: justify;\">I understand to slow down is to enjoy life, but I liked being busy and feeling like I was achieving something in my younger days, even if it was only because I wasn’t still.</p>\n<p style=\"text-align: justify;\">I book a spa day once a month, and look forward (as would all women) to just devoting that day to myself. If we don’t take care of ourselves, who will? If you can, devote one day a week or a month to yourself, and do what you can for yourself.</p>\n<p style=\"text-align: justify;\">You will be much happier knowing that you are your own best friend, and don’t feel guilty, because you deserve it. I love doing this alone as much, or more than, spending it with my partner or a good friend.</p>\n<p style=\"text-align: justify;\">I am able to center and reconnect with myself. The same self that sometimes is a little too hard on herself at times. I take this time to give myself permission to be okay with where I am in life.</p>\n<p style=\"text-align: justify;\">It’s my let-go time. Deepak Chopra says that happy cells create a happier and prettier person. I don’t know about you, but I am happy to make myself happy. If making ourselves happy helps with looking good, even better.</p>\n<p style=\"text-align: justify;\">I don’t like bad news and I certainly don’t like to dwell on the negative. I think as middle-aged women, we have a lot of hope and should hold out for a happier future. We don’t have to sit around and wait for an invitation or, worse, do something we are not enthusiastic about, simply because we don’t have another option.</p>\n<p style=\"text-align: justify;\">Gone are the days when we were younger, and thought we had to please everyone by saying yes to the no things! At our age, we have a voice and an opinion and we are not afraid to let it be known.</p>\n<p style=\"text-align: justify;\">I got tired of dreading Sundays because Monday was just around the corner, and knowing another week was about to begin, only for it to lead into yet another week and month, all the while doing the same things day in and day out. My life was becoming too predictable. Time passes very quickly when you don’t live.</p>\n<p style=\"text-align: justify;\">When we let life live us instead of us living it, we only move from day to day, going through the motions and, pretty soon, we say, “Where did all the years go?” We are not living in this mode. Our spirit gets bored and, even if we desire more, we just keep living this way because it’s a habit. So, what is a middle-aged woman to do socially these days?</p>\n<p style=\"text-align: justify;\">I felt this way, and I decided to take action and make a change in my life. And here’s what I did. Have you ever heard of a website called meetup.com? Well if not, you should go there immediately. You can join groups of people who have interests similar to yours, and as many as you like.</p>\n<p style=\"text-align: justify;\">Just don’t do what I did and join ten at one time, because it’s hard to keep up with them. Join one or two and GO TO THE EVENTS! Don’t just join because they look fun, actually go to the events and enjoy it. If you love wine (which most women our age do, hum, hum), then you can join a wine tasting group and meet like-minded people.</p>\n<p style=\"text-align: justify;\">I like cooking, wine, running, writing and a lot of other things, so I joined these groups. Fun! You can also join them with your partner and enjoy good times together or just join them by yourself for some alone time. Now, if they only had a spa group!</p>\n<p style=\"text-align: center;\">Do these 5 things daily and reduce your age by 10 years:</p>\n<p style=\"text-align: center;\"><img class=\"\" src=\"https://myagingandwellness.com/wp-admin/admin-ajax.php?action=imgedit-preview&amp;_ajax_nonce=c3b68c6a16&amp;postid=98&amp;rand=97003\" width=\"102\" height=\"102\" /></p>\n<p style=\"text-align: center;\"><a href=\"https://theresaskrobanek.leadpages.co/the-5-huge-mistakes/\">https://theresaskrobanek.leadpages.co/the-5-huge-mistakes/</a></p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/57cc6b66143082b25aefaed063e94c92/1a478/1013183_10151839239254073_2118116681_n11-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"4d66487d-72a5-516b-8e68-8b433f959345"}}