{"data":{"wordpressPost":{"title":"Does EndyMed work?","content":"<h1 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Does EndyMed work?</span></h1>\n<p>&nbsp;</p>\n<p>Okay, ladies.  Have you seen the commercials about how to get rid of crepey skin?  You know the body lotion that claims to tighten your skin and make it look youthful again?</p>\n<p>I won&#8217;t say the name of the product that claims to do this but, I will say that I have tried that product and it DOES NOT WORK.</p>\n<p>Long story short, I am in my fifties and I abused my skin for most of my life by laying in the tanning beds and in the sun.  My skin is both crepey and the elasticity is compromised.</p>\n<p>It doesn&#8217;t help either that I am in menopause and now my collagen formation is at an all-time low.</p>\n<p>I tried working out a lot and lifting heavy weights and although it helped, it didn&#8217;t get rid of the crepeyness of my skin.</p>\n<p>One day I was in my doctor&#8217;s office and he had a poster on the wall that said &#8220;EndyMed&#8221; for tighter skin.</p>\n<p>Now, I am a pretty skeptical person but even saying that I try just about everything at least once to verify my skepticism.  I inquired about the EndyMed and they explained that it works by allowing energy to be delivered deep down into the skin in virtually a painless manner.</p>\n<p>It uses multiple generators to ping pong the energy to a deep level of the skin.  It&#8217;s used as a non-invasive procedure and either in specific areas like face, neck, cheeks, legs, arms or, a whole body rejuvenation.</p>\n<p>It&#8217;s for skin tightening, acne scars, and wrinkle reduction.  It also helps with pigmentation issues which I have all of these issues.  It&#8217;s an innovative technology and the fact that the energy goes deep down to the skin surface allows collagen to reproduce thus, tightening the skin.</p>\n<p>The wand on the machine is used in the areas of the body that you want to be tightened etc.  It heats up the skin and stimulates collagen remodeling.  They call it &#8220;3D energy.&#8221;</p>\n<p>&nbsp;</p>\n<h1 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">So the question is, &#8220;Does EndyMed work?&#8221;</span></h1>\n<p>I had three treatments done on my upper arms because I had cellulite and loose skin.  I also had two treatments on my inner thighs because I had sagging skin.  I was at the point where I hadn&#8217;t worn shorts in two years.</p>\n<p>My arms got about thirty percent tighter and my cellulite got about ten percent better.  The doctor said it will take about four to six treatments so I will go back and have three more.</p>\n<p>For my legs, I saw immediate improvement and I actually wore shorts the other day and I could not believe it!  It has been painful not wearing shorts and skirts like I did in the good old days.  I will also go back and have four more treatments on my legs to get the full effect.</p>\n<p>With that said, in both of these cases, I increased my workouts with targeted workouts for these areas using heavier weights and specific techniques that shape these areas.</p>\n<p>I also dropped five pounds too.  Did that have anything to do with my results?  Absolutely.  Unless one is having surgery, doing something that is non-invasive only works if you work along with it.</p>\n<p>Would I have gotten results if I didn&#8217;t diet and workout?  Yes.  But not as good.</p>\n<h1 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">The cost for EndyMed</span></h1>\n<p>&nbsp;</p>\n<p>I think the cost is pretty good.  I paid $297 for three treatments.  The treatments are spread to every other week per area.  I think it&#8217;s a bargain because the emotional pain that I felt by hiding my legs for two years was well worth trading a few hundred bucks for.</p>\n<h1></h1>\n<h1 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">How long does it EndyMed take?</span></h1>\n<p>&nbsp;</p>\n<p>The procedure takes about thirty minutes for inner thighs and about the same for arms.  There is a setting they put on for each part of the body that tells them how much heat to put on and how many passovers with the wand to use.  Once the passovers are done, it&#8217;s done.  Super painless and almost feels light a light massage.</p>\n<p>&nbsp;</p>\n<h1 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Facial Rejuvenation with EndyMed</span></h1>\n<p>&nbsp;</p>\n<p>After I get the other treatments finished up.  I will go back and do my chest and my face.  I like the fact that it creates collagen and as we get older our skin sags on our face and neck because we stop producing collagen at the rate we did in our early years.</p>\n<p>I&#8217;d rather produce my own natural filler like collagen instead of getting unnatural fillers injected.  To me, it just doesn&#8217;t look the same.</p>\n<h1></h1>\n<h1 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Does EndyMed work?</span></h1>\n<p>Yes! I would say EndyMed does work and it is well worth the money 🙂</p>\n<p>Here is a link if you want more information on EndyMed <a href=\"http://www.endymed.com/VALIDATION\"> http://www.endymed.com/VALIDATION</a></p>\n<p>&nbsp;</p>\n<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">If you seriously want to have younger skin without filters, needles, surgeons or paying a bunch of money then check out my 4 step course here: </span></h3>\n<h3 style=\"text-align: center;\"><span style=\"color: #0000ff;\"><a style=\"color: #0000ff;\" href=\"https://how-to-get-smoother-skin.teachable.com\">https://how-to-get-smoother-skin.teachable.com</a></span></h3>\n<div id=\"attachment_8372\" style=\"width: 310px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8372\" class=\"size-medium wp-image-8372\" src=\"https://myagingandwellness.com/wp-content/uploads/2018/06/hello-300x169.png\" alt=\"Smooth Skin Course\" width=\"300\" height=\"169\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2018/06/hello-300x169.png 300w, https://myagingandwellness.com/wp-content/uploads/2018/06/hello-768x432.png 768w, https://myagingandwellness.com/wp-content/uploads/2018/06/hello-1024x576.png 1024w, https://myagingandwellness.com/wp-content/uploads/2018/06/hello-624x351.png 624w, https://myagingandwellness.com/wp-content/uploads/2018/06/hello-600x338.png 600w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><p id=\"caption-attachment-8372\" class=\"wp-caption-text\">How to get smooth skin at home</p></div>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p style=\"text-align: center;\">\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"3742418b-3524-58ed-ac3d-4c5af233a4e3"}}