{"data":{"wordpressPost":{"title":"MEN DON’T UNDERSTAND US, BUT CARBS DO!","content":"<h2 style=\"text-align: center;\">MEN DON’T UNDERSTAND US, BUT CARBS DO!</h2>\n<p style=\"text-align: justify;\">I walked into my anti-aging OBGYN’s office and there on the wall was a large poster that read, No carbs after 40! Wow, I thought. This is so true, but so wrong at the same time. I love carbs, I absolutely do. I love to bite into creamy garlic mashed potatoes and feel my problems melt away. I love to eat rice and pasta so much that . . . Heck, I can’t, and don’t, want to live without carbs, ever! I tried it once for about a week and, I swear, I had a mental breakdown!</p>\n<p style=\"text-align: justify;\">I actually lost it on the fifth day, and then checked myself into a Holiday Inn just so I could get away from my family. I needed space. I needed my fix. My body and my mind were so carb-deprived that I actually thought I was losing it. A little dramatic, probably, but wouldn’t you know, just as soon as I got back to those lovely potatoes, I was the good ole me again, happy and a little round.</p>\n<p>&nbsp;</p>\n<p style=\"text-align: justify;\"><img class=\"alignleft\" src=\"https://myagingandwellness.com/wp-content/uploads/2015/08/Stressed-woman-300x237.jpg\" />Remember when you were younger and you could eat anything you wanted and never gain weight? I never thought twice about what food groups I could or couldn’t eat. The more ketchup on the French fries the better. Now, I eat carbs and I blow up. I mean it; I can go a few days on veggies and fish and loose a few pounds, however, just as soon as I put pasta in my mouth, bam!! I have gained weight. It may not be right, but it tastes so good, and it feels so right while I’m eating them.</p>\n<p style=\"text-align: justify;\">Carbs know just the right way to make me happy. I long for the days when I could eat whatever the heck I wanted and never think twice about it, let alone feel guilty for doing so. I am so aware of the guilt when I’m eating carbs that I don’t taste them or enjoy them like I should or like I used to. It’s like I just put them in my mouth, then hurry up and swallow, because I feel so bad for eating them. It’s just wrong how we are punished for eating carbs by our scales and the clothing designers.</p>\n<p style=\"text-align: justify;\">I have been conditioned by my doctor, the media, and magazines, and I have put conditions on myself to feel bad if I enjoy a plate of macaroni and cheese. When I complain that my muffin top looks horrible, and when I’m reminded of the movie stars who’ve had a baby and, within one week, were half the size they were before they got pregnant because they stopped eating carbs and ate only chicken, my mind tells me to just shut up and enjoy my life!</p>\n<p style=\"text-align: justify;\">Our culture (for the moment, at least) looks down on women who eat carbs. As women, we are totally blamed for every pound we gain. I watched one of those housewives shows the other day and one housewife was having a dinner party for another housewife, and she told her chef the only condition she had with the menu was that there were to be no carbs at dinner! So they stay skinny, but they seem so miserable. Really, the only condition is not having even one carb on the menu?</p>\n<p style=\"text-align: justify;\">I know it’s better for me to reduce carbs, yet, I still long for them.  I mean, if I am going to eat them, and get that insulin spike that goes along with them, the one that goes straight from my lips to my hips, I better damn well enjoy them. I better savor every bite of those garlic mash potatoes, that pasta and that wonderful, warm bread with olive oil, if I may say so myself.</p>\n<p style=\"text-align: justify;\">I know full well that a good bowl of macaroni and cheese, though it may create the most pleasurable experience on my tongue and in my brain, will cause me emotional pain when trying to fit into my jeans or while standing in a dressing room of the department store wondering why I look so lumpy and why my stubborn belly hangs over my belt.</p>\n<p style=\"text-align: justify;\">We know at our age, carbs are the villains that keep the weight on us, yet, we still crave and eat them. Honestly, unless you are craving a big boring salad, there is nothing better than the waiter delivering that wonderful pasta dish with a nice glass of wine. Your mood instantly changes when you see your food because, even if only temporarily, you will enjoy every bite you put into your mouth and, for a little while, you will be content.</p>\n<p style=\"text-align: justify;\">Men and women are different because we each have different food preferences. Men love meat and women love carbs, it’s just a fact. Why deny it or fight it.</p>\n<p style=\"text-align: justify;\">Women apparently eat carbs at a much higher rate than men, and we get the wonderful middle age hips and belly to show for it. And you know, once you gain weight at middle age, it’s almost impossible to get rid of it.</p>\n<p style=\"text-align: justify;\">Oh, and did I mention a nice piece of chocolate cake? And who doesn’t like some really good pizza with red wine? Some things in life are not only irreplaceable, but also should be a part of one’s happiness, and this includes carbs. All of them! I say eat those lovely carbs, because carbs understand us even when men don’t.</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/1a55b393f7eea528a320b8e3add90816/1a478/2766763_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"079ea1cd-2719-5f4b-a40d-5a04ab73463c"}}