{"data":{"wordpressPost":{"title":"Turning 50!","content":"<h1 style=\"text-align: center;\">Turning 50!</h1>\n<p style=\"text-align: justify;\">In a few weeks I will be turning 50 years old! I&#8217;m sure like many others before me, when you turn 50 you just can&#8217;t believe it.  How did I get here, and who am I?</p>\n<p style=\"text-align: justify;\">Where did the time go?  I still remember being fifteen and laying on a San Diego beach in my teeny bikini thinking that I would never get old.</p>\n<p style=\"text-align: justify;\">Now that I&#8217;m about to flip the half century mark, it&#8217;s both a scary and somewhat comforting at the same time.  One reason is because a week ago, I lost my mom suddenly right before Christmas and when you lose your mom it puts life in perspective. Not only did I never think I would get old but, I never thought my mom would die.</p>\n<p style=\"text-align: justify;\">Suddenly, the world looks different now.  Would it look as different if my mother hadn&#8217;t passed away while turning 50?  I don&#8217;t know but since she passed, I look at the sky more.  I look around at the world and think about how lucky I am to be here.  I realize more and more that life is flying by and I wan&#8217;t to slow it down but I can&#8217;t.</p>\n<p style=\"text-align: justify;\">I have to be grateful for being 50 because there are those who never made it to 50 and for that, I am blessed to be able to.  My mother and I had a unique relationship and to make a long story short, I loved her dearly while she had a hard time loving my back but, in the end, she did try and she did show me she loved me in the very best way that she could. Her soul is free and I am at peace.</p>\n<p style=\"text-align: justify;\">Maybe her passing was her gift to me so that I could stop running around taking life for granted for the time that I have left.  She could never give me much but, for some reason, for as weird as it sounds, she gave me the ability to fully appreciate my life for once.</p>\n<p style=\"text-align: justify;\">Honestly, I thought for my 50th birthday I would be giving myself a divorce because like many couples that have been married for almost thirty years, we had a lot of ups and downs and, for a while there, I pretty much figured that for the rest our relationship, it would be down and we would fall into the same situation as all of the couples before us.</p>\n<p style=\"text-align: justify;\">Thankfully, through life, there will be times where you really think that you should leave and that, you&#8217;d be better off but, those are the times where you should do nothing and just wait it out.  Things do get better it&#8217;s just that couples evolve both together and as individuals.  Sometimes you have to wait for the other one to catch up and vise versa.</p>\n<p style=\"text-align: justify;\">While I now don&#8217;t have to worry about taking care of an aging parent or finding a new life if I were on my own, I have the time and the resources to step back and get to know myself.  Something that I thought I knew but clearly I really didn&#8217;t. I&#8217;m just beginning to feel the spiritual side of who I really am.</p>\n<p style=\"text-align: justify;\">For my 50th birthday, the gift that I wan&#8217;t more than anything is not some trip around the world to say that I saw everything (although someday that would be nice), but more of a journey with myself.</p>\n<p style=\"text-align: justify;\">A journey that takes me to a place inside that trusts herself, loves herself, stops sabotaging herself and, instead of trying to be like everyone else, embraces the god given spirit and uniqueness that is inside of me.  I think everyone owes themselves this gift.  Otherwise we just breeze through life and get to end and wonder where it went and why didn&#8217;t we use it better.</p>\n<p style=\"text-align: justify;\">If I&#8217;ve learned one thing (okay a few things) in my 50 years it would be to love myself more, accept myself always, and to relax that anxious person inside and lastly, to quit stepping back in a crowd so that I wouldn&#8217;t stand out but rather, step forward and shine in the light that I was given for such a short time.</p>\n<p style=\"text-align: justify;\">Here&#8217;s to turning 50!</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/9a9f329c9442059a3f718a9e09cbeacf/1a478/meandbrandi4-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"f017f5e4-6762-51c3-b844-5ab58c320ac4"}}