{"data":{"wordpressPost":{"title":"How to do Microneedling at home","content":"<h3 style=\"text-align: center;\"><strong>How to do Microneedling at home</strong></h3>\n<p>&nbsp;</p>\n<p style=\"text-align: center;\"><iframe src=\"https://player.vimeo.com/video/222983527\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p style=\"text-align: center;\"><a href=\"https://vimeo.com/222983527\">Derma Roller and Vitamin C &amp; E</a> from   <a href=\"https://vimeo.com/theresaskrobanek\">THERESA SKROBANEK</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\"><strong>How to do Microneedling at home</strong></span></h2>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<h4>Micro-needling is a procedure that usually your doctor or an Esthetician does.</h4>\n<h4>It works by using tiny needles that go over the skin that create tiny puncture wounds (small little holes) and then our skin repairs these wounds by creating collagen.  Thus, creating the new skin that is smoother and tighter.</h4>\n<h4>Collagen also helps with building new scaffolding in our skin.  What this means is that it will somewhat tighten the jaw area.  It will not tighten like a facelift but, over time, if you have minimal sagging Microneedling will help.</h4>\n<h4>As we get older, we produce less collagen and the signs of aging appear.  We can also consume collagen supplements daily to help with this too and, I show you how on another post here.</h4>\n<h4>Micro-needling is a non-invasive procedure with very little downtime.  When I get it done my dermatologist&#8217;s office, it usually takes about an hour to complete and that time is spent mostly numbing my face because, doctors have certain settings they use and they can go up or down on the pressure, which for most of us, it can get a little painful.</h4>\n<h4>However, if you are like me, and you want to do procedures at home with minimal downtime and, that work fantastic.  Then I am here to introduce you to Derma Rolling.</h4>\n<p>&nbsp;</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\"><strong>How to do Microneedling at home</strong></span></h2>\n<p>&nbsp;</p>\n<h4>If you watched the video I have above, you would have seen how it works.</h4>\n<h4>I use it about every two to three weeks.  You never want to use a roller or, do anything to your skin, like a peel or other procedures until, the one that you have done is completely healed, which usually takes about two weeks or so.</h4>\n<h4>The reason you want to wait is that we want to wound the skin in a controlled way, therefore, the body can do its job and create collagen to fill and repair the wound.  This is how we get smoother skin.</h4>\n<h4>If you were to do a procedure on skin that is not healed completely, you would be causing inflammation and with this, you would actually cause damage to your skin and damage causes wrinkles and scars.</h4>\n<h4>Get your Derma Roller and your Vitamin C &amp; E serum from my links below and get started.  These are the exact products that create amazing results.</h4>\n<h4>When you get the Derma Roller you will start with a clean face, neck, and chest.  Take the Derma Roller and on a scale of one to ten, begin rolling with a pressure of about a three or so.  As you get used to it, you can add pressure.</h4>\n<h4>Step one:</h4>\n<h4>Start with your face then your neck and then, your chest.  Go at your own tolerance.  It will tingle or sting slightly but again, you can adjust the pressure as needed.</h4>\n<h4>Step two:</h4>\n<h4>After you have rolled your face, neck, and chest, use the Vitamin C &amp; E serum to go over these areas completely.  It will help heal your skin faster and stimulate collagen growth.  The vitamin c makes a huge difference, trust me.</h4>\n<p>&nbsp;</p>\n<h4 style=\"text-align: center;\">Below I have my two links for the exact products that I use.</h4>\n<p>&nbsp;</p>\n<h4 style=\"text-align: center;\">Here is the link for the Derma Roller that I use and for the Vitamin C &amp; E serum for recovery!</h4>\n<p style=\"text-align: center;\">Derma Roller Micro Needle Roller Skin Care System 0.25mm Includes Storage Case Home Use 540 Titanium Needles:  <a href=\"http://amzn.to/2s8xBcY\">http://amzn.to/2s8xBcY  </a></p>\n<p>Full disclosure:  The Amazon link above is my affiliate link which I get a small commission on.</p>\n<p style=\"text-align: center;\">Cosmetic Skin Solutions Vitamin C &amp; E:  <a href=\"http://amzn.to/2sDyUVb\">http://amzn.to/2sDyUVb</a></p>\n<p style=\"text-align: center;\"><img class=\"alignnone size-full wp-image-7521\" src=\"https://myagingandwellness.com/wp-content/uploads/2015/08/mepicture-278x280.jpg\" alt=\"\" width=\"278\" height=\"280\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2015/08/mepicture-278x280.jpg 278w, https://myagingandwellness.com/wp-content/uploads/2015/08/mepicture-278x280-150x150.jpg 150w, https://myagingandwellness.com/wp-content/uploads/2015/08/mepicture-278x280-180x180.jpg 180w\" sizes=\"(max-width: 278px) 100vw, 278px\" /></p>\n<h4 style=\"text-align: center;\">For more ways to lose the wrinkles and get smoother skin, check out my link below:</h4>\n<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">If you seriously want smoother skin then check out my &#8220;Smooth Skin&#8221; course where I will show you exactly how I get it.  No needles, fillers or surgeons needed here!</span></h3>\n<h4 style=\"text-align: center;\"><a href=\"https://how-to-get-smoother-skin.teachable.com\"><span style=\"color: #ff0000;\">https://how-to-get-smoother-skin.teachable.com</span></a></h4>\n<p style=\"text-align: center;\"><img class=\"alignnone size-full wp-image-7855\" src=\"https://myagingandwellness.com/wp-content/uploads/2017/06/GIFlogoColorSmall.gif\" alt=\"\" width=\"250\" height=\"151\" /></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"af271a18-62d3-52c7-8651-1f721316e151"}}