{"data":{"wordpressPost":{"title":"To be buried or cremated?","content":"<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p style=\"text-align: center;\">To be buried or cremated?</p>\n<p>&nbsp;</p>\n<p>To be buried or cremated?  Two years ago, the woman that I never thought would age let alone pass away did in fact die.</p>\n<p>I got a call, it was unexpected (aren&#8217;t most deaths anyway?) and then my mother was gone.</p>\n<p>We never talked about where she wanted her final resting place to be but, it was something we all knew, and that was, none of us wanted to be put into the ground.</p>\n<p>So, when she passed away, I was solely responsible for her as I lost my little brother eighteen months to the day of her passing and, my older brother was disabled due to a twenty-five-year opiate addiction in which sadly, my mother succumbed to as well.</p>\n<p>I was in charge of deciding where I would place my mothers remains.</p>\n<p>My mother was distraught like any mother would be when she lost her youngest child.  But, she put on a brave face for the time being, and I had my baby brother cremated (mostly because it was affordable and again, no one ever talked about death in our family so what else would I do?).</p>\n<p>Cremation was swift and efficient.  No long and drawn out funeral arrangements or watching my mom fall apart next to his grave.    My mother was never a strong-willed person.  I always rescued her from herself and taking care of my little brother was something I had always done.</p>\n<p>When I offered to take my brothers ashes back to our hometown of San Diego, California, she resisted and said that she wanted them to be with her for a while.  &#8220;Until she was ready to let them go,&#8221; she said.</p>\n<p>Oddly enough, I knew what that meant.  She too would go with my brother.</p>\n<p>That&#8217;s exactly what happened.</p>\n<p>He passed on June 21, 2013.  She passed on December 21, 2015.</p>\n<p>I heard my cell phone right at 1:30 in the morning, looked at the number coming from my mom&#8217;s house and knew instantly, that she was gone.  We all know that when a phone rings in the middle of the night, it&#8217;s never good news.</p>\n<p>I drove an hour to her house.  Sat by her side on her couch.  Kissed her goodbye on the cheek and then stood back while the coroner put her frail little body into a black zip-up bag.</p>\n<p>The coroner said he was sorry.  I watched them drive away.  I took my little brothers ashes from her coffee table, and I went back home.</p>\n<p>It was Christmas then, and I had a house full of people.  I  had little time to grieve, but crazy as it was, I called the same funeral home the next day and arranged to have her cremated as soon as possible.</p>\n<p>I couldn&#8217;t wait to take her and my brother back home where they could finally be together.</p>\n<p>It was as though it was meant to be.</p>\n<p>April 17th, 2016 (on her birthday), I flew to San Diego with my mother and my brother tucked away tightly in my designer carry on bag.</p>\n<p>After the airport security opened up and checked out the ashes, I was on the plane.</p>\n<p>I chartered a boat, and right at the border of San Diego and Mexico, I released my brother and my mother.</p>\n<p>The pain finally weighed on both my mind and my chest.  I hadn&#8217;t cried until that moment.</p>\n<p>It was relieving to cry, but it was even more relieving to see them together again.</p>\n<p>It was beautiful, and FINALLY, they were at peace and selfishly I was too.</p>\n<p>I watched their remains drift peacefully out into the ocean while at that very moment the world stopped and I could feel every part of them and every memory of growing up with them both.</p>\n<p>I don&#8217;t think I could have fully appreciated bury them in the ground.</p>\n<p>Yes, when a person is cremated, no one can come and visit them.  But really, are they there?</p>\n<p>I have some peace in thinking that I let them go and they are patiently waiting for me rather than me going to a cemetery when I know darn well they are not there.</p>\n<p>I&#8217;d rather know that somewhere out there; my soul is released and then maybe, if there is another life, I will drift back again.</p>\n<p><span style=\"color: #3366ff;\"><strong>If you&#8217;re interested in seeing their burial at sea,  I have posted the video below for you to check out.  I was using my iPhone while my husband released their ashes.</strong></span></p>\n<p><iframe src=\"https://player.vimeo.com/video/251253286\" width=\"625\" height=\"352\" frameborder=\"0\" title=\"Burial at Sea\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe></p>\n<p style=\"text-align: center;\">I hope there is life after death and they know that they are together again.  I hope they are with everyone that passed before them.  I hope they are happy.  You know, in a way that we don&#8217;t understand just yet?</p>\n<p style=\"text-align: center;\">So the question of &#8220;To be buried or cremated?&#8221; Is most likely to be answered by how your family usually deals with death throughout their history or, like mine, doesn&#8217;t deal with it at all thus,   having to create my traditions.  I hope I was right in making the decision I made and when I look back at the video, I know that I was.</p>\n<p style=\"text-align: center;\">I hope I was right in making the decision I made and when I look back at the video, I know that I was.</p>\n<p style=\"text-align: center;\">Yes, I will be cremated, and I will be put at the same longitude and latitude at sea.</p>\n<p style=\"text-align: center;\">I used to think that if you talked about your death and where you want your remains to go, that it would create a bad omen.  That&#8217;s not how I feel, and I have let my husband and my kids know where I finally be.</p>\n<p style=\"text-align: center;\">That&#8217;s not how I feel now, and I have let my husband and my kids know my wishes.</p>\n<p style=\"text-align: center;\">Until then, I am going to live like there is no tomorrow 🙂</p>\n<p style=\"text-align: center;\">To be buried or cremated?</p>\n<p style=\"text-align: center;\">In case you would like to see a spiritual perspective, I had attached a link below:</p>\n<p style=\"text-align: center;\"><a href=\"https://www.spiritualresearchfoundation.org/spiritual-research/death-and-dying/Cremation-vs-burial\">https://www.spiritualresearchfoundation.org/spiritual-research/death-and-dying/Cremation-vs-burial</a></p>\n<p style=\"text-align: center;\">If you are interested in a biblical perspective, I have also attached a link below:</p>\n<p style=\"text-align: center;\"><a href=\"https://www.thoughtco.com/what-does-the-bible-say-about-cremation-700373\">https://www.thoughtco.com/what-does-the-bible-say-about-cremation-700373</a></p>\n<p style=\"text-align: center;\">\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/63fb513c80adf88adc67625a3c256d3b/1a478/18860418_s.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"5af62b88-6a8d-505b-820e-595c0a7a81cf"}}