{"data":{"wordpressPost":{"title":"BE YOUR BEST AT ANY AGE","content":"<p style=\"text-align: center;\"><em>BE YOUR BEST AT ANY AGE</em></p>\n<p style=\"text-align: justify;\"><em> </em></p>\n<p style=\"text-align: justify;\">Who knows what the fountain of youth is. We all know aging catches up with us very quickly. They say, the older you get, the faster you age. It’s as though we wake up one day and something’s changed!</p>\n<p style=\"text-align: justify;\">You’re rocking along in your life looking and feeling great and then suddenly, out of nowhere, reality hits you; you can’t do the same things or look the same as you did. Never fear, contrary to what we have been told, there are things we can do to slow down the aging process and keep ourselves on top of our game, and to, as the say, “age gracefully.”</p>\n<p style=\"text-align: justify;\">As far as I am concerned, beauty companies are liars! And we all know they are not anti-aging us, but putting moisture on top of our skin and taking our money. Like the Oil of Olay commercial says, “Do you still have wrinkles even after the wrinkle cream is gone?” The fact of the matter is, we are going to go through many changes with our mind, body and appearance.</p>\n<p style=\"text-align: justify;\">Unless you have a fortune to pay for plastic surgery (even that doesn’t look good after a while), you will be like the rest of women. Your skin will age and your body fat will shift to places you never would have imagined.</p>\n<p style=\"text-align: justify;\">Your shape will change, your health will change and, suddenly, you will have to make quick modifications in order to work with what you have. Don’t be sad, it happens to all of us.</p>\n<p style=\"text-align: justify;\">Is it fair? Heck no. Can we do much about it, very little. The sooner we accept that we will age no matter what, the sooner we can move along and find peace and look our best at any age for the age we are at the time.</p>\n<p style=\"text-align: justify;\">If I could tell you one thing that will anti-age you, and it doesn’t cost you a dime, and it’s probably the closest to the fountain of youth you will ever know, would you want to know about it?</p>\n<p style=\"text-align: justify;\"><em>Of course you do</em>, so here it is!!! EXERCISE! That’s it! Exercise at least five days a week. You will keep your weight down and your butt where it is, and even improve upon it.</p>\n<p style=\"text-align: justify;\">It will keep the blood pumped to your skin giving you a natural glow. People lose thirty percent of their muscle strength between the ages of fifty and seventy, and then lose another thirty percent for each decade thereafter.</p>\n<p style=\"text-align: justify;\">Alarming, if you think about it, because we need good muscle tone. We need to work out for balance and mobility as we get older.  It will be even more important to maintain muscle tone as we become elderly.</p>\n<p style=\"text-align: justify;\">The reason staying active is more important than ever is it keeps us coordinated so we don’t fall and break a hip, and it keeps the neurons in our brains firing. We need to keep our brains active to avoid dementia and to remember things like names of people, which I am very bad at. You don’t have to hit the gym and run ten miles, or take a cardio spinning class until you pass out.</p>\n<p style=\"text-align: justify;\">I’m simply talking about walking, riding a bike, swimming, or taking a dance class, and definitely lift weights to keep your muscle tone and bones strong. Whatever you do, you must also wear sunscreen everyday, as the sun is the number one reason we get wrinkles!</p>\n<p style=\"text-align: justify;\">For me, I work out, and I take in one gram of protein for every pound I weigh, and I also take supplements daily. Although I do have my bad habits, like drinking wine daily, I justify this by taking exceptionally good care of myself the rest of the time, as in eating organic, very little carbs and drinking a ton of water.</p>\n<p style=\"text-align: justify;\">Don’t forget to go to the doctor yearly, and get your mammogram, too. I know we can only control, and so do, so much to ward off disease and remain energetic and the rest is, just what will be what it is. Our cells are programmed genetically to die at a certain point and there is nothing we can do about that. However, don’t underestimate environment verses biology.</p>\n<p style=\"text-align: justify;\">We are in more control of our outcome then we give ourselves credit for. The goal may not be to live forever, but to forever live while we are here.</p>\n<p style=\"text-align: justify;\">Get a free cheat sheet to get your  workout without killing yourself.  Click the link below.</p>\n<p style=\"text-align: justify;\"><a href=\"https://theresaskrobanek.leadpages.co/how-to-get-your-daily-workout/\">https://theresaskrobanek.leadpages.co/how-to-get-your-daily-workout/</a></p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"034ae17e-9cf4-5be2-a5a4-c1a0451db136"}}