{"data":{"wordpressPost":{"title":"What&#8217;s up with doctors these days!!","content":"<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">What&#8217;s up with doctors these days!!</span></h2>\n<p>&nbsp;</p>\n<p style=\"text-align: justify;\">I feel both pissed off and like I won the lottery at the same time!</p>\n<p>For the last two years, I have had PVC&#8217;s which means that my heart has premature ventricular contractions.  &#8220;Premature ventricular contractions (PVCs) are premature heartbeats originating from the ventricles of the heart. Premature ventricular contractions are premature because they occur before the regular heartbeat.&#8221;</p>\n<p style=\"text-align: justify;\">I found this out because I was going to have a minor cosmetic procedure and the doctor did an EKG, and it came back abnormal.  She said that she wouldn&#8217;t do the procedure until I got a heart doctor to clear me.</p>\n<p style=\"text-align: justify;\">So, after thousands of dollars to satisfy my deductible, I had a stress test, a heart halter monitor, more EKG&#8217;s, a Nuclear heart test (radio active dye put in my veins), and an echocardiogram, and a few other tests.</p>\n<p style=\"text-align: justify;\">I went&#8217; to my &#8220;Natural OBGYN&#8221; to tell her that every since she put me on thyroid medicine, I could feel my heart palpitating.  She took blood, I went back and she said, it was not the thyroid medicine but that my heart issue was just part of aging.</p>\n<p style=\"text-align: justify;\">With sadness, I took her words and thankfully my heart came back normal.  I got my clearance from the heart doctor and I got my procedure.</p>\n<p style=\"text-align: justify;\">For the next year or so, I went back four times to tell my OBGYN that there was something wrong with my heart.  She couldn&#8217;t find anything.</p>\n<p style=\"text-align: justify;\">I decided to get another opinion and went to an Endocrinologist and he said that I should stay on the thyroid medicine because he said my blood level was normal and now found a nodule on my thyroid meaning, my thyroid was attacking itself.</p>\n<p style=\"text-align: justify;\">I Got the nodule tested and it too was fine. So, I took more thyroid medicine. I felt like I was on diet pills, my heart felt like it was jumping out of my chest and, I felt bad all of the time.</p>\n<p style=\"text-align: justify;\">I was close to accepting living this way.  Until, I needed another minor surgery and the anesthesiologist decided to give me yet, another EKG because, by now I was on blood pressure medication because of my heart rate and, my PVC&#8217;S were twice as bad as the time before.</p>\n<p style=\"text-align: justify;\">She said she would not put me under and said again that I needed heart clearance. They pulled the I&#8217;V&#8217;S out and after losing my payment to secure the surgery, I was again, spinning trying to figure out what to do next.</p>\n<p style=\"text-align: justify;\">After getting dressed and being kindly told not to come back until I could figure out my health issue, I sadly walked to my car.</p>\n<p>I called my OBGYN in the parking lot and she said to come right over and get my thyroid tested.  By now, I was tired of playing this game.  I decided she was the problem and that I needed to find a way to get off of thyroid medication.  She actually wanted me to take more as she said I was even on the low end!</p>\n<p style=\"text-align: justify;\">I almost cried because I thought for a second that maybe my heart was failing and my life would end up being short.  I recently lost my brother to the side effects of radiation near his heart and I concluded that I would be next.</p>\n<p style=\"text-align: justify;\">After all, I am going to be 50 in a couple of months and they say that heart disease is the number one killer of women over 50.  I thought it was just my fate and I was going to have to live with a bad heart valve or something.</p>\n<p style=\"text-align: justify;\">I did get another blood test and took it to a new endocrinologist.  He said as soon as I told him the symptoms and what I was taking, he told me the problem was the name brand &#8220;Armour&#8221; and that it was made from pigs and that, sometimes we can&#8217;t handle pig thyroid.</p>\n<p style=\"text-align: justify;\">He said in some people it causes an electrical arrhythmia.  He might as well have said, &#8220;Theresa, your hell is over and you&#8217;ve been saved.&#8221;</p>\n<p style=\"text-align: justify;\">Now, I&#8217;m 90% Vegan which goes against me taking pig medicine but I&#8217;m also 100% proactive in my health and I know my body.</p>\n<p style=\"text-align: justify;\">The doctor also said that, every dose is a different dose meaning that, it comes from different pigs so my body has an issue with it.</p>\n<p style=\"text-align: justify;\">I don&#8217;t know how many times I asked my &#8220;Natural OBGYN&#8221; to think about switching my brand.  Nope! She knew best because she was &#8220;the doctor.&#8221;</p>\n<p style=\"text-align: justify;\">Long story short (okay I&#8217;m making it short because you&#8217;re probably tired of this already), the new endocrinologist took me off of Armour thyroid medicine and eight weeks later my blood tests show I don&#8217;t or maybe never needed thyroid medication it in the first place!</p>\n<p style=\"text-align: justify;\">My heart rhythm is back to normal and I don&#8217;t feel like I&#8217;m ready to jump off a cliff!</p>\n<p style=\"text-align: justify;\">I won&#8217;t get back all of the money and time that I lost over this and I swear being over medicated aged me but, it&#8217;s better late than never to save myself.</p>\n<p style=\"text-align: justify;\">The take away here is:  If you know your body and it&#8217;s telling you that the doctors are not right then listen to yourself.</p>\n<p style=\"text-align: justify;\">No doctor will take care of you like you and, get lot&#8217;s opinions until you get the right answers.</p>\n<p style=\"text-align: justify;\">While my heart was being damaged, my &#8220;Natural OBGYN&#8221; was ranting about how she&#8217;s opening her seventh natural anti-aging clinic.  I kindly said, maybe you should work on your first one!</p>\n<p style=\"text-align: justify;\">I think I will re-think natural aging from now on. What&#8217;s up with doctors these days?</p>\n<p style=\"text-align: center;\">\n<h2><span style=\"color: #ff00ff;\"><em>If you would like to find more ways to Rejuvenate.  I have created a six-step course called &#8220;The Rejuvenation Program&#8221; </em></span></h2>\n<h2><span style=\"color: #ff00ff;\"><em> You can check it out by clicking this link: <span style=\"color: #000000;\"><a style=\"color: #000000;\" href=\"http://www.therejuvenationprogram.com/\">http://www.therejuvenationprogram.com</a></span></em></span></h2>\n<div id=\"attachment_8361\" style=\"width: 310px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8361\" class=\"size-medium wp-image-8361\" src=\"https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-300x251.png\" alt=\"The Rejuvenation Program\" width=\"300\" height=\"251\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-300x251.png 300w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-768x644.png 768w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-624x523.png 624w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-600x503.png 600w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program.png 940w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><p id=\"caption-attachment-8361\" class=\"wp-caption-text\">The Rejuvenation Program</p></div>\n<p style=\"text-align: center;\" align=\"center\">\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"eb754a20-1049-5635-a5f8-169dfeb29f57"}}