{"data":{"wordpressPost":{"title":"I&#8217;m gonna describe loneliness &#8230;","content":"<p>&nbsp;</p>\n<p style=\"text-align: center;\"><em>&#8220;I&#8217;m gonna describe loneliness so y&#8217;all who have never experienced it no how I feel&#8221;</em></p>\n<p style=\"text-align: justify;\">While scrolling down my Facebook page today, I came across this post from someone I met while on vacation a couple of years ago.  Although we don&#8217;t know each other that well, we keep in contact like most everyone else on Facebook.</p>\n<p style=\"text-align: justify;\">I found her post to be very moving because I&#8217;m sure that there are many lonely people in the world and I&#8217;d predict that many of us will be there at some point in our lives.</p>\n<p style=\"text-align: justify;\">Even if we have a companion now, as in life, we will all end up of alone one day.</p>\n<p style=\"text-align: justify;\">The question that I ask myself is &#8220;&#8216;Tis better to have loved and lost than never to have loved at all?&#8221;</p>\n<p class=\"bq_fq_a\"><a id=\"qa_153702\" href=\"http://www.brainyquote.com/quotes/authors/a/alfred_lord_tennyson.html\">Alfred Lord Tennyson</a></p>\n<hr />\n<p class=\"bq_fq_a\">With her permission, here is her exact post:</p>\n<p style=\"text-align: justify;\"><em>&#8220;I&#8217;m gonna describe loneliness so y&#8217;all who have never experienced it no how i feel you wake up in the morning to your own alarm you take a shower and cook your own breakfast and go to work with no one to kiss good bye at the door you come home to nobody who asks you how your day was and no one to tell it too you take off your fcn bra and get into something comfortable and pour yourself a drink turn on the gut wrenching news to keep up with the hateful world we live in and cook yo<span class=\"text_exposed_show\">ur own dinner during the commercials without missing a thing on the news when you&#8217;ve finished and are ready to sit down and eat you,sit in front of the tv and watch the rest of the commercials and finish by the time the programming,comes back on then you get up and scrape the plate and wash the dish and the pots you used and go back to the tv for more,commercials while you wish you could turn off the tv and have someone to talk to about your day your plans your dreams and there is no one there so you go on face book and make a few status comments about how your day was so stressful and the pain you&#8217;re feeling from working so hard and all you get back is &#8220;likes&#8221; so you&#8217;ve cleaned the kitchen and everything is shiney and its time for your bath. You run the water sit in the warm tub and relax with a drink while you soak until your finger tips are wrinkled then you pull the drain plug and step out onto the bath mat and fish for the soft towel while you still have water on your eyes and your hair is dripping wet, you dry your eyes then your hair with the towel and then the rest of you while you enjoy the soothing pleasure of the towel scratching your back since it hasn&#8217;t never been scratched by a human for as long as you can remember,,you take another towel to dry the rest of your hair and wrap your naked body into the towel you used to dry yourself and go to your bedroom and put on a negligee thinking you want to look pretty just in case that moment might come and you go back to the tv for more commercials because its still too early to go to bed and you watch,tv until you fall asleep and wake up at 3 am feeling to awake to go back to bed until the alarm goes off at 6 am but you do anyway and you toss and turn. Praying for the alarm to go off so you can get up and get ready for work&#8230; This is every day no one comes over no one calls everyone thinks you&#8217;re so happy bcz they see you on Saturday dancing your ass off with some ass hole that just dances with you cz he thinks its a chance to get close to your body who he hasn&#8217;t even bought you a drink yet and is already thinking about,getting laid while you are buying your own drinks,,,boom then its time to go home you go in your house crash in your bed and wake up to another similar day to enjoy by your self with no vocal sounds from you except a cough or a phone call from a wrong number or to reject a telemarketer how do you define lonely or am i just being selfish?&#8221;</span></em></p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":null},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"eae3ef3e-a842-5ed3-b54d-813d08276938"}}