{"data":{"wordpressPost":{"title":"Hormones and Aging Skin","content":"<h1 style=\"text-align: center;\">Hormones and Aging Skin</h1>\n<p>&nbsp;</p>\n<p style=\"text-align: justify;\">Hormones help prevent skin from aging. We have all seen it, or maybe we have been troubled by the changes we’re seeing in our own skin. Thin skin, sagging, dullness, lines and wrinkles (sorry, I had to remind you).</p>\n<p style=\"text-align: justify;\">Unfortunately, it happens to everyone at some time. For many of us, we want to look as young as we feel, however, sometimes the outside is not so accommodating to the inside. As we age, especially starting in our thirties and forties, our hormones begin to decline and then diminish over time.</p>\n<p style=\"text-align: justify;\">Because of this, our skin becomes fragile, thin, wrinkled and, sags. If you have gone through menopause than you should know that it’s been stated that, we will lose thirty percent of our skin’s collagen in the first five years after menopause! Ouch! You can counter this effect! We can use oral hormones or hormone creams (prescribed by a doctor) to increase collagen support.</p>\n<p style=\"text-align: justify;\">I personally, am not one for taking synthetic hormones, as I believe there is an increased risk of breast cancer and other harmful effects. I use a bioidentical hormone cream prescribed by my doctor.</p>\n<p style=\"text-align: justify;\">Does it help my skin? I like to think so. For me, it’s been an accumulative effect of bio-identical hormones, peels, topical retinoid, vitamin C serums, sunscreen, supplements, exercising and a semi-clean diet that keeps me and my skin balanced.</p>\n<p style=\"text-align: justify;\">It’s important to have your hormones tested routinely, as you want to keep your hormones balanced. I was skeptical at first going on a bio-identical hormone treatment, as I thought if I did, I’d get cancer. Because of reading and hearing that hormones cause cancer (in the wrong context), I fought taking them! Eventually, I opened up my mind and learned just the opposite.</p>\n<p style=\"text-align: justify;\">Note: All hormone replacement therapy has some cancer risks. However, if monitored, these can be minimized.</p>\n<p style=\"text-align: justify;\">According to many doctors and research, balancing our hormones keeps us from getting cancer instead of the reverse. In fact, it’s having very little hormones that may cause cancer in the first place or, at least can contribute to it.</p>\n<p style=\"text-align: justify;\">As I said, I personally would not take oral hormones, but that’s just me and you have to make an educated decision based on what is right for you. At the very least, it’s good to see where your levels are. Okay, back to my point. When you let your hormones fluctuate, it can have a negative impact on your skin. The bottom line is to get your hormones tested and get them balanced, if even just for a better quality of health and skin.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Check out my free &#8220;2 Cheat Sheet Fast Weight Loss Formula&#8221; It&#8217;s the fastest and easiest way to lose weight in either two or four weeks! Down load it right here:</p>\n<p style=\"text-align: center;\"><a href=\"http://tinyurl.com/ztxw2xk\">http://tinyurl.com/ztxw2xk</a></p>\n<p style=\"text-align: center;\"><img src=\"https://myagingandwellness.com/wp-content/uploads/2015/11/2-693x1024-203x300.jpg\" alt=\"\" width=\"152\" height=\"224\" class=\"alignnone size-medium wp-image-7336\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2015/11/2-693x1024-203x300.jpg 203w, https://myagingandwellness.com/wp-content/uploads/2015/11/2-693x1024.jpg 693w, https://myagingandwellness.com/wp-content/uploads/2015/11/2-693x1024-624x922.jpg 624w\" sizes=\"(max-width: 152px) 100vw, 152px\" /></p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"66240576-93f6-5877-92c7-415cbc94b35e"}}