{"data":{"wordpressPost":{"title":"There&#8217;s no place for old people","content":"<h1 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">There&#8217;s no place for old people</span></h1>\n<p>&nbsp;</p>\n<p>I&#8217;ve always said, &#8220;there&#8217;s no place for old people.&#8221;  I&#8217;m turning 50 next month and yeah, I know, I was young once.  I have nothing against the younger generation as I see them as being one of the most creative generations there has ever been.</p>\n<p style=\"text-align: justify;\">I didn&#8217;t say the most inventive (but close) however, definitely, the most creative.  To live in a time of such where there are so many creative minds of young people where they create systems and platforms from just pure imagination is a gift that I feel honored to be a part of.</p>\n<p style=\"text-align: justify;\">Let&#8217;s be honest here, my mother is 71 years old and she has no clue about technology, apps or, where the world has the potential to go.</p>\n<p style=\"text-align: justify;\">The closest thing she sees outside of her world is the YouTube channel that I set up for her on her living room television.</p>\n<p style=\"text-align: justify;\">She&#8217;s fascinated to see the world through the eyes of others, more specifically, through real life videos and what she has and will, never experience.</p>\n<p style=\"text-align: justify;\">The truth is, at her age, YouTube will be the closest that she&#8217;ll ever get to a world outside of herself.  And with that, I say, have fun mom.. Do what makes you happy while you still can.</p>\n<p>Back to my initial topic of &#8220;there&#8217;s no place for old people.&#8221;  Sorry, my ADHD kicks in quite often!!  Actually, about every five seconds and it&#8217;s only getting worse as I age.. But it&#8217;s also my gift as well as my curse.</p>\n<p style=\"text-align: justify;\">Okay, now what was I talking about? Oh yeah!</p>\n<p style=\"text-align: justify;\">They say the older you get the faster you get older.  I know what this means because the last ten to twenty years have flown by.  Each day flies by in fact, and I watch the clock and instead of when I was younger, wanting the time to go by as fast as possible, I watch the clock as my heart sinks and I fear that another day is about to end. I hate how fast time is going but, I have no control over time. We&#8217;re all going to get old whether we like it or not.</p>\n<p style=\"text-align: justify;\">I&#8217;m getting older and if life goes faster now that I&#8217;m older then how much longer do I have, I wonder?  Right now I still look reasonably okay and I am able to do anything physically.  The real worry is when, I get to that age where I&#8217;m really old and when people look past me.  Like being invisible. Which is not very far away even if I still feel and act like I&#8217;m eighteen!</p>\n<p style=\"text-align: justify;\">Society loves youth and society rewards youth and, probably like most others, I feel like I didn&#8217;t appreciate my youth when I had it.  With that said, I like most people, did the best I could with what I had, and for that, I am grateful for who I am today.</p>\n<p style=\"text-align: justify;\">If I could sum up what I&#8217;m trying to say here is just read the lyrics the Baz Luhrmann, Wear Sunscreen song below.</p>\n<p style=\"text-align: justify;\">&#8220;Enjoy the power and beauty of your youth<br />\nOh, never mind You will not understand the power and beauty of your youth until they have faded But trust me, in 20 years you’ll look back at photos of yourself<br />\nAnd recall in a way you can’t grasp now How much possibility lay before you<br />\nAnd how fabulous you really looked&#8221;</p>\n<p style=\"text-align: justify;\">&#8220;Don’t worry about the future<br />\nOr worry But know that worrying is as effective as trying to solve an algebra equation by chewing bubblegum The real troubles in your life are apt to be things that never crossed your worried mind The kind that blindside you at 4 PM on some idle Tuesday<br />\nDo one thing everyday that scares you.&#8221;</p>\n<p>&#8220;Don’t be reckless with other people’s hearts Don’t put up with people who are reckless with yours.&#8221;</p>\n<p style=\"text-align: justify;\">&#8220;Don’t waste your time on jealousy Sometimes you’re ahead, sometimes you’re behind<br />\nThe race is long And in the end, it’s only with yourself.&#8221;</p>\n<p style=\"text-align: justify;\">&#8220;Remember the compliments you receive, forget the insults. If you succeed in doing this, tell me how.&#8221;</p>\n<p style=\"text-align: justify;\">I don&#8217;t know about you but, I think those are some pretty powerful lyrics and you pretty much have to be older to appreciate them.</p>\n<p style=\"text-align: justify;\">I feel like I have some time to do the things that I want and to love the people who are in my life and, who I know  will naturally leave me sooner than I hope.</p>\n<p style=\"text-align: justify;\">Maybe that&#8217;s the key to getting old.  We become fulfilled with the love that we give and the things we did while we are here.  Once you can or have done this, you can begin to step back and let others have the space that you once had.</p>\n<p style=\"text-align: justify;\">Maybe its not looking at others like they&#8217;re taking your space at all but, it&#8217;s just the natural form of energy that we as old people have to transfer so that energy can re-circulate so that, the younger generation can have it to use.</p>\n<p style=\"text-align: justify;\">Whatever the rest of my days will bring me and no matter how fast they come, I will remember that,  I got to live an incredible life because it was my life.</p>\n<p style=\"text-align: justify;\">Even if didn&#8217;t create some huge powerful company, an app that changed the world or, I wasn&#8217;t the most beautiful woman in the world, I had the opportunity to grow old and for some, they don&#8217;t even get that chance.</p>\n<p style=\"text-align: justify;\">All that will matter in the space and time I have left is that I was born, born free, I created some beautiful kids and I was nice, giving, loving and compassionate towards others.</p>\n<p style=\"text-align: justify;\">I guess the whole point to this blog post is not so much about &#8220;there&#8217;s no place for old people&#8221; but about &#8220;reflection is the greatest gift an old person can give themself.&#8221;</p>\n<p style=\"text-align: justify;\">Here&#8217;s to our place 🙂</p>\n<p style=\"text-align: justify;\">*Since writing this post, my mom passed away.. Rest in peace you are free now I will see you in heaven mom 😇</p>\n<h2><span style=\"color: #ff00ff;\"><em>If you would like to find more ways to Rejuvenate.  I have created a six-step course called &#8220;The Rejuvenation Program&#8221; </em></span></h2>\n<h2><span style=\"color: #ff00ff;\"><em> You can check it out by clicking this link: <span style=\"color: #000000;\"><a style=\"color: #000000;\" href=\"http://www.therejuvenationprogram.com/\">http://www.therejuvenationprogram.com</a></span></em></span></h2>\n<div id=\"attachment_8361\" style=\"width: 310px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8361\" class=\"size-medium wp-image-8361\" src=\"https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-300x251.png\" alt=\"The Rejuvenation Program\" width=\"300\" height=\"251\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-300x251.png 300w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-768x644.png 768w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-624x523.png 624w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-600x503.png 600w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program.png 940w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><p id=\"caption-attachment-8361\" class=\"wp-caption-text\">The Rejuvenation Program</p></div>\n<p style=\"text-align: center;\" align=\"center\">\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"2da0bff7-1407-544b-9eb9-9f0acaa88491"}}