{"data":{"wordpressPost":{"title":"Goodbye Moma you&#8217;re free now..","content":"<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Goodbye Moma you&#8217;re free now..</span></h2>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Goodbye Momma you&#8217;re free now..  On December 20, 2015, at one in the morning, I heard the sound of my phone buzzing in my purse next to my bed.  Now, I always turn off my phone because I don&#8217;t sleep too well and if my phone is on, I will surely look at social media all night, which in turn, keeps me awake.</p>\n<p style=\"text-align: justify;\">On this night, I didn&#8217;t turn my phone off and unfortunately, as everyone knows, when your phone rings in the middle of the night, the news is probably not good.</p>\n<p style=\"text-align: justify;\">I looked down at my purse, I saw the light flickering and thought it&#8217;s bad news so why answer it?  Couldn&#8217;t the bad news wait until the morning when I could handle bad news better?  But then, I realized how selfish that would be if I did wait and how unfair it would be for the person on the other side making the call.</p>\n<p style=\"text-align: justify;\">I got out of bed, got my phone and went into the living room.  It was my brother, and in a sad and raspy voice he told me that our mother had passed away on her living room couch all alone.</p>\n<p style=\"text-align: justify;\">Earlier in the day, he and our mother had gotten into an argument (which was happening more often between them) and that he had storm out the door.  When he returned that night, he saw her laying on the couch but the weird thing was that, she was laying in the same position for seven hours.  He said when he saw her he knew that she had passed away.</p>\n<p style=\"text-align: justify;\">I told him to call 911 and go outside and that I would come over.  I sat silently in my living room for two hours just wondering if I really wanted to rush over to my mothers house and see her dead on her couch.  I just didn&#8217;t think I could handle seeing her laying there and I certainly didn&#8217;t want that to be my last memory.</p>\n<p style=\"text-align: justify;\">But, something came over me and I took a shower, got ready and made the forty-five minute drive to her house.</p>\n<p style=\"text-align: justify;\">I drove up and saw the police outside as the EMS had already left.  I knew there was only one person we were waiting for and that was the coroner.  As I got out of my car and talked to the police, I watched my brother pacing on the front lawn.  I hugged him and he said, &#8220;Terry, if you want to see her, you can look through the living room windows and see her laying on the couch.&#8221;</p>\n<p style=\"text-align: justify;\">His words felt like a knife piercing my heart.  Did I really want to see her or did I want to remember the last time I saw her?  I didn&#8217;t want to remember so much the last time I saw her because it was the Thursday before and it didn&#8217;t go so well.</p>\n<p style=\"text-align: justify;\">I went to her house to visit and she looked horrible.  Her clothes looked ratty, she smelled like cigarettes and she only weighed about seventy-five pounds. She just looked awful and I wasn&#8217;t going to have it!</p>\n<p style=\"text-align: justify;\">I grabbed my moms arm and told her to sit down.  I scolded her about her appearance and begged her to tell me what was going on with her.  She assured me that she didn&#8217;t know why she was losing so much weight and that she was eating but she just didn&#8217;t feel well.</p>\n<p style=\"text-align: justify;\">I told her that if she didn&#8217;t start eating and taking care of herself that I would call a Social Worker and have them come over and do whatever was necessary to find out what was really going on with her.  I gave her some new clothes and I told her that she should put on some makeup, fresh clothes and start taking care of herself.  I told her that the next time I saw her, I didn&#8217;t want to see her like she was then.</p>\n<p style=\"text-align: justify;\">I saw the pain in her eyes and I also knew in my heart that her spirit way dying.  She was dying.  It broke my heart and I just couldn&#8217;t add to her pain.  After all, I&#8217;m the one who has tried to save her for most of her life. My mother eyes told everything and right there they were telling me that she was more like my child.</p>\n<p style=\"text-align: justify;\">I said &#8220;mom, I&#8217;m not here to be mean to you.  I just want you to be okay.  I want you to be happy.  I don&#8217;t like to see you this way.&#8221;  She said to me that she didn&#8217;t think I was being mean but that, I loved her and that I cared about her.  That made me happy and we sat and talked for a bit.  Now I wish it had been longer.</p>\n<p style=\"text-align: justify;\">Her words comfort me every time I doubt myself and think that I could have done something more to save her.</p>\n<p style=\"text-align: justify;\">You know they say you don&#8217;t know how strong you are until you have to be and man that is so true.  I lost my younger brother two years ago and I think this is when my mom gave up.  In a short time after my brother died, she lost the only man that loved her and my other brother developed a brain tumor.  I think some people are just not as strong as others and in my mothers case, she was probably born a very weak soul.</p>\n<p style=\"text-align: justify;\">Not to say that if you lose a child it shouldn&#8217;t weaken you because I never ever want to find this out and, I could only imagine how much will it takes to pull yourself out of a dark hole and try to move on.</p>\n<p style=\"text-align: justify;\">My mother lived in a dark hole and she could never pull herself out.  The good times didn&#8217;t last for long for her, when they came, she worried about how long they would last.  She never lived in the moment, ever.</p>\n<p style=\"text-align: justify;\">Today I picked up my mothers ashes.  They gave me her final belongings which was a cross and a St. Christoper that she wore around her neck to keep her safe and so that God would know that she was afraid of dying.</p>\n<p style=\"text-align: justify;\">I thought that picking up her ashes would affect me worse than it did but, it was more of a feeling of peace.  I knew the ashes were not her and that she was now free.</p>\n<p style=\"text-align: justify;\">It feels comforting to me knowing how much spiritual pain that my mother was in that now her body is strong, her mind is free and her soul is happy for once.  Although I rarely saw this, I remember her last words were, &#8220;and I love you.&#8221;</p>\n<p style=\"text-align: justify;\">Someone asked my if I think it was harder to lose my mother in a sudden passing as compared to losing her to cancer and watching her suffer or die slowly and I told them that, I watched my mom die my whole life.  And, it will always haunt me to know or think that her only daughter couldn&#8217;t save her from herself.</p>\n<p style=\"text-align: justify;\">I don&#8217;t want to ever minimize the way anyone dies because when you lose someone you love it hurts deep no matter what the circumstance is.  When you watch someone in pain, no matter what kind of pain it&#8217;s agonizing.  I have learned that it&#8217;s also a blessing to allow them to be free and to appreciate that they are.</p>\n<p style=\"text-align: justify;\">On Christmas Eve, like I had done for so many years before, I picked up my cell phone and dialed her number to tell her Merry Christmas but, as the phone rang, I realized that she was gone and that I would never talk to her again.  I will never see her again and I will never get to hug her frail little body ever again.  I put my phone down and cried in a Walgreen&#8217;s parking lot.</p>\n<p style=\"text-align: justify;\">My mother died of an accidental drug over dose by using Methadone.  I know it wasn&#8217;t exactly intentional because while saying my final good bye to her on the couch, I noticed that she had her done, she put on makeup and was wearing the new clothes that I bought her.</p>\n<p style=\"text-align: justify;\">She listened to me that day when I told her the next time I saw her that I didn&#8217;t want to see her the way she was and she was all made up.  Maybe she knew where she was going or maybe she wanted to look nice for me, that I&#8217;ll never know.</p>\n<p style=\"text-align: justify;\">My question or wonder is, is it suicide when you don&#8217;t intend to kill yourself but you use drugs?  I don&#8217;t know but, if you use drugs to escape then you are already committing spiritual suicide because you don&#8217;t feel comfortable in your own body and for that, her intentions are what they are.</p>\n<p style=\"text-align: justify;\">Rest in peace my sweet dear mother.  I know you tried and I know that you&#8217;re in heaven and your with your son and, I know most of all that you loved me as best as you could. I&#8217;ll see you again one day and on that day we won&#8217;t have to worry about the elephant that was always in the room.  We can celebrate together.</p>\n<p style=\"text-align: justify;\">Goodbye Momma you&#8217;re free now..</p>\n<p style=\"text-align: justify;\">*The picture on this blog post is of the time when my mom was happy for a minute.  I took her back to where she grew up.  This is how I will remember her.. I</p>\n<p style=\"text-align: center;\" align=\"center\">\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"840a9853-f5dc-54ed-9782-b17da11f8144"}}