{"data":{"wordpressPage":{"title":"What are CoconutPods?","content":"<p>&nbsp;</p>\n<h2 style=\"text-align: center;\"><strong>What are CoconutPods?</strong></h2>\n<h3 class=\"coconut_title\" style=\"text-align: center;\"><a href=\"http://COCONUTPODS.COM\">COCONUTPODS.COM</a> IS COMING SEPTEMBER 1, 2017</h3>\n<p>&nbsp;</p>\n<p>CoconutPods are all natural and organic, moisturizing body melts.</p>\n<p>I created this product because I was diagnosed with all kinds of autoimmune issues like thyroid disease, shingles, arthritis and, gland problems.</p>\n<p>My skin was having all kinds of issues from feeling dry to looking crepey.</p>\n<p>I would do like most of us do and get out of the shower or bath and grab a bottle of lotion full of all kinds of chemicals.</p>\n<p>I would start applying from my neck down to the bottoms of my feet.  My skin was drenched in chemicals that I couldn&#8217;t even pronounce or, that I even knew what the heck they were.</p>\n<p>Of course, I did this for years until I hit my middle forties when I got shingles.  It was a bit too early in life to get shingles as most people that have them get them later in life.</p>\n<p>That was the beginning of my autoimmune journey on a down hill spiral.</p>\n<p>Shortly thereafter I was diagnosed with Hashimoto&#8217;s disease.  It&#8217;s a disease where your immune system attacks your thyroid gland.</p>\n<p>I had nodules (growths in my thyroid) that had to be biopsied and still have to be once a year to check for cancer.</p>\n<p>I won&#8217;t bore you with the fact that one ailment lead to the next and the next and then, more and more medicine to treat the issues.  It was a total nightmare trying to adjust to my new life.</p>\n<p>I got tired of feeling like hell all of the time, so I decided to find out what was causing my problems.</p>\n<p>After reading that the types of health issues that I was going through were very common in today&#8217;s environment.  Moreover, they are dramatically increasing at alarming rates.</p>\n<p>Is it the plastic in our water, chemicals in the air, pollution in our food, chemicals in our lotions?</p>\n<p>I am not a doctor or scientist, and frankly, I could research all of the reasons and write about what those folks think the problem is but, to me, it comes down to common sense.</p>\n<p>FACT:</p>\n<ul>\n<li>\n<h4>The skin is the largest organ of the human body.</h4>\n</li>\n<li>\n<h4>In a 120 pound person, the skin;</h4>\n<ul>\n<li>\n<h4>Covers 3000 square inches</h4>\n</li>\n<li>\n<h4>Weighs 6 pounds</h4>\n</li>\n</ul>\n</li>\n</ul>\n<p>Common sense to me means that I begin to look around and find out what the heck was causing my issues.</p>\n<p>After all, I am vegetarian, work out, drink lots of water, supplement and, I have no history of any of the stuff I was going through in my family.</p>\n<p>I couldn&#8217;t do much better on my food because I was already eating organic.  I only drank purified water (and wine) nothing else.</p>\n<p>I supplemented according to my yearly checkups to keep me healthy.</p>\n<p>I had no bad habits so what the heck gives?</p>\n<p>&nbsp;</p>\n<h2 style=\"text-align: center;\"><strong>What are CoconutPods?</strong></h2>\n<h3 class=\"coconut_title\" style=\"text-align: center;\"><a href=\"http://COCONUTPODS.COM\">COCONUTPODS.COM</a> IS COMING SEPTEMBER 1, 2017</h3>\n<p>&nbsp;</p>\n<p>After I had read that our skin is the largest organ of our body (next to our liver I guess), I took a good look around, and I was disturbed to see that I had a couple hundred beauty products in my bathroom.</p>\n<p>The worse part is that I decided to read a lot of the labels.  I was beside myself.  I was a little mad at both myself and the product manufacturers.</p>\n<p>Here is why.  Mad at myself because unlike the food that I put into my body, I didn&#8217;t take two seconds to check the chemicals that I let absorb into my skin and thus, into all of the organs of my body.</p>\n<p>I was mad at the manufacturers because they were using all kinds of preservatives that are known to cause hormone distruptors such as thyroid disease and Lupus and, a ton of others.</p>\n<p>Here are some of the toxic chemicals that you will want to avoid:</p>\n<ul class=\"_kYe\">\n<li class=\"_AXc\">Parabens. &#8230;</li>\n<li class=\"_AXc\">Synthetic colors. &#8230;</li>\n<li class=\"_AXc\">Fragrance. &#8230;</li>\n<li class=\"_AXc\">Phthalates. &#8230;</li>\n<li class=\"_AXc\">Triclosan. &#8230;</li>\n<li class=\"_AXc\">Sodium lauryl sulfate (SLS) / Sodium Laureth sulfate (SLES). &#8230;</li>\n<li class=\"_AXc\">Formaldehyde. &#8230;</li>\n<li class=\"_AXc\">Toluene.</li>\n</ul>\n<p>These are only ten of them, and if you go deep, you will see that the beauty industry is not pretty.</p>\n<p>I took all of my products and got rid of them.  However, I still needed a way to moisturize my skin.</p>\n<p>I am one of those people that wants to use one or two products for a number of things so this is when I decided to create my own product called &#8220;CoconutPods&#8221; for versatile uses.</p>\n<p>I knew that there could be absolutely no chemicals or preservatives what so ever.  It had to be organic and it had to moisturize quickly and effectively.</p>\n<p>After doing lots of testing, I found my formula which is just five natural and organic ingredients:</p>\n<p>&nbsp;</p>\n<ol>\n<li>Organic Shea butter</li>\n<li>Organic Cocoa butter</li>\n<li>Organic Coconut Oil</li>\n<li>Organic and local Beeswax</li>\n<li>Organic essential oils.</li>\n</ol>\n<div></div>\n<p>Everything is natural and won&#8217;t throw your body off like traditional lotions and chemicals that are being sold to us without us knowing that many of them could be doing more harm than good.</p>\n<p>Just one CoconutPod (show picture or video below) a day from head to toe does the trick.  Most likely, you will even have some left and by all means, put it into your hair to soften and moisturize dry hair.</p>\n<p>No bottles to carry.  No wasted product because you can&#8217;t get it all out.  No chemicals that you have to worry about.  Just all natural moisturizer.</p>\n<p>It&#8217;s all about choices.</p>\n<h3 class=\"coconut_title\" style=\"text-align: center;\"><a href=\"http://COCONUTPODS.COM\">COCONUTPODS.COM</a> IS COMING SEPTEMBER 1, 2017</h3>\n<p>&nbsp;</p>\n<p style=\"text-align: center;\"><strong>Hey! If you would like to renew yourself from the inside get my </strong></p>\n<h1 id=\"primary-headline\" class=\"role-element editable-selectable editable-element leadstyle-text cke_editable cke_editable_inline cke_contents_ltr cke_focus\" style=\"text-align: center;\" spellcheck=\"false\" data-editable-id=\"primary-headline\">&#8220;The 7 Step-by-Step way to Rejuvenate &amp; Renew  Without Depriving Yourself&#8230;.Really!</h1>\n<p style=\"text-align: center;\">Click the link below:</p>\n<p style=\"text-align: center;\"><a href=\"https://theresaskrobanek.lpages.co/rejuvenate-renew/\">https://theresaskrobanek.lpages.co/rejuvenate-renew/</a></p>\n<p>&nbsp;</p>\n","date":"July 29, 2017"},"site":{"id":"Site","siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"4191845f-2e38-508d-b382-a03c0c89d0c5"}}