{"data":{"wordpressPost":{"title":"You want to fight cancer? Use your fork!","content":"<p>You want to fight cancer? Use your fork!</p>\n<p style=\"text-align: justify;\">It&#8217;s no surprise that anti-aging and diet are inter-dependent.  Some foods promote cancer while others prevent it.  By eating the right foods and taking the right supplements we can dramatically reduce our overall risk of cancer.</p>\n<p style=\"text-align: justify;\">There are thousands of molecules in foods.  Certain ones help us fight cancer.  These are essential nutrients and phyto-chemicals. These are anti-cancer compounds that interrupt the cancer formation process.</p>\n<p style=\"text-align: justify;\">For example, foods/supplements with vitamin C stop nitrates from becoming carcinogenic.  Then there are the blocking agents of minerals that activate enzymes that chew up and remove cancer causers by breaking them up into little harmless waste products.</p>\n<p style=\"text-align: justify;\">There are suppressing agents that block the progression of cancer once its begun.  These agents can be found it beta-carotene, selenium, calcium, flavonoids, plants. and DHEA.</p>\n<p style=\"text-align: justify;\">Certain nutrients may have the ability to block metastasis promotion, detoxify carcinogenic molecules, encourage DNA repair, inhibit tumor growth factors, interfere with the binding of cancer cells, nourish the immune system, strengthen our natural barriers to carcinogens and much more.</p>\n<p style=\"text-align: justify;\">You&#8217;ve heard the quote by <b>Hippocrates</b> &#8220;Let food be thy medicine and medicine be thy food.&#8221; It&#8217;s true.  If you want to live disease free or at least much healthier while you are on this planet, eat like your life depends on it!  You won&#8217;t believe how good you will feel.</p>\n<p style=\"text-align: justify;\">I have been a vegetarian for about 22 years.  I started eating cheese and dairy about five years ago.  In the last year or so, I have felt arthritis in my fingers and it got so painful that I was having trouble putting my shoes on.  I actually yelled out in pain last week.  That&#8217;s when I knew something wasn&#8217;t right.</p>\n<p style=\"text-align: justify;\">When your body is telling you something, its manifesting itself from inflammation/disease and the result is pain and symptoms.</p>\n<p style=\"text-align: justify;\">After doing research, I found that dairy is very acidic and acid causes inflammation in the body.  What also causes arthritis? Inflammation.  So naturally, if I ad more acid it will cause more inflammation and the cycle get&#8217;s worse.</p>\n<p style=\"text-align: justify;\">I have three choices at this point.  I live with the pain (because I hate medicine), I get a prescription or, I do what is the natural thing to do and that is, to listen to my body and get off of dairy. No brainer!</p>\n<p style=\"text-align: justify;\">Too many times we get symptoms and rather than find out what the source of the problem is, we cover it up by thinking it&#8217;s just old age or genetics or whatever we are doomed to have.</p>\n<p style=\"text-align: justify;\">But really, is it that or instead our inability to make necessary changes to our diet. For example most type 2 diabetes can be reversed by eating better and exercising.  We can avoid certain cancer just by elimination with things like carcinogens.  We could also improve the chances of keeping cancer at bay if we ate 90% plant based diets.</p>\n<p style=\"text-align: justify;\">I stopped the dairy and it&#8217;s been about a week and I swear, I feel 90% less joint pain.  I&#8217;ve went back and forth testing my theory about dairy and each time I come back to being pain free.  I&#8217;m at the point to where even my great love of cheese pizza or cheese and wine doesn&#8217;t sound better than being pain free.</p>\n<p style=\"text-align: justify;\">Like they say, we will do more to avoid pain than to gain pleasure, I&#8217;m just glad I finally made that switch.</p>\n<p style=\"text-align: justify;\">The take away here is two things.  One, do you have pain,  chronic disease or, an illness that you can try to &#8220;Let food be thy medicine and medicine be thy food?&#8221; and two, if you don&#8217;t could you start to eat like you might avoid them in the first place?</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/f2b26d2ac78fe513fd9fa2446410a7ac/1a478/37724362_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"88bc26ac-21f1-5857-9ed0-47561a69dccd"}}