{"data":{"wordpressPost":{"title":"","content":"<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\">LONGEVITY AND HAPPINESS #1</p>\n<p style=\"text-align: justify;\"><em> </em></p>\n<p style=\"text-align: justify;\">We are all on one heck of a journey in life, and to make it to this point in good health, and with a hopeful outlook, says a lot about how great we are aging. We need to put the superficial second to the physical and emotional in our lives.</p>\n<p style=\"text-align: justify;\">Right now, and from here on out, we should consider our longevity instead of our wrinkles. Think about it, if you could look absolutely stunning, but not have the physical and mental abilities to go with it, would that be better?</p>\n<p style=\"text-align: justify;\">Honestly, I would rather be healthy and in shape with some wrinkles and sagging skin than the alternative, and I certainly don’t want to be eighteen and clueless either. Who gets to decide how we are supposed to age and how we should look: the media?</p>\n<p style=\"text-align: justify;\">After all, they are the ones that give us harmful feedback about aging in the first place. Who are they to us anyways? When’s the last time your partner or a friend, said you looked bad? If they’re a good friend or companion, they will only see how beautiful you are.</p>\n<p style=\"text-align: justify;\">We receive negative information from the time we are young girls, and then it’s reinforced by the media by placing unrealistic and negative expectations upon us. Then we perpetuate the lie by thinking we can measure up to this picture. We can’t achieve this image; no one ever does or ever will, as it’s a lie, and the truth we have inside of us.</p>\n<p style=\"text-align: justify;\">We don’t need to go outside of ourselves to validate who we are. We know who we are and we certainly don’t need the media or any magazine telling us. If we could all step up to the plate and admit that we do love ourselves in spite of what we compare ourselves to, just think how content we would become. We are all unique and no one knows you like you do, not even your spouse. This is the key; get to know yourself.</p>\n<p style=\"text-align: justify;\">I read a great book in which the author wrote, “Why should other people try to know who you are when you don’t even know yourself?” If you think about that statement, you can see it may be true for you.</p>\n<p style=\"text-align: justify;\">We want our spouse, our kids, and our friends to know what and who we are, but do we really know who we are and what we want? For me, I am still trying to figure this out by taking the first step to quick assuming that others know what I am thinking. I am the only one who knows what I am thinking, and I am the only one who knows what I want; therefore, if I want a happier life with others and with myself, I must be a better communicator instead of a criticizer of others.</p>\n<p style=\"text-align: justify;\">Life takes work, we all know that, but it doesn’t have to be hard work. Real change and happiness begins with acknowledging the things we can change and ignoring the things that we can’t.</p>\n<p style=\"text-align: justify;\">Situations in life may bother us when we can’t change the outside world, but rather than hold in the conflict, ask yourself, “What is it about this part of me that is making me feel this way?” Then ask, “How can I make peace with it?” Don’t forget, there are plenty of aspects of our lives that should make us feel proud, no matter what age you are. Need I go into them?</p>\n<p style=\"text-align: justify;\">Look at yourself and see who you will be in ten or twenty years. The goal should be to make peace with aging and choose to be happy. Live in the moment and feel the experience of life, because it doesn’t last very long.</p>\n<p style=\"text-align: justify;\">Remember, as you got older, you looked back at pictures of yourself and saw how good you looked and how happy your were, but you didn’t appreciate it at the time? Leave the past and embrace the future.</p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: center;\"><em>Before you go, I created &#8220;The 7 Steps to Rejuvenate and Renewal.&#8221; In just seven</em></p>\n<p style=\"text-align: center;\"><em>steps you can feel amazing without depriving your self!  Click the link below:</em></p>\n<p style=\"text-align: center;\"><em>THE REJUVENATION AND RENEWAL PLAN</em></p>\n<p style=\"text-align: center;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><em>https://theresaskrobanek.leadpages.co/rejuvenate-renew/</em></a></p>\n","featured_media":null},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"654fc4a3-a18c-537b-a317-72acc90b68a3"}}