{"data":{"wordpressPost":{"title":"&#8220;From now until dead.  How do you want to live?&#8221;","content":"<p>&nbsp;</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">&#8220;From now until dead.  How do you want to live?&#8221;</span></h2>\n<p>&nbsp;</p>\n<p>Sometimes while flipping through the radio stations in my car, I find Dr. Laura.  If you don&#8217;t know who she is, this is what <a href=\"https://en.wikipedia.org/wiki/Laura_Schlessinger\">Wikipedia.com</a> says:</p>\n<p><b>Laura Catherine Schlessinger</b> (born January 16, 1947) is an American <a title=\"Talk radio\" href=\"https://en.wikipedia.org/wiki/Talk_radio\">talk radio</a> host, <a title=\"Social conservatism\" href=\"https://en.wikipedia.org/wiki/Social_conservatism\">socially conservative</a><a class=\"mw-redirect\" title=\"Pundit (expert)\" href=\"https://en.wikipedia.org/wiki/Pundit_(expert)\">commentator</a> and author.<sup id=\"cite_ref-5\" class=\"reference\"><a href=\"https://en.wikipedia.org/wiki/Laura_Schlessinger#cite_note-5\">[5]</a></sup> Her radio program consists mainly of her responses to callers&#8217; requests for personal advice and has occasionally featured her short monologues on social and political topics. Her website says that her show &#8220;preaches, teaches, and nags about morals, values, and ethics.Many&#8221;</p>\n<p>I listen to her about once or twice a week.  While I don&#8217;t always agree with her, I found one statement she said that hit home for me, and it goes something like this:</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">&#8220;From now until dead, h</span><span style=\"color: #ff00ff;\">ow do you want to live?&#8221;</span></h2>\n<p>&nbsp;</p>\n<p>Although it may seem like a simple statement, it is not.  When I think about that phrase, it pretty much puts things into perspective.</p>\n<p>It sums up how we should be living our lives.</p>\n<p>For all of the times that I have been indecisive in wondering if I have made or will make the right or wrong decisions, all I ever needed to do was to answer that question.</p>\n<p>&#8220;From now until dead. How do you want to live&#8221; tells us that we shouldn&#8217;t live our lives for other Many of us do.</p>\n<p>There is not a whole lot of time and, we don&#8217;t know how much time we have left.</p>\n<p>The people that are gone didn&#8217;t wake up and think that that today was their last day.</p>\n<p>I have struggled when deciding to stay in a relationship or leave a job because I worried about what others might think or that I might hurt someone by doing what was right for me.</p>\n<p>Now that I think about it, that was pretty dumb of me to care.</p>\n<p>When in reality other people didn&#8217;t care what I did nor do other people think about anything other than their own lives.</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">I gave more credit to others than I did to myself.</span></h2>\n<p>&nbsp;</p>\n<p>Let me share with you some words of wisdom and that is if you are looking to go into therapy because you can&#8217;t seem to find your place in life well then, ask yourself this question <em><strong>&#8220;From now until dead. How do you want to live?&#8221;</strong></em>, And then don&#8217;t just let the question become a fleeting thought but ponder it and contemplate the answer like maybe you&#8217;ve never done before.  Doing this will save you a lot of time and money if you are true to yourself.</p>\n<p>&nbsp;</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">&#8220;From now until </span>dead<span style=\"color: #ff00ff;\">.  How do you want to live?&#8221;</span></h2>\n<p>&nbsp;</p>\n<p>If you are struggling to live the rest of your years the way that you want and are worried that you will have to make some serious life changes, then, let me remind you about how fast life goes by, and in no time you may regret the things that you didn&#8217;t do.</p>\n<p>If you don&#8217;t believe me, then go and find that old box of photos that you have tucked away (assuming you&#8217;re not twenty years old and they&#8217;re all on Facebook) and start looking through them and you will be reminded how fast the years flew by.</p>\n<p>You will also be reminded that you weren&#8217;t as fat as you thought you were and, you were more beautiful than you could have imagined (okay, I threw that one in there :))</p>\n<p>You probably still have some good years left.  The kind of years that you must live because, well, if you&#8217;ve lived some time on this planet, you like me, have probably lost many of those that you loved.</p>\n<p>One day they were here and the next they were gone too soon.</p>\n<p>So I&#8217;ve got to ask you one more time.</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">&#8220;From now until </span>dead<span style=\"color: #ff00ff;\">.  How do you want to live?&#8221;</span></h2>\n<p>&nbsp;</p>\n<h3 align=\"center\"><span style=\"color: #ff00ff;\"><em>Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</em></span></h3>\n<h3 align=\"center\"><span style=\"color: #ff00ff;\"><em>steps you can feel amazing without depriving yourself!  Click the link below:</em></span></h3>\n<h3 align=\"center\"><span style=\"color: #ff00ff;\"><em>THE REJUVENATION AND RENEWAL PLAN</em></span></h3>\n<h3 align=\"center\"><span style=\"color: #ff00ff;\"><a style=\"color: #ff00ff;\" href=\"https://myagingandwellness.lpages.co/7-step-detox-guide\">https://myagingandwellness.lpages.co/7-step-detox-guide</a></span></h3>\n<p>&nbsp;</p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"c13f0407-dfbd-5e81-b248-c68c8cf32b9e"}}