{"data":{"wordpressPost":{"title":"WILL YOU GET CANCER?","content":"<p style=\"text-align: justify;\">Everyone will eventually get cancer right?  Cancer is inescapable right? If we live long enough, most of will get cancer right? Wrong!</p>\n<p style=\"text-align: justify;\">Trying to rationalize our bad habits will contribute to us getting cancer.  &#8220;I may as well eat whatever I want because we&#8217;re all going to die anyways&#8221; is what I heard from a friend at lunch today.  This got me thinking about how we ourselves may actually be contributing to cancer by trying to rationalize our bad habits.</p>\n<p style=\"text-align: justify;\">In no way am I blaming anyone for getting cancer here.  Cancer is a terrible thing and I have lost loved ones to cancer and it kills my heart when I hear of anyone being diagnosed.  With all of the money that we have poured into trying to find a cure, it doesn&#8217;t seem that we&#8217;re even close.  To me it just doesn&#8217;t make sense.</p>\n<p style=\"text-align: justify;\">Maybe you have cancer genes (genetics) and you have many family members who had cancer in each generation and you think that you may be genetically programmed to get it too.  Although we can&#8217;t change our genetic makeup, heredity isn&#8217;t everything either.</p>\n<p style=\"text-align: justify;\">I am not a doctor but I do know from the research that I have done when my younger brother had cancer that, lifestyle choices may determine whether we express or turn on the cancer gene in the first place.</p>\n<p style=\"text-align: justify;\">The point here is that, if cancer runs in your family, lifestyle choices and prevention could be the thing that keeps the genes from turning on and causing cancer.  Of course there are too many times where someone could do everything perfect and have all the money in the world to fight it and, it&#8217;s still something their body was going to do.  Breast cancer comes to mind when I think about this statement.</p>\n<p style=\"text-align: center;\"><strong><em>What causes cancer?  </em></strong></p>\n<p style=\"text-align: justify;\">I&#8217;m going to give my non doctor version here.  Cancer is a disease made up of an uncontrolled growth of abnormal cells. Somewhere along the way, the immune system gets into trouble or collapses and left alone it can cause chaos.</p>\n<p style=\"text-align: justify;\">A healthy cell gets attacked by a free radical and then damages the DNA causing cancer (remember this is the non-doctor version here).  The cell get&#8217;s reprogrammed and unless the DNA is quickly repaired then, well, the cell will never be the same.</p>\n<p style=\"text-align: justify;\">Cancer takes some time as it doesn&#8217;t happen over night.  It goes through initiation, promotion and then progresses.  I have also found in my research that once its detected, it has doubled approximately 30 times and has about a billion cells.</p>\n<p style=\"text-align: justify;\">Did you know that cancer is always being created in our bodies and its also always being destroyed?  It&#8217;s when we have too many free radicals and not enough anti-oxidants to zap them is when our immune system runs amok.</p>\n<p style=\"text-align: justify;\">There are tests that you can get from specialized doctors and one is to check your levels of oxidative stress.  This is a blood panel that measures three levels of free radical activity.  I won&#8217;t go into all the things that are tested because it&#8217;s pretty extensive however, talk to your doctor if you want to get this blood test as it shows where free radicals are punching holes in your antioxidant armor and, when that happens, you can get cancer, and other degenerative diseases.</p>\n<p style=\"text-align: justify;\">With the results your doctor can put you on a good supplement and diet program to hopefully reduce inflammation which seems to trigger the beginning.  I&#8217;m not saying that when one has cancer that supplements and diet are the cure (it certainly is good for you) but, what I am saying is that, if you could prevent it before it happens with these things, then who knows?</p>\n<p style=\"text-align: center;\"><strong><em>What prevents cancer?</em></strong></p>\n<p style=\"text-align: justify;\">So our body prevents cancer in two ways.  First, it helps prevent cancer cells from forming and then it removes those cells that slip past our defense system. These are systems such as DNA repair, antioxidants, enzymes, immune support, etc.</p>\n<p style=\"text-align: justify;\">It&#8217;s important to keep our immune system in the best possible condition so that it can perform the necessary tasks of destroying cells before they become defective.</p>\n<p style=\"text-align: justify;\">Immune health is crucial to cancer prevention and our longevity. If we minimize our exposure to immune suppressing factors like pollution, bad fats, sugar, pesticides, toxins, hormones, radiation, etc. then our immune system will have a chance to protect us back.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Check out my free &#8220;2 Cheat Sheet Fast Weight Loss Formula&#8221; It&#8217;s the fastest and easiest way to lose weight in either two or four weeks! Down load it right here:</p>\n<p style=\"text-align: center;\"><a href=\"http://tinyurl.com/ztxw2xk\">http://tinyurl.com/ztxw2xk</a></p>\n<p style=\"text-align: center;\"><img class=\"\" src=\"https://myagingandwellness.com/wp-content/uploads/2015/11/2-693x1024-203x300.jpg\" width=\"157\" height=\"232\" /></p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"95097f9c-702d-5e4d-9cd1-6cce3cf393c3"}}