{"data":{"wordpressPost":{"title":"Do you change the way you look as you age?","content":"<h3 style=\"text-align: justify;\">Do you change the way you look as you age?</h3>\n<p style=\"text-align: justify;\">Older women are the most dangerous on the planet. We have nothing to lose!</p>\n<p style=\"text-align: justify;\">~Jane Fonda</p>\n<p style=\"text-align: justify;\">Are we happy in the circumstances we are in, or have we settled as we have gotten older? Let’s face it; aging requires change. We can’t wear those sexy clothes we once wore, or wear the same makeup as when we were sixteen because that would be ridiculous. To some, this may seem sad, even like a death sentence, to be forced to make changes that we don’t want to. Unfortunately, and fortunately, we have to make sure we make changes as we age. Many women don’t change, and they continue to do the same things they always did. Big mistake because you are not the same person you were when you were twenty, thirty, or even five years ago.</p>\n<p style=\"text-align: justify;\">Life is moving faster, even when we feel we are slowing down. Look at it like this, you were a teen once and you wore stuff you wouldn’t dream of wearing now. You naturally changed as you went into your twenties. Somewhere along the way, we stopped and got stuck. We continue to wear the same things and styles, year after year, decade after decade, without noticing that we need an update or, we do notice, but we doing nothing about it. Maybe it’s because we get caught in a time gap. Are we still young, middle age, old or what? How do we perceive ourselves at middle age? At what point or decade do we make the necessary changes that should be made for our forever changing self?</p>\n<p style=\"text-align: justify;\">The short answer is to look back at pictures, and if you have looked the same for the last ten, fifteen, twenty years or longer, you need a serious update. Don’t panic, because it’s not hard to do. A little change in your hair style, color, makeup and clothes, and you are all set. I look at magazines for women my age, and I find inspiration through catalogs that cater to women over forty. It has served me well. In fact, I change a little too much. I change my hair color at least every six months. It’s probably not the best thing to change so often. My son was horrified when he knocked on my bedroom door the other day to ask me a question, and when I opened the door to answer him, he looked shocked and yelled out, “Mom, your hair is blue!” That statement didn’t even faze my daughter, who was sitting at the kitchen table. She didn’t even bother to look my way because she knows me so well, and this is not the first time, nor will it be the last, that I shock someone with the things I do to myself. It’s just who I am and I happen to like it. By the way, the blue color was accidental. You see I had blonde hair, and one afternoon I decided I might look better with black hair.</p>\n<p style=\"text-align: justify;\">It was a funny mistake because the tint in the black dye turned my blonde hair blue (sounds like a country song doesn’t it?). I didn’t panic; did I mention it’s not my first time? My son, the tattletale that he is, couldn’t wait to call his dad to inform him that his wife has blue hair. My husband, being a person that doesn’t like change, and who had the lucky draw to be married to a person who does, was yet again, baffled by why I just couldn’t be like everyone else and be, in his words, “normal.” He does admit though, I keep him on his toes because he never knows who he will come home to. I rest my case! Change is a good thing.</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/1880b45f2636df56bb26c717b2d535ca/1a478/30576356_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"f9f1536c-a240-5dd0-84d2-dfc09371397f"}}