{"data":{"wordpressPost":{"title":"RESISTING WHAT MUST BE DONE","content":"<p style=\"text-align: center;\">RESISTING WHAT MUST BE DONE</p>\n<p style=\"text-align: justify;\">I may need Alcoholics Anonymous (AA), but I won’t go. You may need to lose weight, but it’s too hard. My son may need to study harder to get good grades, but he won’t.</p>\n<p style=\"text-align: justify;\">We all have things we should do, and maybe we really need to do them, but we won’t. We resist. Why do we resist? Because we think doing them will be painful.</p>\n<p style=\"text-align: justify;\">My daughter told me that I hurt her feelings the other night, but I don’t remember. Now, it is very painful and breaks my heart to think that I have caused someone I love pain. But what will I do about it? Will I take a deep look at myself and ask the question, “Do I drink too much wine?” Or will I shove it under the rug blaming her as being too sensitive.</p>\n<p style=\"text-align: justify;\">We all find ways to justify the things we do. It’s hard to step back and see ourselves the way others do. I’m not saying they are right, but if enough people are saying the same thing, then we should listen.</p>\n<p style=\"text-align: justify;\">We all do things to defend the way we live. Let’s face it, if change were easy we would all change often. We make changing harder than it needs to be. Although, it can be difficult, because we can take one step forward and two steps back leaving us discouraged and then we give up.</p>\n<p style=\"text-align: justify;\">If you take a few steps back, it’s not the end of the world. Change takes time and it’s not a straightforward event. Most of us don’t wake up and see that we need to make a life change, and then, on the first attempt, make the change without having any setbacks.</p>\n<p style=\"text-align: justify;\">Think of those who have quit smoking. Yes, some quit cold turkey but most try several times before they finally quit. Those who attend AA have a sponsor to help them stay the course and, many times, for a lifetime. The truth is, those of us who falter don’t fall all the way down. When we try to change, we create stepping-stones that prepare us for the next step.</p>\n<p style=\"text-align: justify;\">Do what must be done. Change starts with contemplation, preparation and action. You may be stuck in the contemplation mode for a very long time. This is the time when we are aware that we need to change and we comprehend that a change must be made in order to have a better life.</p>\n<p style=\"text-align: justify;\">This is when we know there is a problem. Maybe your awareness is because of others pushing you toward a change. This time is also when we weigh whether or not the change is worth it. Some of us stay in the contemplation stage forever. We stay on the fence and don’t take the opportunity to better our lives.</p>\n<p style=\"text-align: justify;\">We know we need to, but we are stuck in either fear or indecision. For some, it takes days or weeks to make a move and, for others, it is too painful to continue on their current path. The important thing is we are open to change as opposed to the reverse.</p>\n<p style=\"text-align: justify;\">The next stage is the preparation phase. This is when we begin to plan for how we will make the change. We do the research and then take the first step. Someone who needs to lose weight may join a gym. Someone who needs to stop drinking may go to their first meeting. It’s also the time where outside forces begin to tug trying to pull us back into old habits. In order to be successful in making a change we must create strategies to maintain a different behavior. Temptation to go back to our old ways will be all around us.</p>\n<p style=\"text-align: justify;\">The final (well nothing is final except death, right?) step will be to maintain your results. At this stage we create a time goal, for example, three months, six months, one year and so on. I know many people who quit smoking and were told the cravings would decrease after thirty days and the habit of wanting a cigarette in their hand would cease after ninety. T</p>\n<p style=\"text-align: justify;\">hey were told that if they could get past these milestones, they were practically home free. Ex-smokers never forget their one-year mark from when they finally quit. Many still count the years since they had quit.</p>\n<p style=\"text-align: justify;\">In the maintenance stage you should be out of the pain state and enjoying the new and improved you. The focus at this point is preventing yourself from ever returning to your old ways. Hopefully, at this stage you are stronger and more confident to maintain and sustain the new you.</p>\n<p style=\"text-align: justify;\">Is there something that you need to do in order to be a better you? If something within your spirit is telling you that something is not right, trust your intuition because it’s probably right. It’s not talking to you for nothing.</p>\n<p style=\"text-align: justify;\">Your inner self senses something is wrong way before you acknowledge it. I call this God speaking to you. I am not a religious person, but I am spiritual. We would all be a lot better off if we listen to our God-given gift of intuition. The same intuition that tells us not to go down that dark alley, and the same one that told us something we didn’t listen to it and we suffered the consequences.</p>\n<p style=\"text-align: justify;\">Sometimes when this happens to me I ask God why he let this happen and I always get an inner voice that answers me, “I tried to warn you, but you wouldn’t listen.” Have you ever had this kind of experience? Listen to your inner self and it will always guide you in the right direction.</p>\n<p style=\"text-align: justify;\">There is a difference between fear and intuition, and when you learn to trust your inner voice you will learn the difference.</p>\n<p>&nbsp;</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n<p>&nbsp;</p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"901c3aa9-1996-5362-8a75-9cb01f2d49d3"}}