{"data":{"wordpressPost":{"title":"How to have young skin for life","content":"<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">How to have young</span><span style=\"color: #ff00ff;\"> skin for life</span></h3>\n<p>&nbsp;</p>\n<p class=\"p1\"><span class=\"s1\">Our skin is healthy and needs nothing until about the age of nine.<span class=\"Apple-converted-space\">  </span>Up until then, we need no moisturizer because the vitality is natural.<span class=\"Apple-converted-space\">  </span>According to the well-known dermatologist, Dr. Obaji, all the problems that happen to our skin, i.e., comes from the inside, and not from the outside, which is contrary to what we have been told our entire lives.</span></p>\n<p class=\"p1\"><span class=\"s1\">Dr. Obaji’s theory is that, if you have wrinkles then your body is not making collagen.<span class=\"Apple-converted-space\">  </span>Collagen is the foundation for beautiful skin, and when we lose it, this is when we begin to age.</span></p>\n<p class=\"p1\"><span class=\"s1\">At approximate age thirty years old, the cells in our bodies pretty much go to sleep.<span class=\"Apple-converted-space\">  </span>They become lazy, and collagen production begins to slow down dramatically as we age.</span></p>\n<h4 class=\"p1\"><span class=\"s1\">Why do our cells go to sleep and stop creating collagen?<span class=\"Apple-converted-space\">  </span>A lot of it is genetics. Our skin is programmed and goes through changes in life.<span class=\"Apple-converted-space\">  </span></span></h4>\n<p class=\"p1\"><span class=\"s1\">If you have Rosacea, this is caused by inflammation.<span class=\"Apple-converted-space\">  </span>This and other conditions of the skin are caused by immune responses. Thus Dr. Obaji’s theory is that skin issues, and aging is caused by the internal factors of the body.</span></p>\n<p class=\"p1\"><span class=\"s1\">Dr. Obaji’s philosophy says the way to improve skin and maximize it’s potential rather than chasing wrinkles from the outside is to in his words is  &#8220;Restore the natural cellular activity that characterizes baby skin.&#8221;</span></p>\n<p>Essentially after thirty, we need to wake up the cells so that they can work together.  By using products that just sit on the top of our skin is a waste of our time and money.  We must use products that penetrate the skin and work in synergy to make the cells work together.  When we do this, the skin will repair itself, and its natural vitality will bring itself back.</p>\n<h3></h3>\n<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">The future of skin care</span></h3>\n<p>&nbsp;</p>\n<p>The future of skin care is addressing one&#8217;s skin on its specific needs.  It&#8217;s not going to be a one size fits all like in department stores.  For example, I have brown spots, and I have larger pores around my nose.  After the basics of cleaning, I need Vitamin C, Retin-A, and a good moisturizer.  I am also in my fifties so along with these products I also need to stimulate my skin and create collagen and elastin.</p>\n<p>The future of skin care is treating skin at the cellular level.  Everyone&#8217;s skin is different and has different needs.  As we age, our skin care needs will change, and skin care must be adjusted so that it corrects, restores and maintains our specific requirements to stay naturally healthy for the rest of our lives.</p>\n<p>The future of skin care is to address the needs of the skin. Thus, we prevent aging.  The younger we start, the less we will need invasive procedures like facelifts.  Preservation is the key to anti-aging.</p>\n<h3 style=\"text-align: center;\"></h3>\n<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Dr. Obaji&#8217;s Skin Care Recommendations </span></h3>\n<p>&nbsp;</p>\n<p>Daily:</p>\n<ol>\n<li> Clean your skin and remove all impurities.</li>\n<li>Stimulate your skin and clean your pores so that bacteria, oil, and makeup won&#8217;t live in your pores.  (I use the  Clarisonic Mia 2, 2 Speed Facial Sonic Cleansing Brush):* <a href=\"https://amzn.to/2ClDMDB\"> https://amzn.to/2ClDMDB</a></li>\n<li>Eliminate dead cells.  One of the first signs of aging is the accumulation of dead skin cells.  (Retin-A is the number one thing to use for cell turnover).  If you do nothing else, use Retin-A!</li>\n</ol>\n<p>If you think that your skin is sensitive, Dr. Obaji says that there is no such thing.  He states that the real term is, &#8220;Our skin is weak.&#8221;  We must strengthen our skin as the skin is capable of wearing anything.</p>\n<p>&nbsp;</p>\n<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">The moisturizer myth</span></h3>\n<p>&nbsp;</p>\n<p>If we listen to all of the beauty and lotion companies, we are told and sold on the idea that we need more and more moisturizer.  These companies have ingrained in our psyche that we can&#8217;t get enough moisturizer.  Dr. Obaji says differently.  He says that if we use too much moisturizer, then we send signals to our body by telling it to stop producing its moisturizer and thus, drying out our skin even more.  Our body compensates for what we do.  Basically, if we do all the work for our skin, we allow it to get lazy.</p>\n<p>Diet is an important part of skin care.  With that said, our diet can only convert so much that will contribute to our skin&#8217;s ability to renew and regenerate itself.  Things like Vitamin A and antioxidants we can&#8217;t get enough through our diets.  DNA is the brain of our cells so taking into consideration that we do need to use a skin system or steps if you will that are for our specific skin type.  Way too often we buy products because of marketing and smell.  This is not the way to use skin care because it doesn&#8217;t work unless it addresses the stages of life that we are at.</p>\n<p>We have to use skin care that has science behind it.  When using a good skincare system, we must know our skin type and know that our skin changes with age.  Many of us, including me, don&#8217;t know our skin type.  For so long I thought I had oily skin.  I found out that I do not.  I have more normal and dry.  So, for fifty years I was using the wrong products, and I  wondered why my skin wasn&#8217;t changing.</p>\n<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Stimulating Your Skin</span></h3>\n<p>&nbsp;</p>\n<p>The best way to get your skin to create the new skin from the inside out is to stimulate your skin.  Using products like Retin-A will enable your skin to create collagen and elastin, two vital building blocks for younger and healthy skin.  Some may think that we could eat a whole bunch of Vitamin A and then get enough in our bodies to create enough collagen and elastin, but we don&#8217;t synthesize Vitamin A, so we need to use Vitamin A on our skin to activate it.</p>\n<p>Vitamin C is another fantastic way to make our skin stronger and fight free radicals with antioxidants.  Vitamin C also removes and prevents hyperpigmentation (brown or age spots).</p>\n<p>Our skin is naturally supposed to be smooth.  Our skin should be even toned, strong, and naturally hydrated.  When we achieve and maintain these features, we have healthy skin.</p>\n<p>Will, we age and get loose skin?  Yes and no.  The sooner that we get on a scientific program that is based on our skin type, we can achieve natural and beautiful skin forever.</p>\n<p>Just a quick note here.  I would love to use the Obaji skin care system. However, I find it to be too expensive for me.  Most of us can&#8217;t afford to use multiple hundred dollar products each month.</p>\n<p>Here is the basic minimum that I do:</p>\n<ol>\n<li> *Clarisonic brush (<a href=\"https://amzn.to/2RZNXmG\">https://amzn.to/2RZNXmG</a>)  and Dove soap or a mild cleansing gel from your local drug store.</li>\n<li>Toner (I use Oil of Olay).</li>\n<li>*Vitamin C Serum (<a href=\"https://amzn.to/2pXw9vs\">https://amzn.to/2pXw9vs</a>)</li>\n<li>Any eye cream made specifically for the eyes.  With today&#8217;s technology, all eye creams are good!</li>\n<li>*A growth factor to repair and stimulate new collagen and elasticity.  The Obaji growth factor is way too expensive for me so I&#8217;ve been using TNS for several years and it works great. However, it&#8217;s not cheap.  It used to be under $100.00, but now it&#8217;s a bit more.  Here is my link (<a href=\"https://amzn.to/2CjajtT\">https://amzn.to/2CjajtT</a>).  Quick cheat way to get your growth factors and not pay a lot is to go to <a href=\"https://skinactives.com/\">https://skinactives.com</a> (I have no affiliation with them) the lady that owns the company is a chemist and sells some pretty powerful products at very good prices.  You can get them already mixed in a base cream or, buy the active ingredient and then mix it fresh in your favorite moisturizer.</li>\n<li>Moisturizer made for my skin type.  It&#8217;s best that once per year you see a Dermatologist to maintain your skin type and any changes to get the best results.</li>\n<li>*Sunscreen.  I use EltaMD because it&#8217;s amazing and not greasy.  It also feels like it has a primer in it, so my makeup looks great! (<a href=\"https://amzn.to/2NKoESj\">https://amzn.to/2NKoESj</a>).  The best part is that it&#8217;s under $25.00.</li>\n<li>At night I eliminate the sunscreen and Vitamin C and then use Retin-A.</li>\n<li>Twice a month I do at home 30% TCA chemicals peels (be careful if you try this until you know how your skin will react.  I recommend starting with a Jessner peel at 14% first).  Doing peels works in synergy with the Retin-A and gives you an amazing result.  Warning:  Don&#8217;t use the Retin-A after a peel until you have completely healed and don&#8217;t do a peel more than twice per month.</li>\n</ol>\n<p>The total cost for the above (after you buy one time the Clarisonic brush) about $150.00 per month.  The Retin-A will last a couple of months.  Vitamin C will last about six weeks.  The TNS about a month.  If you go to skinactives.com, your cost will be less.  Peels usually last about four to six months.</p>\n<p>The * means that they are my affiliate links but by all means find them anywhere. 😊</p>\n<p>&nbsp;</p>\n<h4 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Thanks for stopping by!  See you next time. 😘</span></h4>\n<p style=\"text-align: center;\"><img class=\"alignnone size-medium wp-image-7125\" src=\"https://myagingandwellness.com/wp-content/uploads/2015/12/f4cd7e7c96a348ec82897e1ce7c9f963-261x300.jpeg\" alt=\"\" width=\"261\" height=\"300\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2015/12/f4cd7e7c96a348ec82897e1ce7c9f963-261x300.jpeg 261w, https://myagingandwellness.com/wp-content/uploads/2015/12/f4cd7e7c96a348ec82897e1ce7c9f963.jpeg 278w\" sizes=\"(max-width: 261px) 100vw, 261px\" /></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/304bc8a6fe6025cfd8a68cde82697ae9/1a478/rod-long-787232-unsplash.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"a910e2ec-61d3-5361-a346-cbb87ef0225c"}}