{"data":{"wordpressPost":{"title":"Does a mans impotence really matter to a woman?","content":"<h4></h4>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Does and mans impotence really matter to a woman?</span></h2>\n<p>&nbsp;</p>\n<p style=\"text-align: justify;\">Definition of Impotence:  an abnormal physical or psychological state of a male characterized by the inability to engage in sexual intercourse because of failure to have or maintain an erection—called also <b>erectile</b> dysfunction <a href=\"http://www.merriam-webster.com/dictionary/impotence\">(http://www.merriam-webster.com/</a>dictionary/impotence).</p>\n<p style=\"text-align: justify;\">Can a woman be happy with a man, married or not and, love him unconditionally or, is it hard to be without the physical part too?</p>\n<p style=\"text-align: justify;\">If there is frustration can that frustration be overlooked by love alone? Or, does love fade and become distant when there is no physical intimacy?</p>\n<p style=\"text-align: justify;\">I know these are some deep questions, but really, as our population ages and as we age, if our partner is impotent, will our love still deepen, stay the same or, could there be some bitterness eventually?</p>\n<p style=\"text-align: justify;\">While doing research on this topic, I came across many different opinions.  I was surprised to read in many cases that a man&#8217;s impotence is highly caused, not by his inability to perform but,  for his lack of desire to do so.  Hmmm.? Interesting.</p>\n<p style=\"text-align: justify;\">Does that mean as his marriage lives on his desire for his wife wanes? We&#8217;ve all heard the old saying &#8220;use it or lose it&#8221; right?</p>\n<p style=\"text-align: justify;\">It also begs the question then, if another woman would come along that he was attracted to, would his impotence be cured?  Is boredom the problem?</p>\n<p style=\"text-align: justify;\">Of course, there are tons of medical reasons why a man is impotent and there is a very strong case for impotency is if a man smokes or had smoked for a long time.  It seems that the blood flow or the NO2 in the blood just can&#8217;t get it done anymore (I&#8217;m no doctor just going on memory of what I have read).</p>\n<p style=\"text-align: justify;\">However, my point here isn&#8217;t to blame anyone for being impotent but rather than, wondering if the sex (I know intimacy is about being close and doesn&#8217;t have to be about sex) is gone, is the relationship the same?</p>\n<p style=\"text-align: justify;\">Are there different degrees of impotency?  For example:</p>\n<p style=\"text-align: justify;\">You meet a man that you are super attracted to and you have chemistry and he shows you affection, hell, he makes you feel that you are the most beautiful woman on the face of this earth!</p>\n<p style=\"text-align: justify;\">You kiss, you have fun but when it comes to physical intimacy, he can&#8217;t and he says he&#8217;s nervous or something.</p>\n<p style=\"text-align: justify;\">But, as time goes on, you begin to see that he that he can&#8217;t perform.</p>\n<p style=\"text-align: justify;\">Example number two is you&#8217;ve been with your partner for a long time and through illness, they can no longer perform.</p>\n<p style=\"text-align: justify;\">Example number three, you stopped having sex and he can&#8217;t perform because of it.</p>\n<p style=\"text-align: justify;\">When a man is unable to have sex with his partner because of a medical condition (sometimes chronic) it seems that they become distant and maybe, somewhat bitter.</p>\n<p style=\"text-align: justify;\">When the tables turn, is a woman more accepting?</p>\n<p style=\"text-align: center;\" align=\"center\">\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"33f9c367-7ba1-5e77-89d1-3a1c8d9176c4"}}