{"data":{"wordpressPost":{"title":"The Love Lives of Women","content":"<p style=\"text-align: center;\"><em>THE LOVE LIVES OF WOMEN</em></p>\n<p style=\"text-align: justify;\">She lies and says she&#8217;s in love with him, can&#8217;t find a better man.</p>\n<p style=\"text-align: justify;\">~Pearl Jam</p>\n<p style=\"text-align: justify;\">Ah yes, the love live of women.  I can’t tell you how many times I hear women say, “There are just no good ones left,” or worse, “I don’t want a man.” Is this really true? Even when in a relationship, married or not, we can get bored.</p>\n<p style=\"text-align: justify;\">I’m not saying we need a man to be happy; I just wonder if some women simply settle for not having one. I realize that at middle age, there doesn’t appear to be many single and qualified men out there, and that the men we’re married to have grown to be unexciting and predictable.</p>\n<p style=\"text-align: justify;\">I also realize the dating world is a different world out there. I hear stories from women who say men don’t want to commit or are disrespectful. I hear about men having multiple girlfriends and lying to them about seeing other people.</p>\n<p style=\"text-align: justify;\">I listen to others say how lonely they are and have settled for mediocre instead of holding out for the right guy. I may not understand, but I feel for those who would like to have a partner, someone to love and to love them, but it’s just not happening. I feel for those who have given up, never expecting to find love at all.</p>\n<p style=\"text-align: justify;\">Even those of us who are married, life isn’t always perfect. We go through times of doubt, and question whether we want to be married, too. I think one thing is constant and that is that, the older we get, the more settled we are with ourselves. Therefore, we may be or are okay with not having a partner, and we learn to create our own happiness and, more importantly, we own it and it feels good.</p>\n<p style=\"text-align: justify;\">Today, I took lunch to a past neighbor who is elderly and just out of the hospital after hip replacement surgery. She lives alone, has no family, lost her job due to age discrimination, and it is highly unlikely she will ever find another job at her age.</p>\n<p style=\"text-align: justify;\">She has no money except Social Security and divides a Dollar General store soup into two meals to survive. I asked her how old she was, and she said she is seventy-six. I asked her if she wished she was married and how it felt be alone. I asked if she was afraid. She told me she would never want to be married for the sake of being married, and if she didn’t have passion for a man, then she wouldn’t want to just exist like a lot of people do.</p>\n<p style=\"text-align: justify;\">She also said she was very happy at this point in her life, and then genuinely laughed as though she really was. The teacher has, yet again, appeared through her by showing me that, for all she doesn’t have, she is still authentically happy, while I wake up each day looking for what could be better in my life.</p>\n<p style=\"text-align: justify;\">This teacher has taught me to appreciate what I have and to stop looking for more and better. I already have it all, and there is nothing more or better I need. That’s the secret: if you don’t need it, there is nothing missing.</p>\n<p style=\"text-align: center;\" align=\"center\"><em>Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</em></p>\n<p style=\"text-align: center;\" align=\"center\"><em>steps you can feel amazing without depriving your self!  Click the link below:</em></p>\n<p style=\"text-align: center;\" align=\"center\"><em>THE REJUVENATION AND RENEWAL PLAN</em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</a></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/6ad072336228495262afbece32919cf9/1a478/35736064_m-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"5b338cd8-34d2-5ad8-95cc-b442aca6be9b"}}