{"data":{"wordpressPost":{"title":"The Secret To A Good Skin Peel At Home","content":"<h1 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">The Secret To A Good Skin Peel At Home</span></h1>\n<p><iframe width=\"625\" height=\"352\" src=\"https://www.youtube.com/embed/j6wd6CtMb4c?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Here is my affiliate link for the skin peel in the video that I love!</span></h3>\n<p style=\"text-align: center;\"><a href=\"https://www.platinumskincare.com/#_l_11m\">https://www.platinumskincare.com/#_l_11m</a></p>\n<p><a href=\"https://www.platinumskincare.com/#_l_11m\"><img class=\" wp-image-8721 aligncenter\" src=\"https://myagingandwellness.com/wp-content/uploads/2019/03/65618254b14641af97920892a5b1b99683de09ff_Site_Header_Home_AnitAging-300x117.jpg\" alt=\"\" width=\"351\" height=\"137\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2019/03/65618254b14641af97920892a5b1b99683de09ff_Site_Header_Home_AnitAging-300x117.jpg 300w, https://myagingandwellness.com/wp-content/uploads/2019/03/65618254b14641af97920892a5b1b99683de09ff_Site_Header_Home_AnitAging-768x299.jpg 768w, https://myagingandwellness.com/wp-content/uploads/2019/03/65618254b14641af97920892a5b1b99683de09ff_Site_Header_Home_AnitAging-1024x399.jpg 1024w, https://myagingandwellness.com/wp-content/uploads/2019/03/65618254b14641af97920892a5b1b99683de09ff_Site_Header_Home_AnitAging-624x243.jpg 624w, https://myagingandwellness.com/wp-content/uploads/2019/03/65618254b14641af97920892a5b1b99683de09ff_Site_Header_Home_AnitAging-600x234.jpg 600w, https://myagingandwellness.com/wp-content/uploads/2019/03/65618254b14641af97920892a5b1b99683de09ff_Site_Header_Home_AnitAging.jpg 1284w\" sizes=\"(max-width: 351px) 100vw, 351px\" /></a></p>\n<h1 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">The Secret To A Good Skin Peel At Home</span></h1>\n<p>Hi, everyone. Today, I want to talk to you about chemical peels, skin peels that you do at home.</p>\n<p>I&#8217;m not going to talk to you about how to do them. I&#8217;ll show you that in another video, but a lot of people ask me, &#8220;How do you keep your skin so smooth?&#8221;</p>\n<p>My number one secret is no secret at all, and that is to do chemical peels twice a month, and that&#8217;s it. Of course, moisturize and sunscreen are essential as well.</p>\n<p>So with that being said, I have a little secret for you when you do your peels at home.</p>\n<h1 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">The Secret To A Good Skin Peel At Home</span></h1>\n<p style=\"text-align: center;\"><a href=\"https://www.platinumskincare.com/#_l_11m\">https://www.platinumskincare.com/#_l_11m</a></p>\n<p>This is going to make all the difference. I didn&#8217;t learn it until serendipitously I figured it out, but I don&#8217;t want you to have to try and figure it out yourself because I went years doing this, and had I known what I know now, what I&#8217;m about to tell you, would have saved me a lot of time and money and would have given me more of an effective peel had I known this. So, I&#8217;m going to tell you what that is coming up right now.</p>\n<p>Okay, welcome back.</p>\n<p>I&#8217;m going to show you the secret to a good peel at home that you do yourself. I&#8217;m going to start with the peel that I used to use. That&#8217;s this one right here. I&#8217;m not going to show you the label because I&#8217;m not really happy now with the brand. It was a good peel before I knew what I know now, and so I want to teach you a good habit instead of showing you what I did for 14 and a half years.</p>\n<p>I used to get the peel like this, and you can get a peel online. Just google it. I would get it, and I would open up the cap, I&#8217;d put it on the cotton ball, and I would do my swipes on my face. Over time, it just wasn&#8217;t working as well. And so, I just chalked it up as just the peel, and I was getting used to it, and things like that. What really was happening was this was getting oxidized. I didn&#8217;t know that until I tried a different peel. Okay? I tried a different peel, and I&#8217;ll show you that peel and how I figured it out.</p>\n<p>Every time I open this jar, the chemical peel would get oxidized, and it would weaken the strength of the peel. And so, my peels would not work as effective over time. I was just like, &#8220;Well, I&#8217;m really getting used to these,&#8221; so then I would buy another peel that was a lot stronger, and then I would use it on my face, and then I would burn my face, and then I couldn&#8217;t figure out why, if I was not doing as well on the first peel, why I couldn&#8217;t step it up one notch, and then start doing bad. And then that peel started getting weak, and then I&#8217;d go up and up and up.</p>\n<p>But the real problem was my peel was getting oxidized. Air was getting into it, and it was reducing its ability to work. And so that&#8217;s with any products. For instance, if you use a vitamin C or any kind of serum in these dropper bottles, you&#8217;ll have an oxidized product. See, this one&#8217;s already turning orange because air is gotten into it. And so, the thing is is that when you do buy your products, your skin care products, other than the peel, and I&#8217;m going to show you the difference, you want to use a pump because a pump doesn&#8217;t get air in it. It pulls up the products. It spits it out and then it stops. It doesn&#8217;t vacuum back in the air. It doesn&#8217;t get the air like when you open up these bottles.</p>\n<p>I don&#8217;t know why all these companies are selling these products in bottles rather than an airtight way to do that. I mean, if I&#8217;ve figured it out, they should know this.</p>\n<p>Anyways. I&#8217;m kind of wasting my money. My peels are reducing their strength and my products are too, so I don&#8217;t buy any more products that get oxidized by the air because I&#8217;m really defeating the purpose, and I&#8217;m actually wasting my money because they don&#8217;t work as good as they should over time.</p>\n<p>Now, with that being said, I went ahead and tried this peel right here. I&#8217;ve already opened it. I&#8217;ve used it twice. I used it last week, two weeks ago. You never want to do a peel more than every two weeks. I was wondering why it came in these little vials. Okay? I was thinking, hm, okay. So I went ahead and took it out. I used it. And it worked amazingly.</p>\n<p>What this is, this one right here&#8217;s a TCA 30 peel. It has a little metal thing. I&#8217;m not going to open it because these, to me, are like gold, and I just ordered them. I used one and then I gave one to my sister, which she lost. So she&#8217;s asking me for another one. I&#8217;m like, &#8220;Go buy some if you can&#8217;t find the one I gave you, girl.&#8221;</p>\n<p>Anyways, you just pop off this metal part. Take the peel off, and then this is one peel. You can use this on your face, your chest, your neck, and your chest. I suggest when you start your peel for the first time, you only do your face because this skin is very, very thin, and this is very thin too, so you want to see what your face can take before you move down. And then on your face, you don&#8217;t want to do more than a few passes before you, you know, you can tell how your face is going to react. And then if you do here, you only want to do one pass, and one pass. Trust me. Until you can build up a resistance, but that is another video that I&#8217;ll teach you how to do peels.</p>\n<p>But again, so this is not oxidized. Once I open it, it&#8217;s oxidized, but this is made to only use one time. That&#8217;s the beauty of it. So I get all the 30% strength in this. Whereas this 30%, every time I use it, it goes down, down, down, down, and I&#8217;m getting like 5%, you know, two months after I open it because this lasts for about five months, but it&#8217;s not really worth it because it gets oxidized and doesn&#8217;t work. It becomes just, after a while, it just feels like I&#8217;m putting water on my face or maybe a little bit of alcohol or like a burn. But this really works incredibly. I&#8217;m going to have my link here for you to check it out.</p>\n<p>But again, when you buy products that become oxidized, they turn colors, and you&#8217;re wasting your money. And so, with that being said, if you buy a peel online, don&#8217;t buy the ones that can become oxidized. Buy the ones that are self-contained, and buy products in a pump, so they don&#8217;t get air in them, and your skin will do a lot better, and you&#8217;ll get better results.</p>\n<p>With that being said, thank you for watching my video, and I will see you next time. Take care!</p>\n<p>If you get time and you want to find out how to have smoother and more youthful skin, without a plastic surgeon, then check out the link below.  I&#8217;ll show you how I do it 😀</p>\n<p><a href=\"https://how-to-get-smoother-skin.teachable.com/p/smooth-skin\">https://how-to-get-smoother-skin.teachable.com/p/smooth-skin</a></p>\n<div id=\"attachment_8770\" style=\"width: 310px\" class=\"wp-caption alignnone\"><img aria-describedby=\"caption-attachment-8770\" class=\"size-medium wp-image-8770\" src=\"https://myagingandwellness.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-2.36.22-PM-300x200.png\" alt=\"How to get smooth skin\" width=\"300\" height=\"200\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-2.36.22-PM-300x200.png 300w, https://myagingandwellness.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-2.36.22-PM-768x511.png 768w, https://myagingandwellness.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-2.36.22-PM-1024x681.png 1024w, https://myagingandwellness.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-2.36.22-PM-624x415.png 624w, https://myagingandwellness.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-2.36.22-PM-600x399.png 600w, https://myagingandwellness.com/wp-content/uploads/2019/03/Screen-Shot-2019-03-19-at-2.36.22-PM.png 1230w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><p id=\"caption-attachment-8770\" class=\"wp-caption-text\">How to get smooth skin</p></div>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/26902770b23614062a7a2aa02899b948/c0005/The-secret-to-a-good-skin-peel-at-home.png","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"2dbf89eb-8375-5295-9df9-670eba1a48b0"}}