{"data":{"wordpressPost":{"title":"Overcome Anxiety Part #1","content":"<p>&nbsp;</p>\n<p style=\"text-align: center;\">What is Your Gift?</p>\n<p style=\"text-align: center;\">How to <strong>Overcome Anxiety Part #1</strong>.</p>\n<p style=\"text-align: justify;\">I’m going to go out on a limb here and say that I believe one-hundred percent that if we knew what our gift was then most of us would be just fine.  Sounds a little too easy doesn&#8217;t it?  And when I say gift, I mean art, our God given talent or, the reason that we were put on this earth.</p>\n<p style=\"text-align: justify;\">I think that most of us have an idea about what we love to do or at least, we have some things that we are interested in however, way too many times, we are preoccupied by ourselves calling it a job, life, or whatever.  Unfortunately, we never get to fulfill our true calling when we don&#8217;t actively seek our gift and embrace it.</p>\n<p style=\"text-align: justify;\">With anxiety disorder, we&#8217;re not worried about our God given gift but, more worried that we will get into situations that will cause us to panic. What does having a gift have anything to do with anxiety?  Well, it does and here’s my philosophy on why.</p>\n<p style=\"text-align: justify;\">Many people are in prison because they either didn’t find out what their gift was or they never did do anything with the gift they were given.  The gift I’m talking about is each persons creativity that’s locked up inside of us until we find it and set it free to light a fire in our soul.</p>\n<p style=\"text-align: justify;\">Yeah, some people know what their gift is and it&#8217;s easy for them.  Some of us have to struggle to find it.  Doesn&#8217;t matter though, so long as we do.</p>\n<p style=\"text-align: justify;\">I’m not talking about painting a Picasso picture or some abstract art.  Although if that’s it for you, then what are you waiting for?  What I’m talking about here is something that motivates you and you&#8217;re passionate about. Don&#8217;t ever underestimate passion.  It will free your soul.</p>\n<p style=\"text-align: justify;\">Many of us think it’s not possible to have a passion or to even begin to figure out what that is but, I can tell you that anxiety is a fear and it’s a fear of many things and, fear robs of us of all the possibilities that are waiting for us.</p>\n<p style=\"text-align: justify;\">What if you replaced fear and anxiety with a passion and a purpose?  It makes a huge difference in your life because instead of worrying about a situation in the future, you are constantly thinking about your passion as it consumes your mind.  You think of ways to expand and you&#8217;ll see the world as an inspiration to fuel the art that&#8217;s inside of you.</p>\n<p style=\"text-align: justify;\">Let me give you an example of one type of art other than the traditional ones that we all think of.</p>\n<p style=\"text-align: justify;\">Writing is my art.  I can’t even imagine going a day without writing because I love it.  I carry a note pad around and at least several times a day, I&#8217;m writing down book ideas and inspirational ideas.  I get these ideas because I am open to my passion and my passion feeds itself with possibility instead of negativity.</p>\n<p style=\"text-align: justify;\">Once I found what is was that I was completely and utterly passionate about, the anxiety that I suffered from for longer than I care to admit, quietly disappeared.  In fact, it went away and I transitioned from the anxiety screaming in my brain each day to most days not even hearing the voice at all.</p>\n<p style=\"text-align: justify;\">How does one find their art? To start, it’s the ability to see things differently than the rest. Each one of us sees the world different than the other and each one of us can use this as a reference to find our passion.  Don&#8217;t fit into a mold because you are different and it&#8217;s the only way to find how unique you are.</p>\n<p style=\"text-align: justify;\">Find the source of creativity at the same place as you find resistance.  Stop resisting and allow yourself to be open and your passion will have room to enter.</p>\n<p>&nbsp;</p>\n<p style=\"text-align: center;\"><strong>Takeaway #1 &#8211; Decide for the rest of your life to commit to finding what your passion is and replace anxiety with it.</strong></p>\n<p style=\"text-align: center;\">Overcome Anxiety Part #1</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n<p>&nbsp;</p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/ab67cc29c93b557ccb57b2c8bf11ad0f/1a478/43933577_s-400x280-1.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"e0cf49e3-ef8c-53dd-aab3-4a014666bf02"}}