{"data":{"wordpressPost":{"title":"GOOD INTENTIONS","content":"<p style=\"text-align: center;\">GOOD INTENTIONS</p>\n<p style=\"text-align: justify;\">Most of us have good intentions, but we let resistance get in the way. Good intentions mean that we want to do the stuff that needs to be done, but we also don’t want to disappoint others.</p>\n<p style=\"text-align: justify;\">Often times, we will disappoint ourselves before we will others. Sometimes we intend to do what we need to do to get ahead in life, but our intentions are half-done because we may procrastinate or be unorganized.</p>\n<p style=\"text-align: justify;\">We may set ourselves up for failure by creating lofty dreams that are beyond our reach. Some may say, &#8220;No dream is beyond our reach. We must reach for the sky and make it happen. We can become anything we dream of if we just do the work.&#8221;</p>\n<p style=\"text-align: justify;\">This may be true; however, if you want to be a singer so badly, but your voice is not good, then no matter how hard you try you most likely will not be a singer. Same goes for being a professional basketball player, football player, etc. First you have to have the foundation for what you want to become.</p>\n<p style=\"text-align: justify;\">Sure, there are exceptions, but they are not usual and, of course, we can practice ten thousand hours, but if we can’t sing, jump or run, we are probably wasting our time.</p>\n<p style=\"text-align: justify;\">We can still live in the music world by writing music, playing an instrument, teaching music or many others ways. Same is true with sports or anything else we have a passion for. Just because we can’t be the one thing we imagined doesn’t mean we shouldn’t modify our journey to get there.</p>\n<p style=\"text-align: justify;\">The important thing is to see this and to acknowledge it and not to live in denial, because that only wastes time. Many of us fight tooth and nail and never make it to our goals, even with good intentions. Again, don’t waste time.</p>\n<p style=\"text-align: justify;\">Be persistent in finding what it is that you excel at. Try several things and then narrow it down. In sales they used to say that you could not make a salesman, you are either born one or not. I think we can train people to become salespeople and I also agree that certain people are natural salespeople. They just have that ability and charm to sell anyone anything.</p>\n<p style=\"text-align: justify;\">It doesn’t mean the person who was trained can’t make a good living in sales, it just means the person who has the innate ability may do better. In your life, do you want to work as a trained person trying to fit into a mold, or do you want to do something that you are naturally good at? Doing what you love is the reward this life can give you. Are you brave enough to find out what that is?</p>\n<p style=\"text-align: justify;\">The other side of this is we may realize that we are not suitable for something, but continue to pursue it anyway. Or, something beyond our control gets in the way and our dream is no longer possible. Even with good intentions events beyond our control will happen.</p>\n<p style=\"text-align: justify;\">This happened to a friend of mine. Her son always dreamed of being a pilot. He didn’t want to go into the military until he received his bachelor’s degree so he could go in with a higher rank. Life got in the way of his plans and, into his second year of college, he was diagnosed with bipolar disorder. When you have bipolar disorder and take medication, you can’t be a pilot and, unfortunately, bipolar disorder can be a lifetime diagnosis. So then what do you do?</p>\n<p style=\"text-align: justify;\">Even though my friend’s son had intended to become a pilot, life got in the way and his plans were changed whether he liked it or not. That’s how it goes sometimes. Sometimes we are ahead and sometimes we are behind. The important thing is that which brings us down can also raise us up.</p>\n<p style=\"text-align: justify;\">He had to reconcile himself to stop imagining flying a jet. The vision he had for many years was gone without ever being tried, and I understand this is unfortunate and probably hard to take. He had to see a new dream and he didn’t like this new vision at all. For a long time, he wouldn’t acknowledge that he could no longer become a pilot and said the doctors diagnosed him wrong, even going so far as stopping his medicine.</p>\n<p style=\"text-align: justify;\">The bipolar symptoms would reappear and, eventually, he had to come to terms with taking the medication and not being a pilot. As sad as it is, life hits us like this and it’s just the way it is. The key is to be flexible in life. It’s the only way we can get through the times when life is beyond our control.</p>\n<p style=\"text-align: justify;\">If we are rigid and we don’t want to accept certain circumstances, they will still happen whether we like them or not, and we will become stuck and left behind. The funny thing about life is no matter what happens in it, good or bad, it keeps moving even if we don’t.</p>\n<p style=\"text-align: justify;\">Just because my friend’s son couldn’t be a pilot doesn’t mean he doesn’t have another calling. I won’t go into the “if one door is closed another one is opened” philosophy because this blog post is not a philosophy or psychology book and, really, that’s probably a little too cheesy.</p>\n<p style=\"text-align: justify;\">I understand that some would probably be a little pissed off at themselves, the doctors, God, their DNA or whatever the reason because all they wanted was to have a dream, as they tell us to do, and pursue it, as they tell us to do, and become who we are meant to be, as they tell us to, and now fate steps in and screws it all up.</p>\n<p style=\"text-align: justify;\">It’s hard not to blame something or someone for what life doesn’t give us. At this point, you have no other choice but to move on to the next person you were meant to be. Pitying yourself or not being anything that is good is not one of your choices either. Who knows, maybe the next person was who you were always supposed to be in the first place and divine intervention stepped in?</p>\n<p style=\"text-align: justify;\">When life doesn’t work out the way we had planned, we must still have good intentions. The key is to move forward. Because you have to leave one dream behind doesn’t mean you can’t still create another one. You have to ask yourself the question again, “Who am I now and who do I want to be?” As we create a new dream, we may experience pain, anguish or sorrow for what we have lost, but we don’t need to suffer because we will always have choices.</p>\n<p style=\"text-align: justify;\">You may not see where you need to go sometimes. Everyone goes through light and dark times and it’s a part of life. If we resist going through these times then this is when we begin to think like we are fighting a losing battle.</p>\n<p style=\"text-align: justify;\">It’s only life getting the best of us in our minds. We will lose those we love, we will get sick, we will have things happen that are just ridiculously unfair. It happens to everyone and no one will escape the process as long as they are alive. But as the saying goes, “This too shall pass,” and hard times do pass, especially when we make the decision to move beyond them and accept them.</p>\n<p style=\"text-align: justify;\">Let’s be real, if you could take away someone’s illness or tragedy, I know in a minute you would. Most compassionate people would. Events will be thrust upon us and it will hurt like hell. But you don’t have to live in hell. You have to realize it’s something you have to go through, and one day it will all be over and you will make it to the other side again and life will begin its cycle once more.</p>\n<p style=\"text-align: justify;\">I wish you peace and happiness always 🙂</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/08718df16b7581b018719acac5145648/1a478/42066852_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"3483d551-e46b-598e-87a6-0dc1fc16db92"}}