{"data":{"wordpressPost":{"title":"Welcome to My Aging and Wellness&#8230;","content":"<p style=\"text-align: justify;\">Hello everyone.</p>\n<p style=\"text-align: justify;\">Today is the new beginning of this blog! I say new because it’s been hacked and shut down twice!  I won’t go into why but I will say it’s because I let others have control and today I decided to make a new start with me being the one in control.  Kind of like the epiphany of my life.</p>\n<p style=\"text-align: justify;\">This blog and website is about aging well.  I’m not talking about being twenty again or doing things to your body that are counter intuitive to aging and being well but, what I will write about what I’m passionate about and that is aging well and living a passionate life.</p>\n<p style=\"text-align: justify;\">At times, I will talk about things that may seem a little vain because hell, I’m trying like everyone else to make the transition into aging and accepting it.</p>\n<p style=\"text-align: justify;\">Even though aging is not very easy on the body and in a world full of marketers that have forgotten about us middle age and older people, there is a place within our spirit that we can carve out and make aging a place in time where we can feel good, both mentally and physically.</p>\n<p style=\"text-align: justify;\">Do I want to live to be 100!  I don’t know.  Maybe I do if I look okay and my body doesn’t break down.  I do know one thing for certain and that is that I don’t want to be depending on someone, especially my kids to take care of me so, my writing here will be about all of the things that we deal with while getting older and how to take care of our mind, body and spirit, the best that we can without being too rigid in the process.</p>\n<p style=\"text-align: justify;\">We have to live and I won’t stop drinking my wine no matter what my doctor or anyone else says!  Those who know me also know this about me too.  That’s the thing.  There comes a certain point and time in our lives that we become who WE want to be and with the courage, WE actually live the kind of life that WE want to and not what other expect us to.</p>\n<p style=\"text-align: justify;\">At this point in life, I don’t want to tell others how to live and I sure as hell don’t want them to tell me how to live my life because frankly, I really don’t care.  Those times are behind me and I won’t look back because, I’m not going that way anymore.</p>\n<p style=\"text-align: justify;\">I hope to bring you inspiration, reference, ideas, laughs and, videos of those who are living and aging well and topics that are helpful.</p>\n<p style=\"text-align: justify;\">I will leave you with something:</p>\n<p style=\"text-align: justify;\">“Enjoy your body, Use it every way you can&#8230; Don&#8217;t be afraid of it, or what other people Think of it.</p>\n<p style=\"text-align: justify;\">It&#8217;s the greatest instrument you&#8217;ll ever own&#8230;”</p>\n<p style=\"text-align: justify;\">~Baz Luhrmann</p>\n<p style=\"text-align: center;\"><em>Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</em></p>\n<p style=\"text-align: center;\"><em>steps you can feel amazing without depriving your self!  Click the link below:</em></p>\n<p style=\"text-align: center;\"><em>THE REJUVENATION AND RENEWAL PLAN</em></p>\n<p style=\"text-align: center;\"><em><strong><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</a></strong></em></p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"ae7b6ba7-2793-501d-8850-4841bc778410"}}