{"data":{"wordpressPost":{"title":"Why do we fall for beauty product claims?","content":"<p style=\"text-align: justify;\">Why do we fall for beauty product claims?</p>\n<p style=\"text-align: justify;\">I have to admit it.  I fall for every beauty product promise out there. Well, at least I used to.</p>\n<p style=\"text-align: justify;\">I have had drawers full of beauty products and still have at least one drawer of beauty products that claimed to tighten my skin, remove wrinkles and make me look younger.</p>\n<p style=\"text-align: justify;\">Now that I&#8217;m older, I am much more wiser to these claims because one, I have used just about every product out there and more importantly, I started doing research before I buy a new product.</p>\n<p style=\"text-align: justify;\">Basically there are really only a few reasons why a beauty product works and it has nothing to do with the packaging.</p>\n<p style=\"text-align: justify;\">Although packaging is something they probably put more effort into rather than the product so it will stand out or look like it&#8217;s value is way more than what it&#8217;s worth.</p>\n<p style=\"text-align: justify;\"><strong>When you buy a skin care product and look at the ingredients they usually have one key factor, an ACTIVE INGREDIENT. </strong></p>\n<p style=\"text-align: justify;\"><strong> <u>The whole secret to the product is the active ingredient</u>.  Take this out and all you have is a fragrant lotion, cream, water, or gel.  </strong></p>\n<p style=\"text-align: justify;\"><strong>Many skin care products don’t even have an active ingredient!  Some products that state they have active ingredients on their label and, in their product however, they don’t contain that much of the active ingredient or, they aren’t in high enough levels to create a positive effect on the skin.  </strong></p>\n<p style=\"text-align: justify;\"><strong>But you are paying for them via the name of the brand!  Of course we want them to work because we need them to and, because we spent a lot of money buying them.     </strong></p>\n<p style=\"text-align: justify;\"><strong>Just to be fair, not all active ingredients have to be high in concentration.  For example, Peptides and EGF’s, merely signal molecules however, vitamin-C needs to be higher in concentration to make a difference in your skin.  </strong></p>\n<p style=\"text-align: justify;\"><strong>Any ACTIVE lower than the preservatives in the bottle, may be too low to make a real difference.</strong></p>\n<p style=\"text-align: justify;\"><strong>In case you didn’t know, the first ingredient is the strongest and then it goes in descending order.  </strong></p>\n<p style=\"text-align: justify;\"><strong>Many products have their Active Ingredient towards the last of the ingredients; hum mm, how about that? Shouldn’t they be first or at least near first?</strong></p>\n<p style=\"text-align: justify;\"><strong>Whatever products you use, you need to use them for at least one month to see genuine results.  Many products claim to reduce lines and wrinkles but just add moisture to the skin thus, plumping up the lines and wrinkles giving you the APPEARANCE of them being gone.  </strong></p>\n<p style=\"text-align: justify;\"><strong>I don’t like the word appearance! I would rather the claim say that it get&#8217;s rid of them!! Not just the look of them..</strong></p>\n<p style=\"text-align: justify;\">I was watching an infomercial about crepey skin (you know when our skin begins to look like tissue paper as we get older?)</p>\n<p style=\"text-align: justify;\">I spent too much time in the sun in my younger days and now, I seem to be losing lasticity.  I would love a product to tighten my skin but really, is a product going to do this? No.</p>\n<p style=\"text-align: justify;\">The product was some cream that I would put on my legs and then my legs would become firm and smooth. Yeah right!  I think exercise does this..</p>\n<p style=\"text-align: justify;\">The great thing about knowing what the secret to beauty products are and knowing how to read the ingredient labels is that, when you want to buy a new beauty product, you can simply go online, Google it, and then read what is in it and verify if the active ingredients are there.</p>\n<p style=\"text-align: justify;\">I researched the product for for my legs and it turns out that the active ingredient was almost at the last on the list and the rest was a filler product of shea butter.  That&#8217;s it!</p>\n<p style=\"text-align: justify;\">I saved about $100.00 by not buying this product and instead I went out and bought some shea butter and it&#8217;s doing a good job. Turns out, I need more moisture on my legs and to workout!</p>\n<p style=\"text-align: justify;\">The takeaway here is to save money and to not buy into beauty claims and products that are not true and that won&#8217;t work.</p>\n<p style=\"text-align: justify;\">We all have a grave yard full of these..</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Check out my free &#8220;2 Cheat Sheet Fast Weight Loss Formula&#8221;  It&#8217;s the fastest and easiest way to lose weight in either two or four weeks!  Down load it right here:</p>\n<p style=\"text-align: center;\"><a href=\"http://tinyurl.com/ztxw2xk\">http://tinyurl.com/ztxw2xk</a></p>\n<p style=\"text-align: center;\"><img class=\"alignnone size-medium wp-image-7336\" src=\"https://myagingandwellness.com/wp-content/uploads/2015/11/2-693x1024-203x300.jpg\" alt=\"\" width=\"203\" height=\"300\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2015/11/2-693x1024-203x300.jpg 203w, https://myagingandwellness.com/wp-content/uploads/2015/11/2-693x1024.jpg 693w, https://myagingandwellness.com/wp-content/uploads/2015/11/2-693x1024-624x922.jpg 624w\" sizes=\"(max-width: 203px) 100vw, 203px\" /></p>\n<p>&nbsp;</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/97c424e0bbedc3332552cb4d3f7891cc/1a478/32004867_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"984d421a-1842-57a6-8496-3d659fe2ef89"}}