{"data":{"wordpressPost":{"title":"Look Younger For Less Money","content":"<h2 style=\"text-align: center;\">Look Younger For Less Money</h2>\n<p style=\"text-align: justify;\">Basic cosmetic procedures that are the least expensive and would be a natural progression after skin care. Compared to products, cosmetic procedures are not a commodity so finding bargain cosmetic procedures may not be a good thing.</p>\n<p style=\"text-align: justify;\">We’re talking about wounding the skin, and this doesn’t necessarily correlate with cheaper. However, there is no reason you can’t call around to your local dermatologists or plastic surgeons to find out what the procedures cost.</p>\n<p style=\"text-align: justify;\">Then you can compare for yourself. I pick three or four good doctors or medical spas in my area and check their prices, and then I get on their email list. Before long, I get discounted offers of up to thirty percent off their procedures.</p>\n<p style=\"text-align: justify;\">It’s worth it to compare and get on their lists. You’ll get weekly emails from all the places you signed up at to compare the prices. You can even call your favorite doctor or spa and ask if they will match prices. They do it all the time!</p>\n<p style=\"text-align: justify;\"><em><strong>Botox</strong></em> &#8211; You should get Botox as a prevention measure. You may only need ten units or so just to prevent frown lines or lines that may be forming between your nose and eyes.</p>\n<p style=\"text-align: justify;\">You can also have Botox used on your crow’s feet (the lines around your eyes). This helps tremendously. If you need thirty or forty units and you can’t afford it all at once, then get ten units every few weeks until you get all areas covered.</p>\n<p style=\"text-align: justify;\">The cost varies, but I have paid up to fourteen-dollars a unit. When I got on the doctors’ or Spa lists, I received discounts and now I only pay about nine to ten dollars per unit. That’s a pretty good savings. Some doctors will have a buy two get one free promotion.</p>\n<p style=\"text-align: justify;\">Also, there are competing products to Botox. Because they’re competing with Botox, they may be less money. Botox, which is owned by Allergen, has a loyalty program, as well. I recently received a coupon for $100 off the total cost of my Botox!</p>\n<p style=\"text-align: justify;\">This program is called BRILLIANT DISTINCTIONS. Make sure you sign up or have your doctor/injector sign you up and every time you get Botox or another Allergan product such as Juvederm, etc. you will receive points towards your next service.</p>\n<p style=\"text-align: justify;\">I almost got my most recent Botox for free!</p>\n<p style=\"text-align: justify;\"><em><strong>Chemical Peel</strong></em> &#8211; A chemical peel is great for removing the surface layer of the skin. The process wounds the skin, which causes it to heal itself by creating new collagen. A chemical peel has different strengths so the cost will vary.</p>\n<p style=\"text-align: justify;\">In most states, a chemical peel will cost about $150 to  $200 in a doctor’s office. You’ll want to continue having peels, as they will help create beautiful skin with less texture and, diminish fine lines.</p>\n<p style=\"text-align: justify;\">You can do them yourself, but start with a low strength.  Unfortunately, in my learning process, I bought a thirty-percent TCA peel online (I should not have been able to purchase this strength peel without a license), and I did some serious damage to my skin. Damage so bad that, I have to hide the scars every day of my life. It’s not the worth the risk to try and skip ahead rather than to start slow or let a professional do it.</p>\n<p style=\"text-align: justify;\">If you want to do your own peel, start with a small patch of skin to see how it will react. I do my own peels every two to four weeks, usually no more than twice a month. You can go to <em><strong>skin-peel.com</strong></em> to find them.</p>\n<p style=\"text-align: justify;\"><em><strong>The secret to making peels comfortable is while they are on your face, use your blow dryer on the cool setting or, use a small hand fan pointed at your face. It makes a difference.</strong></em></p>\n<p style=\"text-align: justify;\"><em><strong>Retin-A</strong></em> &#8211; A prescription is required, but Retin-A is fantastic!! “Retin-A (tretinoin) is a topical preparation of vitamin A, which has antioxidant properties, just like the vitamin by itself. It’s an acid derivative of retinol (vitamin A).</p>\n<p style=\"text-align: justify;\">The important aspect is really the effectiveness of what Retin-A does. Studies have shown that Retin-A can help reduce wrinkles, reduce acne, exfoliate dead skin cells and redistribute melanin. Melanin redistribution results in lighter, more even skin color. Thus Retin-A is often used to treat skin discolorations caused by excessive sun exposure.</p>\n<p style=\"text-align: justify;\">If you have sensitive skin, it may not work for you, it may be too harsh, but there are alternatives with lesser concentrations.  I would still try to mix a little every other night in my favorite cream. Just don’t give up. This stuff is amazing!</p>\n<p style=\"text-align: justify;\"><strong>Get this for less at canadianpharmacy.com.</strong></p>\n<p style=\"text-align: justify;\"><em><strong>Teeth Whitening</strong></em> &#8211; This makes a huge difference. You could have perfect skin and straight teeth, but if your teeth are stained and dull, no one will notice. If you have bright, white teeth, you’ll look better, and younger, and feel better too.</p>\n<p style=\"text-align: justify;\">The cost in my state is about $50.00, which is down from $500 when I first had it done. There are many good ones over the counter too.</p>\n<p style=\"text-align: justify;\">IPL-, which stands for intense pulse light or flash lamp therapy, is a noninvasive and non-ablative treatment that uses high intensity pulses of visible light to improve the appearance of birth marks, port wine stains, broken facial veins, rosy cheeks, rosacea, red thread veins of the legs, freckles, age spots, facial lines and wrinkles, and the removal of unwanted dark hair. The procedure is referred to as photo rejuvenation and requires a series of treatments.</p>\n<p style=\"text-align: justify;\">The cost nationally runs about $300 to $400. You should only need a few treatments. I have seen it as low as $150 per treatment if you agree to three or more.</p>\n<p style=\"text-align: justify;\">Just a quick note: I have been using a product called Black Magic Tattoo remover (it’s a small handheld pulse light machine) to remove a lot of my brown spots on my arms and legs.</p>\n<p style=\"text-align: justify;\">It works the same as an IPL machine.  I got it on Amazon.com however, it takes time.</p>\n<p style=\"text-align: justify;\">I wouldn’t use the machine on my face though. It’s important to know that brown spots on the body are very hard to remove. The light process takes time. I also add a skin bleach and put a little of my skin peel on each spot too when I do peels on my face.</p>\n<p style=\"text-align: justify;\">Dermapen or Micro-Needling – “ Sterile surgical stainless micro-needles pierce the skin leading to apoptosis of cells in the dermis.” “What is Apoptosis? Apoptosis or programmed cell death, is when a cell essentially commits suicide. This process is natural, controlled and routine. Little inflammation is caused.” “The Dermapen uses eleven, 33-gauge micro needles to stimulate the dermis. Needles vertically pierce the skin to enhance rejuvenation results. Small holes are punctured at a rate of 1000/second. <span style=\"font-size: 0.95em; line-height: 1.6em;\">This proliferation of the body’s tissue continues to release growth factors from fibroblasts, keratinocytes and monocytes.” </span></p>\n<p style=\"text-align: justify;\"><span style=\"font-size: 0.95em; line-height: 1.6em;\">Note: I have had <strong><em>Dermapen</em></strong> about six times and it works wonders. It’s comparable to lasers like Fraxel but without all the down time and expense. Many doctor’s will give you a discount if you buy a package of four or more. You can save hundreds by doing this. I paid $150 per treatment vs. $300 &#8211; $350 by buying the package. </span></p>\n<p style=\"text-align: justify;\"><span style=\"font-size: 0.95em; line-height: 1.6em;\"><em><strong>Juvederm</strong></em> &#8211; Juvederm is an injectable filler consisting mostly of hyaluronic acid. It’s used to fill in areas to smooth out wrinkles and deep folds on the face, and can last up to a year. You can pay anywhere from $400 a syringe to $800. I pay only about $400 &#8211; $450 depending on the specials the doctors have. Currently, my doctor has buy one get one free, and I can save the second one for a later time. At first you may need two but, as your own stem cells work, you will need less later.  In my case it lasts about six months.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-size: 0.95em; line-height: 1.6em;\">These are certainly not all of the basic cosmetic procedures available, but these tend to be the least expensive and the least invasive. These procedures really do well with regard to anti-aging and reversing past damage. </span></p>\n<p style=\"text-align: justify;\"><span style=\"font-size: 0.95em; line-height: 1.6em;\">They’re also a good alternative to going under the knife. I think one day these products and procedures will be affordable for all of us. </span></p>\n<p style=\"text-align: justify;\"><span style=\"font-size: 0.95em; line-height: 1.6em;\">With today’s technology, the need for doctors to perform invasive procedures will diminish so they’ll be more eager to lower procedure costs to attract more patients. My hope is that you get the best skin possible without having to figure out where you will get the money.</span></p>\n<p style=\"text-align: justify;\">Let&#8217;s face it, many of us want to take care of ourselves but, products and procedures can be a little expensive.</p>\n<p style=\"text-align: justify;\">If you would like to find out how I save a ton of money on products and procedures get my book below.  I guarantee that you will save thousands by using these methods.</p>\n<p style=\"text-align: justify;\"><img src=\"https://myagingandwellness.com/wp-content/uploads/2015/10/amazonproductsbookimage-203x300.jpg\" alt=\"\"width=\"178\" height=\"263\" class=\"alignnone size-medium wp-image-7357\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2015/10/amazonproductsbookimage-203x300.jpg 203w, https://myagingandwellness.com/wp-content/uploads/2015/10/amazonproductsbookimage.jpg 338w\" sizes=\"(max-width: 203px) 100vw, 203px\" /></p>\n<p style=\"text-align: center;\">[purchase_link id=&#8221;925&#8243; text=&#8221;Add to Cart&#8221; style=&#8221;button&#8221; color=&#8221;green&#8221;]</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/e9f44e7d641d34593ca894189eb6e41b/1a478/45183926_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"22ccea79-56c9-5892-b458-f0e95d95224f"}}