{"data":{"wordpressPost":{"title":"A way to easily lose a few pounds!","content":"<p style=\"text-align: center;\">A way to easily lose a few pounds!</p>\n<p style=\"text-align: justify;\">A way to easily lose a few pounds. I gained ten pounds, two pounds at a time so I really didn’t notice it until I started feeling miserable.</p>\n<p style=\"text-align: justify;\">Now, ten pounds isn’t really that much however, if we gain that much each decade, which doctors say it’s a very high percentage of that do as we grow older, than eventually, it’s going to catch up to us and manifest itself through obesity, a shift in our bodies ability to maintain the shape that we once had and, through diseases such as diabetes, cancer, heart disease etc.</p>\n<p style=\"text-align: justify;\">A few modifications are all that is needed to get slimmer and stay that way.  It takes 3500 calories to add a pound to our body.  As we get older we tend to eat a little more fat and carbohydrates than we used to.  With that we add way more calories without even noticing that we added one-hundred, two-hundred or more calories in just one sitting.</p>\n<p style=\"text-align: justify;\">I won’t even go into the mindless eating that we don’t even think about like grazing in the pantry, licking the spoons as we cook, trying samples of other peoples food, etc.  So if we added one-hundred little calories a day without even thinking about it, then it would be as follows:</p>\n<ul>\n<li style=\"text-align: justify;\">100 Calories per day X 365 days per year</li>\n<li style=\"text-align: justify;\">365 X 100 = 36,500/3500 per pound and viola we have gained ten pounds!</li>\n<li style=\"text-align: justify;\">Now if we multiply that by each decade that we live 10 x ? (however long we will allow this to happen) .. You get the point.</li>\n</ul>\n<p style=\"text-align: justify;\">So if you want to be slimmer or maintain your weight as you age then you might want to do the following simple steps:</p>\n<ul style=\"text-align: justify;\">\n<li>Reduce your food intake by one-hundred calories (preferably two-hundred) per day.</li>\n<li>Reduce your total calories if you are a woman to 1200. This takes the ability to count calories for about a month until you are a pro and then you won’t have to think twice about it.</li>\n<li>If you drink wine, alcohol, etc. cut it in half. Sodas, eliminate them and drink unsweet tea sweetened with Stevia (a natural sweetner which tastes fantasti­­c) or lot&#8217;s of water with lemon.</li>\n<li>If you go over then subtract from the next day.</li>\n<li>Drink a large glass of warm water with lemon or lime before eating and during a meal.</li>\n<li>Eat a ton of vegetables rather than fruits and refined foods and eat lean protein.</li>\n<li>If you go over then walk for thirty minutes in ten minute intervals if you hate working out. Every one can walk for ten minutes. If you are disabled then you will have to reduce your calories by at least a hundred or so more.</li>\n<li>When you eat out, ask the waiter to box half of the food to go or ask for a box and do it yourself before you eat. You’ll have your next meal and only half the calories.</li>\n<li>Consume more low calories soups and drink/eat them throughout the day.</li>\n<li>Whenever I’m hungry, I tend to want to eat everything in site but I have found that, when I drink a cup of warm broth several times a day, it settles my stomach and makes me less hungry thus, reducing my desire to binge or over eat. I think it’s the warmth that makes the difference.</li>\n</ul>\n<p style=\"text-align: justify;\">With these little food hacks, you will lose weight however, it will take some time.  But giving up a hundred or two calories a day isn’t all that bad.  It’s definitely better then those fad diets of fasting, no carbs, or juicing all day, etc.</p>\n<p style=\"text-align: justify;\">Remember this will take some time but once you do this, you will see weight loss over time but this is A way to easily lose a few pounds!</p>\n<p style=\"text-align: justify;\">If you really want to speed it up, add some workouts too!</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/42260e31eeaa6c53371d0f1a1d88ccc4/1a478/44052274_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"64fd0d30-2b31-5f69-849d-78ea9dccabcb"}}