{"data":{"wordpressPost":{"title":"PHYSICAL ACTIVITY AND AGING","content":"<h2></h2>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\"><strong>PHYSICAL ACTIVITY AND AGING</strong></span></h2>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Engaging in physical activity does the body wonders.  Basically when we exercise, every cell in our body benefits from it.  Exercising lowers our blood pressure and makes our arteries stronger.</p>\n<p>It also makes our bones stronger, our brains better and, helps our immune system, not to mention it helps maintain our weight goals as well.  I workout daily although my motto is “the best part of working out is when it’s done” it does feel good to have done it.</p>\n<p>Three types of exercising and these are cardio, strength training and, yoga/stretching.  Of course, there are different types of programs such as, plyometrics, circuit training, high intensity interval training, Tabata, CrossFit, etc.</p>\n<p>These all have value but cardio is the best overall.  Of course, you get some cardio from weight training from strength training; it&#8217;s is better to get your heart rate to seventy-five and eighty-five percent of its maximum capacity for at least 20 minutes.</p>\n<p>This translates into about 120 beats a minute for the average person.  If you like riding bikes, dancing or fast walking, these can also be beneficial as well.  Of course cardio will burn lots of calories fast.</p>\n<p>Lifting weights creates lean muscle mass.  The more muscle mass we have the more growth hormone and other anti-aging combinations we will have.  Not to mention we will look lean and toned which looks aesthetically pleasing to say the least.</p>\n<p>Yoga and stretching improves mobility and flexibility as we age.  It also helps improve strength and we need all of these as we age to prevent injury.  Endorsing both the renewal process and the exercise process, you will endorse a better body both inside and out.  You will also add years to your life.</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\"><strong>PHYSICAL ACTIVITY AND AGING</strong></span></h2>\n<p>&nbsp;</p>\n<p>Of course, exercising takes effort.  A lot of people don’t like to exercise or say they just don’t have the time.  If you absolutely hate to exercise, I say do the easiest one that way you will do it.  Anything is better than nothing.  Who knows, after a while, you may do more and more as you look and feel better.  If you say you don’t have time, then get up earlier or split your workout into two sessions.</p>\n<p>Do twenty minutes before your morning shower and twenty quickly before you eat dinner.  You will be amazed how well this works and how fast it goes by breaking it up.  If you think you will fail to eat right, workout and renew your body because maybe, you have failed many times before, I want you to know this is not some diet.</p>\n<p>Living in the renewal process is simply the way our bodies want us to in order to optimize its longevity.  You don’t have to do it in one big leap, just take your time.  It’s easier than we might think.  Go easy at first and then the harder stuff will come easier too.</p>\n<p>To the extent you take care of yourself is the extent that your body will return the favor.  If you only follow a few of these steps, then so be it.  At least you are taking care of yourself and you are becoming mindful of the process.  When we become mindful and aware, we tend to automatically put it into our subconscious and it becomes a reflex and second nature.</p>\n<p>&nbsp;</p>\n<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">If you seriously want smoother skin then check out my &#8220;Smooth Skin&#8221; course where I will show you exactly how I get it.  No needles, fillers or surgeons needed here!</span></h3>\n<h4 style=\"text-align: center;\"><a href=\"https://how-to-get-smoother-skin.teachable.com\"><span style=\"color: #ff0000;\">https://how-to-get-smoother-skin.teachable.com</span></a></h4>\n<p style=\"text-align: center;\"><img class=\"alignnone size-full wp-image-7855\" src=\"https://myagingandwellness.com/wp-content/uploads/2017/06/GIFlogoColorSmall.gif\" alt=\"\" width=\"250\" height=\"151\" /></p>\n<p>&nbsp;</p>\n<p style=\"text-align: center;\">\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p style=\"text-align: center;\"><img class=\"alignnone size-full wp-image-7521\" src=\"https://myagingandwellness.com/wp-content/uploads/2015/08/mepicture-278x280.jpg\" alt=\"\" width=\"278\" height=\"280\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2015/08/mepicture-278x280.jpg 278w, https://myagingandwellness.com/wp-content/uploads/2015/08/mepicture-278x280-150x150.jpg 150w, https://myagingandwellness.com/wp-content/uploads/2015/08/mepicture-278x280-180x180.jpg 180w\" sizes=\"(max-width: 278px) 100vw, 278px\" /></p>\n<p style=\"text-align: center;\">\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/514e8f72ebf2c8abbb560ad55bab2001/1a478/16490266_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"328c1b0c-cc2e-57ed-ac61-807684e9b2da"}}