{"data":{"wordpressPost":{"title":"Finding our purpose at middle-age","content":"<p style=\"text-align: justify;\">Finding our purpose at middle-age</p>\n<p style=\"text-align: justify;\">Middle age is when we may begin to (should I dare say it?) feel old. We feel the effects of aging and begin to see our own mortality. This is the part that gets me. Sometimes at this age, it’s hard to relate to those who are younger.</p>\n<p style=\"text-align: justify;\">This is when our outward appearance and the perceptions of others begin to change. This can be a scary time. I am going to say what we already know, and that is aging is not looked upon so well. The value placed on appearance in our society far outweighs the value of experience and compassion. Aging can make one feel shelved and unneeded. Even if we may sometimes feel this way, it is certainly not the truth.</p>\n<p style=\"text-align: justify;\">You may have grown tired of the relationships in your life at this stage of life. Many women stay in relationships because of the kids when they know full well they are not happy. Sometimes we stay for financial reasons.</p>\n<p style=\"text-align: justify;\">We look ahead and fear we will be penniless on the streets and think we should stay for stability. However, many of us believe this is the right time to leave and start a new life. When someone says they don’t want to leave an unhappy situation because of the fear of the unknown, I have to ask them, why don’t you fear what you know?</p>\n<p style=\"text-align: justify;\">You already know that you are unhappy, so the unknown can’t be that much worse. At least when you head out into the unknown, you basically get to redesign the life you want. Staying in certainty, but living in misery, is detrimental to living a full life, and that in itself is daunting.</p>\n<p style=\"text-align: justify;\">Both men and women fear being alone. Men are more likely to find a younger version, while we are more likely to trade companionship for passion. Women are more likely to put importance on intimacy and connections with those already around them.</p>\n<p style=\"text-align: justify;\">Many young people think old people are loners, and yes some are alone, but many are not. Older women and men are becoming less self-centered and more connected to others. I have always believed that we get the love we ask for, so we simply just need to ask ourselves, “What kind of love do we want?” and then put it out there for others to see and feel.</p>\n<p style=\"text-align: justify;\">Too many times we hide the truth, because we don’t want others to see the real us because we feel it makes us look vulnerable and needy. Put this kind of thinking aside. Everyone needs to be, and should be, loved in some way or another.</p>\n<p style=\"text-align: justify;\">There are different kinds of relationships, therefore, different kinds of love. One type doesn’t fit everyone. The important thing is, love is love. If not in intimacy, then in whatever relationship makes us feel important, needed and respected.</p>\n<p style=\"text-align: justify;\">Women do a great job when it comes to loving and respecting others. We deserve the same in return and it&#8217;s not too much to ask for.</p>\n<p style=\"text-align: justify;\">A fear that every woman has probably thought about at least once in her life (even if you are wealthy) is becoming the bag lady or an old homeless woman. We are all aware of the recent Great Recession 2.0.</p>\n<p style=\"text-align: justify;\">Many industries, like real estate, construction, and sales, left a lot of us, who were<span style=\"font-size: 0.95em; line-height: 1.6em;\">employed, displaced, and a significant proportion of working people and their families were forced onto the streets and became homeless, or for the first time, needed to depend on the government or charities to make it.</span></p>\n<p style=\"text-align: justify;\">Maybe you got through it (though, tough), or maybe it didn’t affect you. If you were the latter, than you were lucky.</p>\n<p style=\"text-align: justify;\">Maybe we have images of homeless elderly women living on the streets and it scares the hell out of us, creating this fear and mantra in our heads that tells us, “I will never be like that,” all the while the fear creating turmoil in the back of our minds, reminding us that we are just a few paychecks away from being alone, on the streets and penniless.</p>\n<p style=\"text-align: justify;\">Not every woman will have enough money for retirement, but don’t worry or panic. Try to put a little away each week. It will make a big difference later on. You pay your payments each month; just create an auto draft into savings each week. Out of sight, out of mind, and ultimately peace of mind.</p>\n<p style=\"text-align: justify;\">And remember, DON’T WORRY because worrying is just a waste of your precious time. The antidote to worry is to take action and try to resolve the problem as best you can and then, more importantly, move on.</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/85caf055ed2c51f5924234c8b2ccd610/1a478/18735993_s1-300x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"6be01aa1-937f-5234-a6db-086f555e76de"}}