{"data":{"wordpressPost":{"title":"The Five Mistakes That Make Women Look Older","content":"<p style=\"text-align: center;\"><strong>The Five Mistakes That Make Women Look Older </strong></p>\n<p style=\"text-align: center;\"><strong>And How To Correct Them!</strong></p>\n<p style=\"text-align: center;\"><strong> </strong></p>\n<p style=\"text-align: justify;\"><strong>The Five Mistakes That Make Women Look Older. </strong>Besides not smoking, drinking too much or, eating too much sugar, a lot of the way we age is in our own hands!  Yep! I said it. We can control a lot of the way we look by our daily routine.</p>\n<p style=\"text-align: justify;\">Of course we are going to age and yes, genetics are a big factor however, we can either turn on genes by what we do or don’t do or, we can overcome them and <strong><em>look as young as we feel.</em></strong></p>\n<p><em>Are you aging yourself faster than you need to?</em></p>\n<p style=\"text-align: center;\"><strong>The Five Huge Mistakes Women Look Older And How To </strong><strong>Correct Them!</strong></p>\n<p><strong>#1.   <u>Not using Sunscreen, Vitamin C Serum, Eye Cream and Moisturizer.</u></strong></p>\n<p><strong><u> </u></strong></p>\n<p><strong>#2.  <u>Not using Retin-A or an alternative Retinoid and, Not Doing Skin Peels to  Create Collagen.</u></strong></p>\n<p><strong> </strong></p>\n<p><strong>#3.  <u>Not Eating a lot of Vegetables and Plant Foods throughout the day, Every day!</u></strong></p>\n<p><strong> </strong></p>\n<p><strong>#4.   <u>Not Supplementing Correctly and Consistently.</u></strong></p>\n<p><strong> </strong></p>\n<p><strong>#5.  <u>Not Lifting Weights and Not Gaining Muscle Tone.</u></strong></p>\n<p>&nbsp;</p>\n<p>Okay, technically that’s ten things that most women don’t do that ages them fast however, I didn’t want to overwhelm you into thinking I want you to do a bunch of steps that are not practical!</p>\n<p style=\"text-align: center;\"><strong>Life’s too short to be rigid.</strong></p>\n<p>Aging is going to happen however I think it’s important to look as good as we feel.</p>\n<p><strong>If you only do these five (okay ten) things consistently, I promise your skin, face, and body will look at least ten years younger within three to six months!</strong></p>\n<p><strong>I dare you to take the challenge!</strong></p>\n<p><strong><em><u>Here’s your CHEAT SHEET BELOW!</u></em></strong></p>\n<p><strong><em>You didn’t think I would just tell you and not give you the resources did you?  </em></strong><strong>One more thing before we get started!  There is no need to spend a lot of money to look good!</strong></p>\n<p><strong>I’m going to get right to it and tell you where to get the best products (that actually work) for the least cost and that take the least amount of effort. </strong></p>\n<p><strong>­­</strong></p>\n<p style=\"text-align: center;\"><strong>Five Aging Mistakes:</strong></p>\n<p><strong> </strong></p>\n<p><strong><u>#1.   Not using Sunscreen, Vitamin C Serum, Eye Cream and Moisturizer:</u></strong></p>\n<p><strong><u> </u></strong></p>\n<p style=\"text-align: justify;\">On my face I use L&#8217;Oreal® Paris Advanced Suncare Silky Sheer BB Face Lotion SPF 50+ &#8211; 1.7 oz.  It can be bought for about ten dollars and found at any CVS or Walgreens.  I used to use one for about $50.00 and it felt and worked the same way. Don’t forget one for your body too.</p>\n<p style=\"text-align: justify;\">Vitamin C Serum is used to brighten and even-out your complexion.  It’s also used as an antioxidant and as a barrier for pollutants, etc.  It works amazing!  I use the Vitamin C 20% Serum + Ferulic Acid &amp; Hyaluronic Acid for maximum Anti-Aging! 100% Safe &amp; Effective!  It’s a highly concentrated solution to Repair, Protect, &amp; Prevent Skin Aging. No Parabens or oils!  Stimulates Collagen and neutralizes Free Radicals, 1 oz / 30 ml from Cosmetic Skin Solutions LLC.  I get it online at Amazon for about $28.00.  I used to use one that cost $150 that didn’t even come close to this one.</p>\n<p style=\"text-align: justify;\">It’s really important to use an under eye moisturizer that is specifically for eyes.  Honestly, just go to your local CVS or Walgreens and look for one that is for the eyes.  It makes a huge difference.  Make sure to use it twice a day and watch how great your eyes look!</p>\n<p style=\"text-align: justify;\">It doesn’t matter what brand of moisturizer you use so long as you use it. Even if you think you can’t because you have oily skin, chances are you need it.  Get the one that is for your skin type.  I use Regenerist by Oil of Olay.  I have used ones that cost hundreds of dollars</p>\n<p style=\"text-align: justify;\">and I always go back to Oil of Olay because it works.  Just use it daily.  With today’s technology, they’re all good.  No need to be duped into paying a ton for ingredients that we can’t even pronounce.  There are some exceptions like stem cell technology and peptides but to start, just chose one and be consistent.</p>\n<p style=\"text-align: justify;\">Many women want to use more natural products with less chemicals and by all means do so.  Just use them consistently!</p>\n<p style=\"text-align: justify;\">The above products should last you four weeks (probably longer).  If you add them together, the cost is about $20.00 a week.  It’s important that you use enough of the product too.</p>\n<p style=\"text-align: justify;\"><strong><u>#2.  Not using Retin-A or an Alternative Retinoid and, not doing Skin Peels to  Create Collagen.</u></strong></p>\n<p style=\"text-align: justify;\"><strong> </strong></p>\n<p style=\"text-align: justify;\"><em><u>Retin-A</u></em> is the only thing you will need a doctor’s prescription for and your regular doctor can give it to you.</p>\n<p style=\"text-align: justify;\">Here’s the kicker!  Usually insurance won’t cover Retin-A because it’s considered cosmetic and a tube can run about $250.00 but, do what I do and go online to CanadaPharmacy.com and order it there.  You’ll create an account, fax your script and, they will ship it for about $60.00!  How’s that for saving some money?</p>\n<p style=\"text-align: justify;\">Retin-A is so good and it will change your face, neck and chest, like nothing you’ve ever used before.  I could go on and rave about it but here’s the definition online:</p>\n<p style=\"text-align: justify;\">“Retin-A (tretinoin) is a form of vitamin A that helps the skin renew itself.”</p>\n<p style=\"text-align: justify;\">Shall I say more?  I’ve used it for about ten years!  Just talk to your doctor or NP and then get it as fast as you can.  Start off with the lowest strength and move up.  There are alternatives on the market but I think Retin-A is the best (generic too).</p>\n<p style=\"text-align: justify;\">Keep exfoliating and turning over those skin cells! KEY, KEY, KEY to younger skin!</p>\n<p style=\"text-align: justify;\">I do an at home <u>skin peel</u> two times a month.  Go online and talk to the people at skin-peel.com and they will guide you on what peel is right for you.  It’s literally hundreds if not thousands of dollars that you’ll save by doing them yourself.   Face peels literally only take less than five minutes to do and the results are amazing.  Peels are the second most valuable game changer in my regime, next to Retin-A.  Just two times a month!  How easy is that?</p>\n<p style=\"text-align: justify;\">PLEASE, PLEASE!  ALWAYS WEAR SUNSCREEN WHEN USING THESE PRODUCTS.  After all you’re creating new skin!  It’s like a baby’s.  Protect it.</p>\n<p><strong><u>#3.  Not Eating a lot of Vegetables and Plant Foods throughout the day, Every day! </u></strong></p>\n<p style=\"text-align: justify;\">If you don’t think that a mostly plant based eating plan will change the way you look (and feel for that matter) then I dare you to try it for 90 days!  I’m not saying don’t eat meat if you’re a meat eater (don’t worry) however, try to eat about 80% to 90% vegetables and nuts throughout the day.  Notice how I didn’t say fruit?  Eat fruit sparingly because it has a lot of sugar with the exception of berries, etc.  Follow this and your skin and body will drastically change.</p>\n<p><u>#4.   Not Supplementing Correctly and Consistently.</u></p>\n<p style=\"text-align: justify;\">Supplementing is an excellent way to get you looking and feeling your best.  You don’t need to take loads of them or spend a lot.  Of course, as always, check with your medical professional before beginning any supplement program.</p>\n<p style=\"text-align: justify;\">Your skin reflects how healthy you are in the inside so it makes sense to supplement your inside with the nutrients that balance and maintain your body therefore, creating a great body and a younger looking appearance.  Not to mention all of the health benefits too!</p>\n<p><strong><em>What supplements and/or vitamins do you need to be healthy and have great skin?</em></strong></p>\n<p style=\"text-align: center;\"><strong><u>Vitamins C, D, E, A, K, ALA, B complex, CoQ10 (Ubiquinol), multi-vitamin, Omega-</u></strong></p>\n<p style=\"text-align: center;\"><strong><u>3’s, and probiotics. </u></strong></p>\n<p><strong> </strong></p>\n<p style=\"text-align: center;\"><strong>Here’s the Supplement Breakdown:</strong></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<ul>\n<li style=\"text-align: justify;\"><strong><em>Vitamins C and E</em></strong> help by reducing the damage caused by free radicals. <strong><em>Vitamin A</em></strong> is needed especially if your skin is dry and flaky but you usually get this well enough through food such as fruits and veggies.  <strong><em>A good multivitamin should have enough A and E in addition to a good diet. (Please consult your doctor before taking A and E by themselves)</em></strong></li>\n</ul>\n<ul style=\"text-align: justify;\">\n<li><strong><em>“ Vitamin B Complex.</em></strong> When it comes to skin, the single most important B vitamin is biotin, a nutrient that forms the basis of skin, nail, and hair cells. Without adequate amounts, you may end up with dermatitis (an itchy, scaly skin reaction) or sometimes even hair loss. Even a mild deficiency causes symptoms.” (webmd.com)</li>\n</ul>\n<ul style=\"text-align: justify;\">\n<li><strong><em>“Alpha-Lipoic Acid (ALA)</em></strong> is a very powerful antioxidant. In fact, it’s way more potent than vitamin C or E.  Alpha-Lipoic Acid may turn out to be a super boost for aging skin. What makes it so special, skin experts say is, its ability to penetrate both oil and water, affecting skin cells from both the inside and the outside of the body. Most other antioxidants can do one but not both.” (webmd.com).  I take one twice a day and I can see a secondary affect and that is, I’ve dropped five pounds without trying and my skin is much more radiant.</li>\n</ul>\n<ul style=\"text-align: justify;\">\n<li>Maybe your doctor has told you to take <strong><em>fish oil or flaxseed oil</em></strong>? If not you should!  In fish oil, the omega-3 fatty acid serves as a skin barrier and also helps to maintain inflammation.  It also supports mental health, promotes cognitive agility and decreases the risk of cardiovascular disease and heart attacks.</li>\n</ul>\n<ul>\n<li style=\"text-align: justify;\"><strong><em>Ubiquinol Coenzyme Q10</em></strong> is great as it protects your skin from oxidative stress and helps your skin repair itself. The Co means together and enzymes are the catalyst for all chemical reactions in our bodies.  With this, we couldn’t sustain life!  The problem is, as we get older, we make less and less of it.</li>\n</ul>\n<p>&nbsp;</p>\n<ul>\n<li style=\"text-align: justify;\">Just eat your green leafy veggies to get your daily <strong><em>Vitamin K</em></strong>. It’s also in your multi-vitamin too.</li>\n</ul>\n<ul style=\"text-align: justify;\">\n<li>“<strong><em>Vitamin D</em></strong> deficiency has now been linked to breast cancer, colon cancer, prostate cancer, heart disease, depression, weight gain, and other maladies. These studies show that people with higher levels of vitamin D have a lower risk of disease, although they do not definitively prove that lack of vitamin D causes disease &#8212; or that vitamin D supplements would lower risk.” (WebMD/com).  Just get your levels checked to see if you need it.</li>\n</ul>\n<ul style=\"text-align: justify;\">\n<li>There has been a lot of mixed data about taking a daily <strong><em>multi-vitamin</em></strong> meaning, some are saying that a daily vitamin is useless. However, until they can actually prove otherwise, enhancing your diet with nutritional supplements can get you closer to optimal health.  One of the reasons we may need a daily vitamin is because our soil is not producing as much nutrient rich food.</li>\n</ul>\n<ul style=\"text-align: justify;\">\n<li>It’s said that most if not all disease starts in the gut! <strong><em>Probiotics</em></strong> provide lots of benefits for your immune system. “When probiotics are abundant in your body, it’s harder for bacteria that cause illness to get a foothold.” (doctoroz.com)</li>\n</ul>\n<p style=\"text-align: justify;\">For all of my supplements, I go to Whole Foods and use their brands.  They are very inexpensive and most are plant based.</p>\n<p style=\"text-align: justify;\">If you have the ability to, get a blood test to see if and what you may be deficient in.  I was surprised that I needed iron.</p>\n<p style=\"text-align: justify;\"><strong><em>DISCLAIMER</em></strong>:  I am in not a doctor or health care worker.  I am not recommending any supplement program.  I am only sharing what has worked for me and what I have researched personally.  Please consult your physician.</p>\n<p style=\"text-align: justify;\"><strong><u> </u></strong></p>\n<p><strong><u>#5.  Not Lifting Weights and Losing Muscle Tone.</u></strong></p>\n<p><strong><u> </u></strong></p>\n<p style=\"text-align: justify;\">To me there are two great things about exercising and the first is, when it’s over!! And the second is how my clothes fit.  No, I won’t work out like an athlete or look like I’m 18 again but, I can look tone and so can you.</p>\n<p style=\"text-align: justify;\">Lifting weights will change your life.  If you have never or you don’t know how, just get started with what you can lift and move up the weight size.  Do one body part per day.  If it’s too much then break it up by two times a day for fifteen minutes each, five days a week.  Many women think they will bulk up, and I have to say that “I wish” however, women don’t have that kind of testosterone.  As we age, we lose muscle every decade.  We can lift all day and still not bulk up so, lift away and watch the shape of your body change.</p>\n<p style=\"text-align: justify;\">You’ll see amazing changes if you are consistent.  Use videos, fitness magazines, Pinterest, Apps, etc.  Just try it and in three months or so, you’ll see a difference in your shape.  Plus, it’s good for your bones as you age.</p>\n<p><strong>Quick Recap:  As directed by the product manufacturer and consistently:</strong></p>\n<ol>\n<li><strong>Wear Sunscreen, Vitamin C Serum, Eye Cream and Moisturizer.</strong></li>\n<li><strong>Use Retin-A and do Skin Peels.</strong></li>\n<li><strong>Eat Lots of Veggies, Nuts and Seeds.</strong></li>\n<li><strong>Lift Weights.</strong></li>\n</ol>\n<p>&nbsp;</p>\n<p style=\"text-align: center;\"><strong> The Five Huge Mistakes That Make Women Look Older And How To Correct Them!</strong></p>\n<p><strong>I wish you all the best!</strong></p>\n<p><img class=\"\" src=\"https://myagingandwellness.com/wp-admin/admin-ajax.php?action=imgedit-preview&amp;_ajax_nonce=536fa627f1&amp;postid=366&amp;rand=14937\" width=\"190\" height=\"219\" /></p>\n<p>&nbsp;</p>\n<p style=\"text-align: center;\"><em>Before you go, I created &#8220;The 7 Steps to Rejuvenate and Renewal.&#8221; In just seven</em></p>\n<p style=\"text-align: center;\"><em>steps you can feel amazing without depriving your self!  Click the link below:</em></p>\n<p style=\"text-align: center;\"><em>THE REJUVENATION AND RENEWAL PLAN</em></p>\n<p style=\"text-align: center;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><em>https://theresaskrobanek.leadpages.co/rejuvenate-renew/</em></a></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/97c424e0bbedc3332552cb4d3f7891cc/1a478/32004867_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"1accfbb5-061f-5fc4-a195-71b4c48731f6"}}