{"data":{"wordpressPost":{"title":"The fantasy of the perfect partner","content":"<h2 style=\"text-align: justify;\">The fantasy of the perfect partner</h2>\n<p style=\"text-align: justify;\">Many of us are brought up believing that our main goal in life is not only to be happy and live a content and meaningful life but, to also find the perfect partner and get married. If we do this, then they say, we can be happy so, this is what most of us do whether we have found the right partner or not.</p>\n<p style=\"text-align: justify;\">Whether we had two parents or a single parent who drilled this message into us, one way or another, most of us are taught this way of thinking.  We may get this message from the media, the movies, our teachers, friends, or our family.  The dream we learn is to get married, have a family and live happily ever after. It is our nature to be paired with another.</p>\n<p style=\"text-align: justify;\">Those fantasies, the same ones that make us expect our husbands, boyfriends, girlfriends, to know what is always on our mind so that they will remember that special holiday without us reminding them or better yet, without them waiting until ten minutes before they come home to grab some cheap flowers that say “You are not that special, but I didn’t want to hear you complain so I grabbed these at the grocery store along with the toilet paper.”</p>\n<p style=\"text-align: justify;\">You know, the images we have in our head, the one that stops us when we see a commercial and in 30 seconds condition us to believe that love is all that matters and the perfect mate is all you need to be happy.</p>\n<p style=\"text-align: justify;\">If only we could have the perfect one? Oh, and last but not least, the fantasy about us being completed by someone else.  Completed by someone else? Can you imagine that?  As if that’s possible?</p>\n<p style=\"text-align: justify;\">I am starting to sound like a sad country song I know.  I can already see the lyrics, girl finds perfect guy, they have the perfect wedding, careers, kids and then boom! He never comes home, she drinks too much wine and, the kids are all messed up!</p>\n<p style=\"text-align: justify;\">By generating illusions about finding the perfect partner, we are setting ourselves up for failure.  Even our parents probably didn’t have such great marriages.</p>\n<p style=\"text-align: justify;\">The Fairy tale of perfection doesn’t exist.  Who knows?  Will we be or, are we lucky enough to find the perfect person to share the rest of our lives with?  The vital point is that there is no other perfect person for anyone.</p>\n<p style=\"text-align: justify;\">That’s why so many people can’t find that special person because the perfect person is a delusion propagated by things outside of ourselves.  We may have painted a pretty picture in our minds of the perfect love but really, you are your own perfect person.  What we need to focus on, if we want a long lasting relationship of any kind is, <em>compatibility</em>.</p>\n<p style=\"text-align: justify;\">Sure, at first you may have some chemistry or the relationship is new so you live in the moment.  Once it begins to become comfortable, you begin to see how compatible or incompatible you are.</p>\n<p style=\"text-align: justify;\">At this point, you have invested some time so rather than throw the relationship away if you are not compatible, you begin to overlook the many ways that you are not compatible with your partner.</p>\n<p style=\"text-align: justify;\">Fairy tales can still exist for some but, for the most part, life is not about idealism, its about real life stuff and sometimes its difficult and sometimes its not so perfect.</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n<p>&nbsp;</p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"ccac6a9d-506e-5aa6-9475-9385283f9b81"}}