{"data":{"wordpressPost":{"title":"Free yourself to let go and grow old compassionately","content":"<p style=\"text-align: justify;\">Free yourself to let go and grow old compassionately.</p>\n<p style=\"text-align: justify;\">Call it growing old, getting old, aging, or whatever you want to call the inevitable. Getting old is going to happen no matter what. As we move towards the later years and age, there is something we still have yet to do and that is to forgive.</p>\n<p style=\"text-align: justify;\">Forgive ourselves and forgive others, to let go and free ourselves to grow old with compassion for ourselves. Maybe we could have been better wives, mothers, sisters, givers, or whatever you may have regrets about, so what, the past is the past and it no longer matters anymore.</p>\n<p style=\"text-align: justify;\">What’s done is done, now it’s about being kind to yourself. If you need to let others know what you now realize, then let them know and ask for forgiveness, forgive them if you need to and move on.</p>\n<p style=\"text-align: justify;\">Whatever we have been searching for outside of ourselves is already within us. There is nothing to find out there that we don’t already have inside. I talk to or hear about many older people that are deeply sad about the past. Maybe its things they wished they had done or wished they hadn’t done.</p>\n<p style=\"text-align: justify;\">If you are holding in sadness, despair, regret or any other emotion that you may be attributing to unhappiness, then just let it go. If you can do something about it, do it now and do it quick, but don’t dwell on it. Whatever the past was, it doesn’t equal the future and the future is now. There is no reason not to forgive ourselves for whatever mistakes we have made in the past even if they were made only by omission.</p>\n<p style=\"text-align: justify;\">In order to grow old, we must not fear growing old. The biggest problem that we all have, both men and women, is fear. We are afraid to live, to be alive, and to risk being ourselves.</p>\n<p style=\"text-align: justify;\">Nothing defines us like death, and yet death is not our greatest fear, but genuinely living is the real fear. We have all had bad luck, bad breaks, heartbreak, or things didn’t turn out the way we wanted them, however, we and the world still keep going.</p>\n<p style=\"text-align: justify;\">We have to, we have no choice, but we continue to hold in pain and, with every breath, we don’t let it out. We have to let go of pain and release it along with the blame and guilt. If you can’t do this then you owe it to yourself, and to those who love you, to make peace with yourself so that you can fully live and love those around you.</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"5db68207-192d-5c3b-9eed-dc91de665c31"}}