{"data":{"wordpressPost":{"title":"Do we create what we fear?","content":"<h2></h2>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Do we create what we fear?</span></h2>\n<p>&nbsp;</p>\n<p style=\"text-align: justify;\">I&#8217;ve read the book &#8220;The Secret&#8221; and I often follow certain inspirational leaders.  I think that all of the stuff about &#8220;if you believe it, it will appear.&#8221; As in, see the dream house that you want and focus on having it and, it will magically appear one day is probably not going to happen!</p>\n<p style=\"text-align: justify;\">We either work hard for it and make it happen or it doesn&#8217;t.</p>\n<p style=\"text-align: justify;\">Sure, I received some of the stuff that I wanted in life but, only after about fifteen years of working my ass off for it!</p>\n<p style=\"text-align: justify;\">I have to say that I don&#8217;t believe in getting what we dream of just by putting our wishes on some dream board and then staring at the picture all day. But, that&#8217;s just me 🙂</p>\n<p style=\"text-align: justify;\">If this were possible most of us would not only be living in our dream home and driving that awesome sports car but, we would have won the lottery as well.  In fact, I wouldn&#8217;t even be writing this post because it wouldn&#8217;t be relevant.</p>\n<p style=\"text-align: justify;\">Receiving what we dream of is completely possible but, no one knocks on your door and gives it to you.</p>\n<p style=\"text-align: justify;\">Nothing is impossible just the impossibility of getting what we want without the effort.</p>\n<p style=\"text-align: justify;\">Now, this brings me to the flip side of this topic.  And that is, do we create what we fear?</p>\n<p style=\"text-align: justify;\">For those who believe they can manifest all of the material things that they want through the mind&#8217;s eye, they may not think that the same thing is possible for the things that they don&#8217;t wan&#8217;t.</p>\n<p style=\"text-align: justify;\">Creating what we fear is easier because, without realizing it, we put a lot more energy into running from our fears than running after what we want.</p>\n<p style=\"text-align: justify;\">The difference is that, what we put into the back of our mind (the fear rather than the desires in the front of our mind) have a funny way of making themselves come true.</p>\n<p style=\"text-align: justify;\">It&#8217;s the constant thinking and awareness of what we are afraid of that we keep tightly suspended at all times keeping ourselves fully aware of the pain that it will cause so, we do everything to avoid what we hold in our mind only to actually, attract that very thing that we fear?</p>\n<p style=\"text-align: justify;\">I can&#8217;t tell you how much I have done this.  With the exception of one or two things, almost everything that I was afraid of has happened to me. Well, it didn&#8217;t happen by itself, but by me creating what I feared.</p>\n<p style=\"text-align: justify;\">For example.  My mother was married many times and me and my brothers all had different fathers that we never met.</p>\n<p style=\"text-align: justify;\">When I was younger, I said that I would never be like my mother and when I got married, I would stay with the father of my kids so that they would not only have a stable life with a father that loved them but, they would always have two parents to be there for them (this was my fear).</p>\n<p style=\"text-align: justify;\">For the most part, I achieved this however, I held on so tight that I caused a lot more problems by holding onto the fear of not wanting to be like my mother.</p>\n<p style=\"text-align: justify;\">There have been many times in my business that my decisions were counter intuitive to what needed to be done because of fear, which lead me into situations where the decision that I made had nothing to do with the business but, by me wanting to avoid what I feared only, to create the exact opposite.</p>\n<p style=\"text-align: justify;\">It&#8217;s like as soon as you decide that you fear something, a universal magnet of some sort begins it&#8217;s process in your subconscious mind and then, it&#8217;s only a matter of time before that exact outcome happens.</p>\n<p style=\"text-align: justify;\">Through out my mothers life, she worried that she&#8217;d end up alone. She was so afraid of it that it paralyzed her ability to have good relationships therefore, creating exactly what she feared.</p>\n<p style=\"text-align: justify;\">When a man would come into my mothers life, he was usually a loser which is what she attracted (the fear of being alone) which then, manifested her belief system.</p>\n<p style=\"text-align: justify;\">My mother died alone, two months ago of a methadone overdose on her couch.  She created exactly what she feared and the thing is, she felt this way since I was a small child.  She basically manifested and created the way that she would eventually die.</p>\n<p style=\"text-align: justify;\">If I have learned one thing about creating what we fear it is to stop thinking about the negative things and, anytime the fear of what might or could happen, replace that thought with a positive one.</p>\n<p style=\"text-align: justify;\">Don&#8217;t tell yourself negative stories and for sure, try not to see a negative story unfold in your mind and, for sure, don&#8217;t believe the lies that your mind tells you.</p>\n<p style=\"text-align: justify;\">These kinds of stories have no place in our lives.  Our lives are not destined to be the story that we create but, only the story that we put into energy.</p>\n<p style=\"text-align: justify;\">The difference is, which side will you put your energy into?  The fear or the desire.  Because, this is how either side will happen.</p>\n<p style=\"text-align: justify;\">The real key to manifesting the things that you dream about are from letting go and freeing yourself from the things that you are fearful of.</p>\n<p>&nbsp;</p>\n<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">If you would like to find more ways to Rejuvenate.  I have created a six-step course called &#8220;The Rejuvenation Program&#8221;</span></h3>\n<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\"> You can check it out by clicking this link: <a href=\"http://www.therejuvenationprogram.com\">http://www.therejuvenationprogram.com</a></span></h3>\n<div id=\"attachment_8361\" style=\"width: 310px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8361\" class=\"size-medium wp-image-8361\" src=\"https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-300x251.png\" alt=\"The Rejuvenation Program\" width=\"300\" height=\"251\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-300x251.png 300w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-768x644.png 768w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-624x523.png 624w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-600x503.png 600w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program.png 940w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><p id=\"caption-attachment-8361\" class=\"wp-caption-text\">The Rejuvenation Program</p></div>\n<p style=\"text-align: center;\">\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"c3e9dd3c-dff5-566c-9f1f-437be9f5a6fb"}}