{"data":{"wordpressPost":{"title":"In the end we will all look old","content":"<p>&nbsp;</p>\n<p>&nbsp;</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">In the end, we will all look old</span></h2>\n<p>&nbsp;</p>\n<p style=\"text-align: justify;\">I have been following certain marketers online who say that videos instead of written blog posts are where the internet is going.</p>\n<p style=\"text-align: justify;\">That&#8217;s a bit scary for me because for one; I don&#8217;t write as good as I&#8217;d like to and two, I am terrified of being on video.</p>\n<p style=\"text-align: justify;\">I don&#8217;t like the way I look on video and what terrifies me.  While doing some Google research, it appears that I am not alone (thank God!).</p>\n<p style=\"text-align: justify;\">In my mind, I think I&#8217;m still about twenty-five years old but, when I video myself on my iPhone, hell, I look my age of fifty!</p>\n<p style=\"text-align: justify;\">I started looking into getting some cosmetic procedures done that might help me look a little younger or at least camera ready but, going through a bunch of plastic surgeries might one, make me look a little better but two, it could also make me look done.  And do to me means older!</p>\n<p style=\"text-align: justify;\">Even if I did do a bunch of stuff, how long would it last?  I&#8217;m getting older like I have to and then, will I be a slave to trying to look younger rather than enjoy my time aging?</p>\n<p style=\"text-align: justify;\">I would like to say that I&#8217;d like to do nothing and then enjoy my time aging. However, that&#8217;s not how society works now, is it?</p>\n<p style=\"text-align: justify;\">Women are not allowed to age, and this is one of the recent blog posts that I wrote about and, let&#8217;s face it if I were selling something, a younger version of me on video would probably be more successful.</p>\n<p style=\"text-align: justify;\">So, I have two points to this blog post, and one is, well about the topic of course, will I be okay in the end looking old just like everyone else? Or, will I try and delay it and run from it and, get plastic surgery along the way?</p>\n<p style=\"text-align: justify;\">Look at Jane Fonda and Raquel Welch; they look pretty good.  I don&#8217;t see a problem with them.  But, there comes a time of diminishing return meaning that no matter how much of what they do, the foundation is just not there anymore, and they will have to give in just like the rest of us. They begin to look their age only abnormally because those their age don&#8217;t look that way.</p>\n<p style=\"text-align: justify;\">People think that its gravity that makes them age, and so they get a facelift, and they think they look better and maybe, get a second one but, they also need to know that it&#8217;s our bones that are shrinking and not so much as our skin slipping down.</p>\n<p style=\"text-align: justify;\">You can verify this by seeing the way a person ages in their eyes.  We can nip, tuck, pull and, add volume but the eyes say it all.</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">In the end, we will all look old</span></h2>\n<p style=\"text-align: justify;\">It&#8217;s also the fact that we lose fat and tissue as we age and a lift doesn&#8217;t help this either.  Sure, we can get fillers, but then, we become a slave to them too.</p>\n<p style=\"text-align: justify;\">Of course, then some people will age faster than others due to lifestyle and genetics, but the reality is, we will all get there about the same time.  Is it really worth it to fight it?  I would hate a life where I was so preoccupied with fighting aging every day that one day I woke up and my life was never lived because I was so afraid to age.</p>\n<p style=\"text-align: justify;\">We are afraid because again, it&#8217;s not okay in our society but, we can&#8217;t be consumed by what society says is okay.  Women have enough pressure we certainly don&#8217;t need to have to become a slave to aging too.</p>\n<p style=\"text-align: justify;\">So my point here again (sorry, but if you read this blog you know that I am happily affected by ADHD) then I think one, I won&#8217;t run after the plastic surgery route (although I will get non invasive treatments) and two, I will go ahead and start creating video because I think that, if I don&#8217;t show the world how a woman is supposed to age then who will?</p>\n<p style=\"text-align: justify;\">Do you want to look and feel younger? Do this and have a life that will keep you happy and healthy for a lot longer than the average woman.</p>\n<p>&nbsp;</p>\n<h3 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">If you seriously want smoother skin then check out my &#8220;Smooth Skin&#8221; course where I will show you exactly how I get it.  No needles, fillers or surgeons needed here!</span></h3>\n<h3 style=\"text-align: center;\"><a href=\"https://how-to-get-smoother-skin.teachable.com\"><span style=\"color: #ff00ff;\">https://how-to-get-smoother-skin.teachable.com</span></a></h3>\n<div id=\"attachment_8358\" style=\"width: 310px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8358\" class=\"size-medium wp-image-8358\" src=\"https://myagingandwellness.com/wp-content/uploads/2018/08/How-to-get-old-and-be-happy-300x251.png\" alt=\"Smooth Skin Course\" width=\"300\" height=\"251\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2018/08/How-to-get-old-and-be-happy-300x251.png 300w, https://myagingandwellness.com/wp-content/uploads/2018/08/How-to-get-old-and-be-happy-768x644.png 768w, https://myagingandwellness.com/wp-content/uploads/2018/08/How-to-get-old-and-be-happy-624x523.png 624w, https://myagingandwellness.com/wp-content/uploads/2018/08/How-to-get-old-and-be-happy-600x503.png 600w, https://myagingandwellness.com/wp-content/uploads/2018/08/How-to-get-old-and-be-happy.png 940w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><p id=\"caption-attachment-8358\" class=\"wp-caption-text\">How to get smooth skin without a doctor!</p></div>\n<h3 style=\"text-align: center;\"></h3>\n<p>&nbsp;</p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"57c1535b-3bc3-517f-86a3-926035cc63d6"}}