{"data":{"wordpressPost":{"title":"Where Women Go As We Age","content":"<p>Where Women Go As We Age</p>\n<p>What are we waiting for? We can’t wait for the future to happen and we certainly can’t live in the past. In middle age and beyond, we have to come to terms with the fact that our choices have changed.</p>\n<p>For some, the changes may not be good, for others, aging is a time when we can do the things we have only dreamed of.</p>\n<p>I am inspired by Diana Nyad, the first women to ever swim to Florida from Cuba without a cage. This is extremely inspiring because she was a sixty-four-year-old woman!</p>\n<p>I am impressed because I know a few sixty-year-olds who believe they can’t park too far away from the grocery store doors because they don’t want to walk that far, let alone, swim for fifty-three hours and one hundred and ten miles.</p>\n<p>Did I mention this was her fifth attempt? Just goes to show you that we are never too old and to never stop trying no matter what. She made her first attempt when she was twenty-eight, and then in 2011, she tried three times at the age of sixty-two, and again at sixty-three.</p>\n<p>When she finally accomplished the swim on September 2, 2013, she had three messages for us all: one, we should never, ever give up, two, <u>you&#8217;re never too old to chase your dreams,</u> and three, it looks like a solitary sport, but it is a team.</p>\n<p>Doesn’t that sum up what we women are going through right now? Never give up on yourself, no matter what age you are. Enjoy your life, love yourself, and do what it is that feeds your soul. It’s never too late to achieve and live your own personal dream. Just have the belief and do away with the fear.</p>\n<p>Remember, large or small, your dream belongs to you, and it’s just as important as anyone else’s. We are all living our own dream and we can create a new one if we don’t like the one we are in.</p>\n<p>Finally, you are never alone. It takes a team, meaning your friends, your family, your spouse, and your faith, especially faith in yourself. Whatever it is around you that lifts you and inspires you is what you are meant to be. It is important to always be mindful, moreover, keep an open mind.</p>\n<p>You never know when the universe is offering you a gift, and if you are not awake, then you will miss opportunities and the energy will go elsewhere.</p>\n<p>Too many times we get up, go to work, come home and then go to bed without taking even one second to appreciate the gift of life and what is has to offer us. For those of us who ask why are we here? The quick answer is to take a look around and embrace the gift of life.</p>\n<p>The experience of being born may be the only reason we are here. We don’t need to create chaos trying to make a bigger meaning than necessary, otherwise we waste the time we have. Sure it’s great if you are able to leave a legacy, but even if you don’t, its okay too.</p>\n<p>The only wasted life, is a life not lived fully. What does fully mean to you? If we embrace the experience of life without thinking there is an attachment, then we are living a life that is meant to be and, therefore, we receive the blessings that come with it.</p>\n<p>The one day I will get there is now, and it’s a fork, and you must take the right path that makes you happy.</p>\n<p>Our culture teaches us that we won’t ever get there; therefore, we are in a constant state of searching and wondering what’s next. I hope you realize your unique beauty, and find the energy within right now, this moment. Every second counts.</p>\n<p>This day too will pass and you will never get it back. Whatever holds you back now, you will look back in three or four years and realize how fantastic you really were. You will question why you stayed in certain states of mind, relationships, jobs or whatever held you back in the past.</p>\n<p>As we get older, we tend to think we are more tired, especially women, because we are still thinking we can do it all. There are two kinds of energy. One is when you are tired and don’t feel like doing anything. You may feel a bit down on yourself; you decide you don’t have any energy to engage in life.</p>\n<p>This energy level is the one when you haven’t slept or you need to eat, so you do and you get your energy back. The second energy level is when you have slept, eaten and still, you have no energy to enjoy life or to engage with others. Perhaps dare I say the word depressed? If you ate more or slept more, you would not find your energy in this state.</p>\n<p>However, if suddenly your lottery ticket won or your soul mate came into your life in an instant, you would find your energy! This is the kind of energy you should strive to tap into. Wake up as though you have won the lottery of life, and you love yourself enough, more than anyone else could ever. You have the energy to live with excitement, just remove the negativity that is draining it.</p>\n<p>We need to live in real moments in time. There is a book called <em>Real Moments</em> by Barbara De Angelis. If you take your life and your minutes for granted, then you should read this book. It will not only show you how to feel the sun on your face and the wind in your hair, it will show you how to live like you should before you die and actually feel like you live in the moment.</p>\n<p>I know this may sound like a circular question, but there is a difference between going through the motions and living in the moment. When you actually live in the moment, time seems to stand still and you feel every experience and sensation happening in that moment. You owe it to yourself to live this way.</p>\n<p style=\"text-align: center;\"><em>Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</em></p>\n<p style=\"text-align: center;\"><em>steps you can feel amazing without depriving your self!  Click the link below:</em></p>\n<p style=\"text-align: center;\"><em>THE REJUVENATION AND RENEWAL PLAN</em></p>\n<p style=\"text-align: center;\"><em><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</a></em></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/0d1263856e56d138f4bbda35954e8bc3/1a478/14786922_m-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"8fe82bd0-efdc-5f4a-8ad9-e09fdaa15e38"}}