{"data":{"wordpressPost":{"title":"The fear of aging","content":"<h2 style=\"text-align: justify;\">The fear of aging</h2>\n<p style=\"text-align: justify;\">How will I handle being old? All of my life, I felt good about myself and how I looked. I definitely wasn’t a beautiful girl, but I think I got better looking as I got older. I know it’s only a matter of time before I will look in the mirror and see my old self. Who knows, I may already be there. However, I know my reflection does not define who I am. I am coming to terms with my ever-changing self.</p>\n<p style=\"text-align: justify;\">It’s scary getting older. Maybe it’s not so much the superficial part of aging, but it’s the fear of the unknown. My body is changing, my kids have moved on, my mother is elderly, and I wonder how much longer I will be here. Will I be stricken with an illness that I cannot overcome like I could when I was younger? I know we will all die but, how will I die, I wonder.</p>\n<p style=\"text-align: justify;\">Will my partner leave me for a younger woman? Will age discrimination show its ugly face to me? And all the while as I enjoyed being young, I told myself I would never get old. I remember, when I was a kid, I literally thought I would never get old. So many things go through my head when I think about the journey of my aging self. I suppose I could take my ego out of the situation and just let the experience happen, because fear is only part of our ego. Why not just do it, I ask myself? Yet, there is nothing I can do to stop aging as we are all going to age, and no matter how much I kick and scream, I too will have to age; and all the makeup and the creams will not stop it, no matter how much I put on.</p>\n<p style=\"text-align: justify;\">How many times have you seen older women who are stunningly beautiful for their age? Is the key phrase here “for their age?” Why can’t we just be absolutely beautiful no matter what age we are? We see movie stars like Jane Fonda, Raquel Welch, and Sofia Loren and think, “Wow, these women are absolutely stunning; I want to look like that when I get old.” But there are two problems with this statement: The first is, they didn’t age naturally, and they had a lot of help, and I mean a lot. There’s nothing wrong with getting help, but where are all the real examples of beautifully aging women? There are some celebrities, like Diane Keaton, Michelle Pfeiffer and several others, who are beginning to balk at the need to have cosmetic surgery, and it’s refreshing to see what real aging should look like. It’s a beautiful thing that they are willing to do this in today’s culture. Sad to say though, as they get much older, they usually quietly cave-in to what society demands of women, and that is to remain youthful or just disappear.</p>\n<p style=\"text-align: justify;\"><strong><em>If you would like to know how you can really look ten years younger doing 5 things a day, download my PDF below:</em></strong></p>\n<p style=\"text-align: justify;\"><a href=\"https://theresaskrobanek.leadpages.co/the-5-huge-mistakes\">https://theresaskrobanek.leadpages.co/the-5-huge-mistakes-/</a></p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n<p style=\"text-align: justify;\">\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/534aa6aa4a40ccffe01ced8cc2c081af/1a478/invisible-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"cec21a23-59a7-5e60-bc80-c79c486de747"}}