{"data":{"wordpressPost":{"title":"LETTING GO OF EMOTIONAL PAIN","content":"<p style=\"text-align: center;\">LETTING GO OF EMOTIONAL PAIN</p>\n<p style=\"text-align: justify;\">Sometimes our hearts are weak and our spirits are broken, but, still, we get up and go about the day and push down the pain. Maybe we were born with spiritual pain or we have unresolved issues that we haven’t let go of and we hold them inside not knowing how to let go. Some believe in past lives and that we are born with pain and this pain is punishment from a past life.</p>\n<p style=\"text-align: justify;\">For those who are Christian, they don’t believe this, but believe that we can remove the pain by giving it to God. Give it to something or someone and let it go if you have it. It’s not worth holding on to. Without being mindful, we hold on to pain so tight that it leaves us exhausted.</p>\n<p style=\"text-align: justify;\">Most of the pain is only in our minds and it is a dialogue we have with ourselves. I am not saying things didn’t happen to you in your past. Maybe you can’t even remember or pin point anything. I couldn’t imagine some of the circumstances people have gone through and are still able to live each day.</p>\n<p style=\"text-align: justify;\">I have had hardships, but I am blessed that my pain is not as deep as other’s pain. All pain needs to be let go of, though. The point here is to give yourself the gift of seeking out help to rid yourself if you are in pain. Start fresh again, even if for only once in your life. Make the choice to be free.</p>\n<p style=\"text-align: justify;\">We don’t understand how much we suffer and, conversely, we don’t know what it is like not to suffer. We expose ourselves to our pain by virtue of being in pain in the first place. We are constantly thinking about the pain of the past, the present and the pain we will endure in the future. We don’t know we are in pain most of the time, however, we feel it but don’t recognize it until we have a problem and it affects our behavior. We constantly talk inside our heads continuously doubting everything and this is causing us to suffer. Having to think about yourself all the time creates pain and suffering.</p>\n<p style=\"text-align: justify;\">The reason we think about ourselves all the time is because we haven’t been okay for a long time. Listen to your pain; it’s telling you something, telling you that you must do something about it. The problem is we feel it but we don’t acknowledge it. Just like a broken leg tells you it’s broken, your spirit also tells you it’s broken too.</p>\n<p style=\"text-align: justify;\">The pain that we carry around could be minimal or it could be monumental. I have heard that what doesn’t kill us, makes us stronger, and that suffering causes greatness. I don’t necessarily believe this as I believe it leaves pain wounds in our soul and, unless we intentionally choose to heal it, we have a problem.</p>\n<p style=\"text-align: justify;\">Most of us think we are healing our pain by getting better at handling it. To solve your inner problems is to quit letting your mind mislead you. I don’t think time heals all wounds either. Time makes them a little easier to take, but we all know if we let ourselves go there, we can bring back the pain like it was day one. How we do this is by holding in that exact memory of when we first arrived at the pain. We can go back there again and again if we let ourselves.</p>\n<p style=\"text-align: justify;\">When we think no one will love us and we are alone, or we will always be alone or there will never be someone for us, we are dealing with our minds inner dilemma. When we do find someone and the relationship doesn’t solve the issues that we have, we have an inner disturbance. We realize the void is still within us and then we move onto something else, because the pain is always there. But the real problem is we take our baggage wherever we go and we want to give it to someone else to carry, all the while picking up more as we go along.</p>\n<p style=\"text-align: justify;\">Freeing ourselves from pain is a matter of unloading the memory and detaching the connection we have to it and then allowing it to diminish. It will take time and it will take a conscious effort to do it, but it can be done. If you have lost a loved one, you will have pain. In time it will get better. You will always have the good memories.</p>\n<p style=\"text-align: justify;\">We have to address the source of our pain and not just cover it up or hide behind it. What if you did find a person or something that got rid of your pain? Have you really succeeded in solving the problem?</p>\n<p style=\"text-align: justify;\">Nope, you just failed because you found something to delay or distract you, maybe a relationship in this case, in which you believe the other person will fix all your problems, or you’ll be okay as long as they are with you. Heck, you no longer believe you have any problems. You will see that you are still tormented as long as your inner stuff is not resolved.</p>\n<p style=\"text-align: justify;\">The only way to resolve this inner conflict is to get out of it. Get out of your head and get out of your way. Let it go and remind yourself to listen to the addiction that your mind has created by staying in this place.</p>\n<p style=\"text-align: justify;\">Stop and don’t get involved in your mind’s inner thoughts. Your mind is only playing games with you and you are going along with it. Be persistent in staying focused on not letting your mind tell you how bad things are.</p>\n<p style=\"text-align: justify;\">You must stop it the second it starts talking. Don’t let a little reminder make a shift in your body telling your mind that you are about to go to the inner nagging again. Stop it before it starts. Be aware and don’t let your mind talk; only allow your mind to talk when you ask it a question and only ask when necessary.</p>\n<p style=\"text-align: justify;\">The price of freedom from the pain is peace; therefore, we have to change. Change means we have to challenge what we know and what we are comfortable with. The key here is comfort. We are too comfortable with our disturbances, and thinking about change feels even more painful than staying where we are.</p>\n<p style=\"text-align: justify;\">After all, we know the feeling and we are comfortable, even if it hurts. But, how do you know that change will be painful? What if it is a much better life and you don’t take the steps to get there because you are too afraid? How will you ever know about the life you could have if you don’t step over the line and try it? There are no boundaries that we must live in, just the ones we create.</p>\n<p style=\"text-align: justify;\">Real growth means dealing with the discomfort, like it or not. Many times the actions we take are to avoid something. Stop avoiding and don’t let issues upset you. If you are avoiding pain and you encounter what you can’t avoid, then walk along side of it until it passes. And, if you do nothing else, don’t take things personally. Much of what goes on around you has absolutely nothing to do with you.</p>\n<p style=\"text-align: justify;\">Take care of yourself 🙂</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"d18fdd7a-3fde-553e-a8af-c11b92b80767"}}