{"data":{"wordpressPost":{"title":"Don&#8217;t worry.  Be happy!","content":"<p>&nbsp;</p>\n<p style=\"text-align: center;\">There’s no cure for growing old, but it’s our attitude that changes everything.</p>\n<p style=\"text-align: center;\">~Huffington Post</p>\n<p style=\"text-align: justify;\">     I wasn’t sure if I wanted to write this, because I tend to generalize, and what I worry about may not be what others worry about. Let me start by saying, I try not to worry at all because, one, worrying causes wrinkles, and two, worrying gets you nowhere.</p>\n<p style=\"text-align: justify;\">&#8216;As Dr. Phil says, “Worrying is like chewing gum in a rocking chair trying to solve an algebra problem.” It is just a waste of time and doesn’t get us anywhere. If we are not careful, worrying can turn into a hobby or, worse, an addiction.</p>\n<p style=\"text-align: justify;\"><span style=\"font-size: 0.95em; line-height: 1.6em;\">    I know this because my mother worries even when she doesn’t have anything to worry about. She has done this for almost seventy years, so why stop now? She doesn’t know any other way to live and, unfortunately, she doesn’t have the will or the desire to change. She is comfortable in her worries. It’s become her friend.</span></p>\n<p style=\"text-align: justify;\">I decided I wouldn’t be like my mother and, every time I thought about something that might cause me to worry, I would replace the fear with a positive thought. Eventually, I broke the habit that I had learned growing up.</p>\n<p style=\"text-align: justify;\">It helps me to have a partner who is the complete opposite. He doesn’t allow me to think about the things I cannot change. He doesn’t want to hear it. He says worrying is making excuses.</p>\n<p style=\"text-align: justify;\">There was a time I’d get really mad at him because he never wanted to hear me go on and on with my latest worry or story I had to tell. I mean, I wanted to complain and make assumptions about the world, and he wanted no part of it.</p>\n<p style=\"text-align: justify;\">Worrying about things that we cannot change comes from the fear of what we cannot control. Once we understand that we can’t control anything, and we let it pass through us, we can break this cycle. When I can’t let something pass through me because I am so fixated on it, and nothing I do allows it to pass through me, I decide to step back and, like a bullet, let it fly in front of me and dodge it.</p>\n<p style=\"text-align: justify;\">Sometimes it’s hard to get something out of our minds that we remain anxious about, so it then becomes comfortable. Don’t get comfortable in worrying. Don’t look for or allow things to occupy your mind 24/7.</p>\n<p style=\"text-align: justify;\">We are all going to die and everything else in between doesn’t really matter. Worrying is just stories we keep telling ourselves over and over. Don’t talk to your mind when it’s like this, it’s just trying to keep itself busy by occupying your spirit. Trust me, you have better things to do with your time.</p>\n<p style=\"text-align: justify;\">If we put the burden of worrying aside, and go about doing the stuff we are meant to do, just think how much we can accomplish in our lives. So much time is wasted on worrying.</p>\n<p style=\"text-align: justify;\">If you are a woman who worries, it’s wise to stop the cycle, because worry turns into anxiety and then your life gets out of control. Right now, we have to be in control. There will always be things we can’t control, and we simply have to accept them and move on. If something catastrophic does happen, just wait it out, it too shall pass.</p>\n<p style=\"text-align: justify;\">Truth be told, as we age, a lot will begin to go wrong all around us. There will always be another problem, crisis or issue. And it’s how we respond those problems and issues that will free us from worry. Don’t look for or wait for things to happen. Bad things will happen and, we create what we fear.</p>\n<p style=\"text-align: justify;\">There will be deaths, divorce, sickness and other terrible events, so accept them and deal with them as best you can and then move on. We can’t change or stop what is meant to be. We can’t blame ourselves for circumstances that happen, either.</p>\n<p style=\"text-align: justify;\">Women tend to blame themselves for bad things that happen, either to them or to those they love. I know I blamed myself when my kids weren’t happy, when my brother died, and when my beloved dog died. I thought if I could have been a better mother, sister and dog owner, things would have been better.</p>\n<p style=\"text-align: justify;\">I realize now that my kids and other people choose their own happiness. Disease will overtake people and dogs, and they will die, just like I am meant to. It’s no one’s fault, just God’s will. Don’t think you can change destiny. You are not God, so don’t try to take on the role and just be you, the one and only, unique you and don&#8217;t worry.</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/9f63568f0debbab9fdd2aa709e2c043e/1a478/35345422_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"dfaa2ba9-9510-5b37-8422-5e10a3d815bb"}}