{"data":{"wordpressPost":{"title":"Born for What? Part #3 My final","content":"<p style=\"text-align: justify;\">Born for What? Part #3 My final</p>\n<p style=\"text-align: justify;\">We are humans with brains, and if one person can create a distinct­ life, then shouldn’t another human being be able to do the same? Why then do some people live in the depths of hell never to rise up, to know anything else?</p>\n<p style=\"text-align: justify;\">Life is peculiar­­ sometimes, and, again, one has to wonder if everything is prearranged and we really don’t have any control of who we are or where we will go.</p>\n<p style=\"text-align: justify;\">We may think we do by staying busy or getting on with life, but are we really just passing the time instead? Maybe God wanted us all to do something different and what we are doing is exactly what we were put here to do and nothing more.</p>\n<p style=\"text-align: justify;\">For some reason I think there is more to this because humans are miracles in and of themselves and, like Stephen Hawking, are we doing all we can with the miracle we were given?</p>\n<p style=\"text-align: justify;\">The answer I come up with as to why we don’t become all that we can be is because of fear. I will say that Stephen Hawking has a genius mind that puts most of us at a disadvantage (doesn’t seem right to use that word when we are talking about the horrific nature of living with ALS), however, even with a genius mind, conversely, many of us who have abled bodies and intelligent minds don’t do more than what is necessary.</p>\n<p style=\"text-align: justify;\">Stephen Hawking used his mind to overshadow his disability and not the reverse. Many of us don’t do more than we are capable of, and it’s more than just being lazy, it’s that we are afraid of something, something we don’t want to confront so that we can live in a comfort zone, or, even worse, uncomfortably because it’s more painful to try to move beyond it.</p>\n<p style=\"text-align: justify;\">Fear is the reason we are not all that we can be. Somewhere along the way, for those of us who are lost, fear was the beginning element in our journey that brought us here. We stay in many situations because of fear, and humans will do more to avoid pain than they will to gain pleasure.  We dream about the life we want but it&#8217;s sometimes too painful to have.</p>\n<p style=\"text-align: justify;\">Do we get off track and become lost souls, while our fate and inner being should be moving another way, the predestined way created by our higher power? Do our outer personalities want something different, thus the reason we lose our way? Which one is right? In other words, are we fighting a losing battle when we are lost?</p>\n<p style=\"text-align: justify;\">My cousin and I talked the other day about how concerned we both were about her brother. He was leaving weird messages for my cousin and his daughter and me. His comments were bizarre. Though he may have some kind of mental illness, undiagnosed but clearly realized by others, he was managing himself okay.</p>\n<p style=\"text-align: justify;\">He had a job and some sort of relationship with others. But he was still struggling with life, the kind of struggles that I don’t understand, but which others and I can see.</p>\n<p style=\"text-align: justify;\">The kind of struggles where you quietly ask yourself, <em>Why does this person continue to make life hard on himself? Why doesn’t he just make the right choice and life would be easy?</em></p>\n<p style=\"text-align: justify;\">I wonder why it’s so hard for those who struggle to exist, who remain lost, to live a life without suffering, to merely make the right choice, the choices I would make to stop the suffering, and the ones I see so clearly in front of me.</p>\n<p style=\"text-align: justify;\">I have come to realize that my cousin can’t see the easy choice in front of him, because it’s not so easy at all. Those who may be lost don’t see any choices at all. The only choice they see is the one that keeps them suffering like a perpetual hell they can’t escape from.</p>\n<p style=\"text-align: justify;\">For them, they have no choice but the choice to wake up and suffer each day like the one before. Do they want to agonize and endure a life of pain and punishment? I don’t think so; who would want pain and suffering?</p>\n<p style=\"text-align: justify;\">Those who are lost create a painful life for themselves and maybe it’s so they can feel at least something. They may procrastinate, resist, lash out and create chaos as a protection method to stay and justify where they are. They are comfortable being uncomfortable; it’s all they know. The un-comfort ability of being in agony has now become their security. The unknown is more painful.</p>\n<p style=\"text-align: justify;\">I am tired of seeing people who are lost in this world because it hurts my heart, especially when I can’t help them. People who are born into and go through life with one bad situation after another only to suffer and never see, feel or realize any happiness is a sad thing to watch.</p>\n<p style=\"text-align: justify;\">It’s as though the world is a holding pattern for them until they get to the next one. It’s even as though they were accidentally born before their time, therefore, they need to wait this life out in order to cross through and make the transition to do it again only, hopefully, the next one will be a more kind one.</p>\n<p style=\"text-align: justify;\">I am hoping this was the case for my brother Chris. I hope he is happy now and I hope his body is perfect. I hope he is smiling now. I know I am not supposed to say that someone who was born wasn’t meant to be born, that’s just silly.</p>\n<p style=\"text-align: justify;\">Every soul is important, especially one that had the chance to fight to be born. But is this really true? If this were true, why do we see so much suffering? Is suffering just a thought process, meaning, I am not suffering in my life because I made a choice not to? Are we a product of ourselves, but blame our circumstances.</p>\n<p style=\"text-align: justify;\">I know my cousin wants to be loved and I know he wants to be included, but he can’t because every time he is loved and included, he sabotages himself by not respecting those around him, and then others alienate him, therefore casting him back into his dark world.</p>\n<p style=\"text-align: justify;\">At this point, he believes it’s others who have the problem and that no one likes or cares about him. What he doesn’t understand is that others do want to include him in their lives but he makes it impossible to the point where, unless those around him want to be miserable, they back away and stay in a place where they can grow, even if he doesn’t want to.</p>\n<p style=\"text-align: justify;\">Really, I don’t think he knows or even thinks he is damaging his relationships with others through his words and his actions. To him, he is just himself and, because of this, it’s everyone else who has a problem.</p>\n<p style=\"text-align: justify;\">In his world, he is the victim and lives in the victim world. He knows nothing different; therefore he is alone with himself while others avoid him. He is now isolated and lonely and he blames others for what they do to him, the past, the future and for whatever is not creating congruence in his life.</p>\n<p style=\"text-align: justify;\">He knows no different and has no tools to be anyone other than himself, the self that no one understands, and not even he does. We all know these types of personalities. They are not bad people whatsoever; they just don’t have the tools, may never have the tools or will not accept the tools to see another way of looking at the world other than their own way.</p>\n<p style=\"text-align: justify;\">There are many among us who are not so blessed in life. Even those who have a privileged life can be eluded by events and circumstances in life. Sometimes the delusion is our own self-doing, or maybe it’s something beyond what we can see or comprehend.</p>\n<p style=\"text-align: justify;\">We may be born into money, have highly intelligent parents, we can even be extremely intelligent ourselves, however, there is a pulling force from somewhere in the cosmos, somewhere in Karma, maybe somewhere from a past life, whatever it may be or, whatever we may call it, and that something takes a certain percentage of us away and sucks us into a life of eternal defeat and darkness, even if it is in our own minds.</p>\n<p style=\"text-align: justify;\">Some of us hide behind things to avoid suffering by creating an illusion in life and we choose never to see the truth, we just exist in life. But, to merely exist is living a life without existence.</p>\n<p style=\"text-align: justify;\">By the way, the picture along with this blog post is my little brother Chris who died last June at the age of 44 and on his birthday.  He walked this earth very much depressed and alone and, in the end, I guess God decided he shouldn&#8217;t suffer anymore.</p>\n<p style=\"text-align: justify;\">I talked to him the day before,  I gave him a long hug and told him I loved him.  He died in his sleep that night.  When I got the call, although I had some peace that he wasn&#8217;t suffering with lonliness and spiritual pain anymore, I still closed my eyes and wish he&#8217;d had a better life while he was here.</p>\n<p style=\"text-align: justify;\">Peace 🙂 Thank you for reading my three part blog post on &#8220;Born for What&#8221;</p>\n<p style=\"margin: 9.6pt 0in; text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"d0bb3c45-d8aa-5367-b33f-e947a104528f"}}