{"data":{"wordpressPost":{"title":"Nuface toning review","content":"<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Nuface toning review</span></h2>\n<p><iframe width=\"625\" height=\"352\" src=\"https://www.youtube.com/embed/YlsvxgPF31E?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<h3><span style=\"color: #ff00ff;\">If you decide that you want to try it, here is my affiliate link through amazon.com.  Feel free to purchase it anywhere you like too 😀</span></h3>\n<p style=\"text-align: center;\"><strong><span style=\"color: #ff0000;\"><a style=\"color: #ff0000;\" href=\"https://amzn.to/2SsGtYC\">https://amzn.to/2SsGtYC</a></span></strong></p>\n<p>&nbsp;</p>\n<div id=\"attachment_8618\" style=\"width: 310px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8618\" class=\"size-medium wp-image-8618\" src=\"https://myagingandwellness.com/wp-content/uploads/2018/12/Screen-Shot-2018-12-06-at-3.12.55-PM-300x237.png\" alt=\"Nuface toning review\" width=\"300\" height=\"237\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2018/12/Screen-Shot-2018-12-06-at-3.12.55-PM-300x237.png 300w, https://myagingandwellness.com/wp-content/uploads/2018/12/Screen-Shot-2018-12-06-at-3.12.55-PM-768x606.png 768w, https://myagingandwellness.com/wp-content/uploads/2018/12/Screen-Shot-2018-12-06-at-3.12.55-PM-624x492.png 624w, https://myagingandwellness.com/wp-content/uploads/2018/12/Screen-Shot-2018-12-06-at-3.12.55-PM-600x473.png 600w, https://myagingandwellness.com/wp-content/uploads/2018/12/Screen-Shot-2018-12-06-at-3.12.55-PM.png 1002w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><p id=\"caption-attachment-8618\" class=\"wp-caption-text\"><a href=\"https://amzn.to/2SsGtYC\">Nuface toning review</a></p></div>\n<p>&nbsp;</p>\n<h1 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Nuface Toning Review</span></h1>\n<p>I&#8217;m having a bit of a bad hair day, I don&#8217;t know what&#8217;s going on, it looked good when I put it up, but it&#8217;s just going crazy. I have really thin hair, so it never stays up when I put it up. But I want to show you my latest and greatest little product that I&#8217;ve been using. It&#8217;s called the Gold Trinity by Nuface, and this is a really popular thing right now.</p>\n<p>What it is, it&#8217;s a micro-current, and it sends currents to our muscles and blood and gets it to be toned, and it says that your face is 85% more toned by using it, 80% smoother.</p>\n<p>Let&#8217;s see, so anyway, I&#8217;m really bad about not reading all the directions before I do these videos, I just do them on the fly, so I apologize for that. I&#8217;m learning as I&#8217;m doing this video myself. But I&#8217;ve been using this for about a month, I always say that you need to use things for at least a month before you really can review them, right?</p>\n<p>So this is, like a said, a micro-current, and it brings blood to your face. And it comes like this, you can buy it in different colors, and things like this, but one thing I wanted to warn you if you&#8217;re going to use this, is there&#8217;s a lot of fake ones out there. And I hate to say it, but on eBay, they have a lot of fake ones. And the way you can tell if they&#8217;re fake or not is, see underneath here you see the little square that you go ahead and plug into your little charger? The fake ones, they&#8217;re slanted, they&#8217;re completely fake, and when you see those, you&#8217;ve bought a fake one.</p>\n<p>And then you&#8217;re like, &#8220;Well then how do I know it&#8217;s fake? I have to buy it to find out if it&#8217;s fake.&#8221; If I were you I would buy this at the Dermstore, my link is going to be here, and I&#8217;ll have legitimate products here for you too.</p>\n<p>I was watching a girl on YouTube and she bought a fake one, and it cost her three-hundred-and-something dollars, so you don&#8217;t want to do that, I&#8217;m sure. So, again, you want the ones that have the little squares, and they&#8217;re not slanted. When they&#8217;re slanted you know they&#8217;re fake.</p>\n<p>So this comes in this box right here, if you order this one, you get a gel primer, you&#8217;ll use this primer on your face before you do your machine. And I&#8217;ll show you that in a minute. And then it comes with these prep pads, and these are awesome, they&#8217;re little individual washcloths, and they&#8217;ve got bead texture on them, so when you use them on your face it really exfoliates your face.</p>\n<p>I love them, I love them, when I go on trips and travel a lot, which I do, I take them, and it works amazing. And they give you a little pouch to put your thing in, but you know what? I couldn&#8217;t get it in there, I don&#8217;t know, maybe I&#8217;m not using it for the right thing.</p>\n<p>So again, you get this Nuface Trinity Toner, and you get the gel, and you get the little wipey, and you get the carrying case, and again, this is for micro &#8230; and I&#8217;m going to kick myself for doing this again, it&#8217;s a micro-current, I don&#8217;t know why I&#8217;m saying micronutrients, maybe I&#8217;m hungry! I am hungry.</p>\n<p>So anyway, you&#8217;re going to charge this little baby, and then you&#8217;re going to use it at night. And you&#8217;re going to put your primer gel, your gold kind of gel on there, it&#8217;s a clear gel, and then you&#8217;re going to start here, you&#8217;re going to turn your machine on, and it&#8217;ll make a little noise.</p>\n<p>And I always do everything extreme, so I do it all the way to the highest level. And then on a clean face, with your gel, you&#8217;re just going to put it here, and you can feel the little current. And it&#8217;ll beep, it&#8217;ll tell you to move it. And you just continue, continue, continue. And I don&#8217;t have any gel on, and so I can really, really feel it. And it&#8217;s just like little bits of little teeny shocks.</p>\n<p>If I had the gel on there it would keep the pain off, or whatever, it&#8217;s not really painful, it&#8217;ll just keep that sensation from going away.</p>\n<p>So anyway, you just keep using it all over your face and then use it on your neck and your chest and everything. The only thing I have a problem with using these kinds of machines, it takes a long time.</p>\n<p>You can sit there and do it when you&#8217;re watching TV and everything, and then hopefully you&#8217;ve moved it around and got it all in the right places, and you&#8217;ve done everything. You especially want to get up here and pull up your eyebrows, I can really feel that without the primer. And you just want to do that until it blinks. But it takes a long time if I do my face and my neck and my chest, it takes a good 15 minutes.</p>\n<p>Now on top of that, I do a couple other things, so when I do my wind-down routine at night, it takes a long time. And sometimes I don&#8217;t always feel like doing it. So for these products to work consistently you have to do them consistently, every night. So if you are committed to 15 minutes, at least, to do this, it actually does work.</p>\n<p>I used to use this before when they first came out, it was a wand, and it was probably about eight years ago. And I liked it, I misplaced it, so now two months ago I bought this actually. And I like it, it tones my jaw, and I like the fact that I can do it around my eyes and it lifts my eyebrows up. And I like to do it around my cheeks, especially, because it lifts that. And then I like to go in here because I think it builds collagen in these little lines and folds right here.</p>\n<p>So again, I just wanted to show you this Nuface little machine or little gadget, it&#8217;s pretty good. And if you have the time, and you&#8217;re committed for 15 minutes at least a night, and you&#8217;re consistent, this is well worth it.</p>\n<p>I have a link, or you can go on Amazon, or you can go to the Dermstore, and you can get it. Or I think they have it at Ulta and Sephora. I think I paid $325 for it, yes I did. So $325 &#8230; And I think I just broke it. Hopefully, I didn&#8217;t just break it. But I think you can get these on sale sometimes, like 20% off, you&#8217;re just going to have to look for coupons on Google and things like that.</p>\n<p>So again, I would give this product a thumbs up, because it actually works if you&#8217;re consistent with it. So thanks for watching, and thanks for watching all flaws, and I hope that I didn&#8217;t just break this $325 machine, because it would not be the first time that I&#8217;ve done that. So thanks for watching, I&#8217;ll talk to you next time 😀</p>\n<p>&nbsp;</p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/e3282291eef30e04b9ebabf3a34f0029/c0005/Screen-Shot-2018-12-06-at-3.19.09-PM.png","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"b5c57e04-9917-5172-9247-814722cef667"}}