{"data":{"wordpressPost":{"title":"Making peace with aging","content":"<h3 style=\"text-align: justify;\"><em>MAKING PEACE WITH AGING</em></h3>\n<p style=\"text-align: justify;\"><em> </em></p>\n<p style=\"text-align: justify;\">Making peace with aging, Hmmm? How does a woman make peace with aging in a culture obsessed with youth?</p>\n<p style=\"text-align: justify;\">It doesn’t matter what age we are, the issue may change but the focus on aging remains the same. And that focus is how to keep a youthful appearance, stay healthy and remain active.</p>\n<p style=\"text-align: justify;\">It’s great for an aging woman to center around taking care of herself, but it’s another matter to obsess about getting old, and, yet, at some point we all do it. I guess you could say I’m lucky because my appearance was never stunning, but I felt beautiful anyways.</p>\n<p style=\"text-align: justify;\">I can age graciously by making peace with aging because I was, and still am, an ordinary woman, and that’s okay. It’s the beautiful women I feel for because they seem to be the people having the hardest time with aging.</p>\n<p style=\"text-align: justify;\">I really believe when you are ordinary looking like myself, you age more lovely than when you have already reached your peak. However, all women get to the same place eventually, and there is no escaping it. But beauty is all relative anyway.</p>\n<p style=\"text-align: justify;\">Sure, I look back at pictures and see my taught skin, my shapely body, my vibrant eyes and the youth that I didn’t appreciate, and I am reminded again how fast life really goes by. With this reminder, I gain a moment of happiness because I also realize I am healthy, happy and look relatively good for my age.</p>\n<p style=\"text-align: justify;\">I know life could be worse, so I don’t dwell on the past or question what God has given me. It won’t change where I am today or where I will be tomorrow. It would be wise to make peace with aging sooner than later just in case there is a little more work to do down the road.</p>\n<p style=\"text-align: justify;\">Life is a creation in progress, and it shouldn’t be that we are looking and waiting for the end, because that could come for anyone on any day. As we all know, there are no guarantees that we will have another day beyond this one.</p>\n<p style=\"text-align: justify;\">I have heard it said that, if you don’t feel old by the time you hit fifty, you soon will. If we live long enough, half of our lives will be spent as older women. I have never thought about it like this before. When I was young, I said I wanted to live forever!</p>\n<p style=\"text-align: justify;\">Now, I just want to live a good life and be happy while I am here. I don’t think the answer to getting old is lying about our age, either. Some women add a few years to their age when asked, so that others might say they look good for their age.</p>\n<p style=\"text-align: justify;\">How can this make us feel good because we, if no one else, still know how old we really are? Don’t fall into the trap of being afraid to tell your age. Just making it another year is a miracle at any age, young or old.</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/343c5103459020ac49c5708a1ad27972/1a478/39808977_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"fc0ad230-fc4a-552f-98be-cdb2c86d8086"}}