{"data":{"wordpressPost":{"title":"Revitalash vs. Latisse for growing longer eyelashes","content":"<p>&nbsp;</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Revitalash vs. Latisse for growing lashes</span></h2>\n<p>&nbsp;</p>\n<p><iframe width=\"625\" height=\"352\" src=\"https://www.youtube.com/embed/4gJvRcUdPJI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></p>\n<p>&nbsp;</p>\n<p>Hi everyone. I&#8217;m here to talk to you about getting longer eyelashes. I would love to have lash extensions. I&#8217;ve actually tried them a few times but I found that they&#8217;re too much maintenance.</p>\n<p>I can&#8217;t handle them and I do not have the patience to go lay on a bed for two hours every few weeks to get them done so I went ahead and I tried Revitalash and it works pretty well. It&#8217;s about $49, you can get it at Sephora, Bed Bath and Beyond and at, Ulta.</p>\n<p>Then I thought if I&#8217;m gonna go all the way and really try and get my eyelashes to grow I&#8217;m going to go ahead and try Latisse.&#8221;</p>\n<p>Latisse is a prescription that you get from your dermatologist or doctor and you put it on your eyes every night and it makes your eyelashes grow.</p>\n<p>It comes with individual little brushes and you just take the little bottle that they give you and you use one brush and you only one drop. You want to put it inside of the white line of your eye, not on the top but inside because it works better when you do that. As you blink, it will go to the bottom and you want to do both sides. Then you want to toss your disposable brush and then do this every night for about 30 days.  Actually for life.</p>\n<p>I went to GoodRx.com  and got a coupon because this is $168 if you buy it from your regular pharmacy when you get a prescription.  I went to goodrx.com, I downloaded a coupon and, the cheapest one was to Walgreen&#8217;s.  I paid $68. To be honest with you, I&#8217;ve been using it for about a month and I haven&#8217;t really seen a big difference between Revitalash and Latisse.</p>\n<p>How Latisse and other lash serums came about is they used to give it to people who have glaucoma.  It had a serendipity effect, their lashes grew super long after thirty plus days.</p>\n<p>Like, I said, I&#8217;ve been using Latisse for a month and I don&#8217;t see a big difference. I used Revitalash for a month and I saw about the same.</p>\n<p>Am I going to refill this again? Probably, because I have three more refills I&#8217;m going to go ahead and give it three more months but I&#8217;ll probably end up going back to the Revitalsh because it does work just as well.</p>\n<p>Sometimes you can get it on sale for about, $29 at Bed, Bath and Beyond as well.</p>\n<p>I hope that this helped you and thanks for reading!  See you next time 😀</p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/c7d45371aa27f49d8bae156ebb04d48d/1a478/Photo-on-12-4-18-at-2.27-PM.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"14b26d82-cc25-57b6-a451-da45c15e3605"}}