{"data":{"wordpressPost":{"title":"Being unorganized effects your health!","content":"<p>Being unorganized effects your health!</p>\n<p style=\"text-align: justify;\">In addition to resistant thinking and procrastinating, disorganization in life is a close third.</p>\n<p style=\"text-align: justify;\">How many times have you looked for your keys, your phone, that paper you left on the counter and now it’s gone? You know that paper that’s important now, but wasn’t when you placed it on the counter, and now you can’t find it.</p>\n<p style=\"text-align: justify;\">That paper that, if you don’t find soon, you are screwed. The one you blame everyone else for moving to another place or throwing away. In your mind you laid it “right there” and now it is gone. Maybe it’s your Jury duty summons and you forgot what day it was, only to realize it was today or approaching very soon.</p>\n<p style=\"text-align: justify;\">Now you are in trouble. Maybe it’s your instructions, passport, a renewal form, a policy, homework, a check, your wallet, whatever. Every day some of us choose to misplace something or we can’t find what we are looking for and we waste precious time searching for it. Unlike anything else in life, we will never get back lost time and it seems like such a waste of life to be always looking for what you have lost.</p>\n<p style=\"text-align: justify;\">The only way to overcome this is to get organized. Not being unorganized is another form of resistance and procrastination. Yes, another habit one chooses to do. This post is not about ways that I can get you organized, because it’s not really about a plan at this point.</p>\n<p style=\"text-align: justify;\">Sure I can help you organize your drawers by giving you ways to label everything, or I can help you organize your closet by giving you examples of ways to organize your closet, but, again, it’s not really about that. Even if I did, would you do it? Being unorganized in life is a lot different and here is why.</p>\n<p style=\"text-align: justify;\">Having a life that is organized has it benefits. Being organized saves us time, stress and money. If you live a stressful life because you can never find anything, than you probably know how it feels to be organized at least once in your life.</p>\n<p style=\"text-align: justify;\">It’s a great feeling to look around and see everything in its place and to know what is in place. To have the ability at a moment’s notice to request something from yourself and then go straight to it is a great experience.</p>\n<p style=\"text-align: justify;\">I have searched with others for hours looking for something, a wallet for example, only to chalk it up as being lost. Afterwards, the person who lost it went and cancelled their credit cards, got a new license and bought a new wallet. We found this wallet stashed in dirty clothes about three weeks later. What a waste of precious time and money to go through all that and, you know, it will more than likely be lost again until this person sets her mind to being organized.</p>\n<p style=\"text-align: justify;\">Why should you be organized? Because for one thing, not being so can have health consequences such as being stressed, and we all know that stress causes high blood pressure, heart attacks and tons of other stuff I could name, but I know you get the point.</p>\n<p style=\"text-align: justify;\">Being unorganized not only affects your health in a detrimental way, it also affects your productivity so much that you may be working at a low paying job or losing money because of it. By being organized you are efficient, which means that you are reliable, valuable and indispensable. If you are this way, it is likely that you will make more money, you will get promoted and you might never get fired.</p>\n<p style=\"text-align: justify;\">If you feel that you are not always organized, but organized enough because maybe you show up at your job on time and in uniform, just so you know, it takes way more than that. By being haphazardly organized, you are not getting the true benefit of your job, meaning others see what you don’t think they do.</p>\n<p style=\"text-align: justify;\">You will also realize they do because you rarely get a raise and you probably don’t get promoted. Many who are not organized are glad they have a job, but wonder why they are not further along in life. Maybe you think that your organization skills have nothing to do with your job because you work at a dead-end job and making extra effort won’t get you anywhere or any more money.</p>\n<p style=\"text-align: justify;\">But an organized person gathers the information to create options to do better rather than staying in a dead-end job. They take the initiative and the necessary steps according to how they set up their own system to move ahead. An unorganized person has no system at all. Better yet, they say they will get to it later or they will start looking soon. Before they know it, years and people have passed them by, while they blame everyone else for where they are.</p>\n<p style=\"text-align: justify;\">To break the cycle, determine why you are unorganized and then begin to unclutter your life. If you honestly don’t have time for anything, then it’s time to make time and start eliminating some of the events in your life.</p>\n<p style=\"text-align: justify;\">If you work two jobs, work one better. If you run all over the place dropping off kids after work, try partnering with others to help or eliminate events. Decide to change. Determine what area of your life needs to change. Often times all we need to do is make a small change and everything else falls into place.</p>\n<p style=\"text-align: justify;\">Using a calendar helps tremendously. We have smart phones now and they all have calendars that can remind us of when and where we need to be. Try to fill in the calendar for as far out as you can: days, weeks, even months. Every time a new event or appointment occurs, be diligent in putting it in your calendar. Anything that you need to do that can’t be put on the calendar, create the list I referred to before. Again, smart phones have lists apps too.</p>\n<p style=\"text-align: justify;\">Don’t avoid doing any of these things the moment they need to be done and when that calendar reminds you, do what you need to. Work on your list until you complete it, and then once you get in the habit, you will create a mental list and the list becomes minimal. No more long lists because you are staying on top of your game. Don’t get overwhelmed by doing too much in the beginning. This is the only time you should spread out all the things you need to initially get done. Delegate the tasks that you don’t want to do to others and, most important, don’t always be a yes person and agree to things you know you won’t be able to do.</p>\n<p style=\"text-align: justify;\">Do the best you can. On any given day, your best will change. One day you will be tired so your best may be the best for that day. On another day you will have an abundance of energy, use this time wisely. Just do your best and you will never have to second guess yourself or fall back to your old ways.</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"4a6043b5-8916-5085-8c48-0187e5d72d7c"}}