{"data":{"wordpressPost":{"title":"Without Existence","content":"<p>&nbsp;</p>\n<h2 style=\"text-align: center;\">Without Existence</h2>\n<p>&nbsp;</p>\n<p>What is without existence?</p>\n<p>Often times these are the people that can&#8217;t shake depression or have a mental illness.  It&#8217;s not that they want to have no place to land it&#8217;s just that they can&#8217;t seem to be one with their soul.</p>\n<p>I know this because I watched my mother, my younger brother, my older brother, my aunt, my cousin and now my son suffers from an emotional pain that I wouldn&#8217;t wish on anyone.</p>\n<p>They want to be happy but, they don&#8217;t feel included in the world around them.  Their anxious, withdrawn, afraid, depressed, and the worse thing is, they continue to punish themselves over and over for things they have never done.</p>\n<p>I remember one day talking to my mom.  She was deeply depressed all of her life and her depression is what I mostly remembered about growing up.  I asked her one day, why she was so sad.  Why couldn&#8217;t she just be happy?  I know asking a depressed person these questions is like asking a person with cancer, why they can&#8217;t cure themselves.</p>\n<p>The questions I asked my mother were not because I was insensitive but to find out instead, one, how I could help her and two, what was it in her that was causing such significant suffering.</p>\n<p>She said, &#8220;I don&#8217;t know what&#8217;s wrong with me. I&#8217;m just not happy.&#8221;  I asked her why.  She came back with the same answer that she didn&#8217;t know.  I think this is the eye opener for me because, imagine if for twenty, thirty, forty, fifty, even sixty years of not knowing why you are unhappy.</p>\n<p>We all have times in our lives where life hits us hard via death, illness, finances, relationship losses, job changes and so on, but, many of us deal with it and eventually we move on and pick up the pieces.  We find happiness again.  We understand that its a temporary situation and not a permanent problem.</p>\n<p>My family didn&#8217;t think like that.  No matter how many problems would come and go, they maintained this situation in their minds.  They were in a perpetual hell all of the time.  It&#8217;s like their spirits were hijacked by some demonic thing that wouldn&#8217;t allow them to get outside of their dark minds and for even a minute see that there was and is light and that it&#8217;s not only at the end of a tunnel but always shining brightly.</p>\n<p>I couldn&#8217;t help my mother and she took her life two years ago.  My little brother died from cancer which I believe manifested from his own demons that he couldn&#8217;t shake.  My aunt died of the side effects of living with addiction and both my older brother and my cousin are like so many lost souls, they are homeless and walk this earth waiting for their time to go.</p>\n<p>My aunt died of the side effects of living with addiction and both my older brother and my cousin are like so many lost souls, they are homeless and walk this earth waiting for their the next place their soul will go.</p>\n<p>My son is trying very hard but, I see his path a dark one as he fights the good fight but is tired too.  It is the most saddening feeling when you can&#8217;t even save your own mother let alone your only son.</p>\n<p>I hope that my family and all of those who suffer from being lost on this earth catch a break in the next one and their souls can feel what I feel which is happiness, joy, good and bad and know the difference between how to separate a moment and a lifetime instead feeling like walking with a thousand pound weight at all times.</p>\n<p>We are not so different from one another.  We all have a spirit.  Young or old, we are all amazing.  We are remarkable no matter what we have or haven&#8217;t accomplished.  We are going to leave this life and before we do we have to find some sense of peace and with that, hopefully, happiness.</p>\n<p>We shouldn&#8217;t let the world tell us what is normal and what isn&#8217;t.  We should tell the world what is normal for us.  We are our own normal and not what others expect us to be in order to fit into society.</p>\n<p>If I can offer anyone that is suffering from depression and darkness is to not wait for your time to be up but to know that you&#8217;re here to break the cycle so that you can live a happy life now.</p>\n<p>Don&#8217;t delay or wait or live in &#8220;what if&#8221; because the road to someday is now.  Dare to be what God intended you to be.  The real pain is the sorrow we feel by not participating in the gift of life.</p>\n<p>Don&#8217;t throw away your life.    As I think about it, what was my mothers real fear was she thought she was unworthy.  No matter what I told her she never felt otherwise and surrounded herself with men that reinforced her beliefs.</p>\n<p>You are worthy and you are not without existence.  Don&#8217;t throw away your life.  You don&#8217;t have to be lost and wait this life out until whatever your soul has in store for you next.  You are supposed to be here with all of us now and that&#8217;s why you were born.</p>\n<p>No one is born better than anyone else and no one will ever be you.  Love yourself because you can&#8217;t love others until you do.  When you are loved and you love back, this is the real joy and joy that will fill your soul.  No judgement.  No conditions, just letting life live through you.</p>\n<p>Forgive yourself and all that you believe to be true or not to be.  Forgive others and keep walking, don&#8217;t stop searching and finding your truth.</p>\n<p>You are a miracle.  Need I say more?</p>\n<h4 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">Here is a link to my book if you would like to check it out:</span></h4>\n<p style=\"text-align: center;\"><a href=\"https://amzn.to/2qvmkoL\">https://amzn.to/2qvmkoL</a></p>\n<div id=\"attachment_8591\" style=\"width: 212px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8591\" class=\"size-medium wp-image-8591\" src=\"https://myagingandwellness.com/wp-content/uploads/2018/11/Screen-Shot-2018-11-06-at-7.16.28-AM-202x300.png\" alt=\"https://amzn.to/2qvmkoL\" width=\"202\" height=\"300\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2018/11/Screen-Shot-2018-11-06-at-7.16.28-AM-202x300.png 202w, https://myagingandwellness.com/wp-content/uploads/2018/11/Screen-Shot-2018-11-06-at-7.16.28-AM.png 422w\" sizes=\"(max-width: 202px) 100vw, 202px\" /><p id=\"caption-attachment-8591\" class=\"wp-caption-text\">Without Existence. Some souls were not meant to be on this earth</p></div>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/efd97c1764c1762e2304f65a536dde8c/c0005/Screen-Shot-2018-11-06-at-7.16.28-AM.png","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"458b6ecb-b9dc-5802-b9b0-c6a42cf6b79b"}}