{"data":{"wordpressPost":{"title":"THE ANTI-AGING WAY TO EAT (Part #2)","content":"<p style=\"text-align: center;\">THE ANTI-AGING WAY TO EAT (Part #2)</p>\n<p style=\"text-align: justify;\">With today’s American diet, we may be losing the battle to create cell renewal by eating processed foods, pesticides, foods whose vitamins have been depleted, saturated fats and sugar.  These foods create free radicals and little nutrition to our cells.  Foods like meat, dairy products,  fried foods and, fast foods, taste good and, they satisfy but, they shorten our life.</p>\n<p style=\"text-align: justify;\">To counter the effects of the American diet and, to provide us with the necessary nutrients to our cells, it is advisable to eat a low-fat and vegetarian diet and, supplement with vitamins and minerals.</p>\n<p style=\"text-align: justify;\">Our cells are where everything that goes into our mouth ends up and, they have a purpose even if we are not mindful at the time we are shoving a donut down the hatch.  If our cells could talk, they would not allow us to eat unhealthy, but instead, guide us as we eat, in the right direction to optimize our cells.</p>\n<p style=\"text-align: justify;\">Until they can talk, it is up to us to improve our diets therefore, improving our life span.  We may be able to live to 100 and beyond without degenerative disease if we make an effort to.</p>\n<p style=\"text-align: justify;\">Allow me to give you a few examples of how some of what we put into our mouths can have some pretty detrimental effects to our cells.  Let’s take wine for example.  I love wine and I probably drink too much of it.</p>\n<p style=\"text-align: justify;\">Alcohol hurts our cells.  Our livers can clone cells to keep up with it (in moderation) but, when nerve cells die, and then we produce no more.  If our kidneys had their choice, they would ask you to drink only purified water because they already have to filter out the entire body, by consuming tap water; they have the added job of having to fight off toxic chemicals, etc.  The pancreas has to handle the sugar in our bodies.</p>\n<p style=\"text-align: justify;\">It doesn’t like it when we pour down loads of processed sugar. We have immune cells called lymphocytes and they need fewer animal fats and more essential fatty acids.  They need this so they can strengthen our membranes.  They protect against viruses.  So, it’s wise to pass over the butter, margarine and hydrogenated oils.</p>\n<p style=\"text-align: justify;\">Not to worry however, I am not saying you have to avoid eating, drinking (oh and breathing), but, the goal is to reduce free radicals and to avoid chemicals as much as you can to live a longer and more healthy life.</p>\n<p style=\"text-align: justify;\">We just don’t want to overload our bodies to the point or to any point, that it becomes overloaded at any given time.  The renewal way to eat is to choose grains, legumes, fruits and, vegetables.  We must lose foods from animal sources as they invite heart disease, cancer and many degenerative diseases.</p>\n<p style=\"text-align: justify;\">I was surprised when I had my heart checked and told my heart doctor that I was eating wild fish, now, after being a vegan for many years.  I thought he would be happy for me because I had come to believe that fish is excellent for our hearts, brains and bodies.  To my surprise he said, “There is no beneficial reason for me to eat fish.”  He explained that fish was being pushed as an alternative to red meat eaters, and that was better for them, however, for me, it was healthier to continue on a vegan diet.</p>\n<p style=\"text-align: justify;\">Who knew?  It’s mind boggling how you hear one thing and then shortly after it’s the opposite.  Who knows what to believe these days?  With that being said, I like to give more weight to things that make common sense that to some scientic facts that come along.</p>\n<p style=\"text-align: justify;\">It would seem like more common sense and more healthy to eat a plant based diet rather that our red meat, processed, French fried diet that Americans are living on now.  We can’t act like its not ruining our arteries, because deep down inside we know the truth so why delay?  Pay now or pay later.  But, one way or the other, we will pay the price of bad eating with poor health.</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/ec9e8525bfaab3142f2127583bc99e2a/1a478/44130693_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"3724c8d8-9639-5023-af37-d7e373084393"}}