{"data":{"wordpressPost":{"title":"HOW TO BECOME A VEGAN OR VEGETARIAN","content":"<h2 style=\"text-align: center;\"><span style=\"color: #008000;\">HOW TO BECOME A VEGAN OR VEGETARIAN</span></h2>\n<p>&nbsp;</p>\n<p style=\"text-align: justify;\">What is your diet?  What do you eat?  Do you eat meat?</p>\n<p>If you want to stop eating meat and become a vegetarian or vegan, you have stopped by the right place.</p>\n<p style=\"text-align: justify;\">I&#8217;ll show how to make the switch without feeling that you have lost something but instead that you have gained a whole new lifestyle and one that is healthier and one that will extend your life and how to become a vegan or vegetarian.</p>\n<p>First, let me start off by saying that I&#8217;m not here to badger you about eating meat or harming animals.</p>\n<p style=\"text-align: justify;\">Even though I have been a vegetarian for about twenty-five years and ten of those years a vegan, I believe that we all must make our own choices and to each their own.  However, not eating meat would help the environment and prevent the exploitation of animals and, that in itself is a great thing because, as humans, we have emotional attachments to animals and without a balanced planet, none of us can thrive.</p>\n<p style=\"text-align: justify;\">Vegetarianism has gone mainstream.  Its cool to not eat meat.  Some famous vegetarians are Paul McCartney, Tina Turner, Leonardo Da Vinci, Charles Darwin, Albert Einstein, Socrates, Plato and I could go on and on, but you get the point.</p>\n<h2 style=\"text-align: center;\"><span style=\"color: #008000;\">HOW TO BECOME A VEGAN OR VEGETARIAN</span></h2>\n<h2 style=\"text-align: center;\"><span style=\"color: #008000;\">What it means to be a vegetarian or vegan</span></h2>\n<p>&nbsp;</p>\n<p style=\"text-align: justify;\">Let&#8217;s define what a vegetarian is first.  Vegetarians fall into three categories.</p>\n<ul style=\"text-align: justify;\">\n<li style=\"text-align: left;\">Ovo-lactovegetarian</li>\n<li style=\"text-align: left;\">Lactovegetarian</li>\n<li style=\"text-align: left;\">Vegan</li>\n</ul>\n<p style=\"text-align: justify;\">Ovo-lactovegetarians consume eggs and dairy products.  Lactovegetarians eat dairy products but not eggs.  Vegans do not eat any food of animal origin, even dairy products.</p>\n<p style=\"text-align: justify;\">Many times, I see people that say they are vegetarian but still eat fish or chicken.  Fish and chicken are both considered meat.</p>\n<p style=\"text-align: justify;\">Then there are some that instead of eating meat, they consume a lot of dairy products like cheese and butter,   This kind of diet has way too much saturated fat, and this is bad news for our health.</p>\n<p style=\"text-align: justify;\">Honestly, if one were switching to vegetarianism for their health and they ate a diet like this then, it would be far wiser to keep eating lean beef which would decrease the amount of fat and cholesterol, however, keep reading because I don&#8217;t recommend this either.  Also, remember the environment part and the exploitation of animals I talked about?</p>\n<h3 style=\"text-align: justify;\"><span style=\"color: #008000;\">&#8220;If you wanted to stop eating meat to gain better health then I would suggest that you stop all animal products including dairy.&#8221;</span></h3>\n<p>&nbsp;</p>\n<p style=\"text-align: justify;\">By reading that last sentence, basically did you feel a little uneasy and think to yourself that nothing left to eat?  Or did you think that maybe you could do this and then cheat every once in while by having a nice juicy burger?</p>\n<p style=\"text-align: justify;\">What about putting butter on your toast? Or having to go without cheese on your pizza?  These are reasonable thoughts and questions.</p>\n<p style=\"text-align: justify;\">Keeping with the idea of becoming a vegetarian or vegan for your health, one could sum up these questions and more by saying that a high fat, fiberless, plant deprived, toxin-laden, animal food diet, not only shortens life but turns our final years into an extremely unpleasant experience.</p>\n<p style=\"text-align: justify;\">Instead of enjoying our golden years we spend huge amounts of time and money running from doctor to doctor because of degenerative health problems.</p>\n<p style=\"text-align: justify;\">Diseases like high blood pressure, circulatory problems, heart disease, kidney failure, stroke, cancer, diabetes, arthritis, brain disease, and much more.  This lowers our quality of life and  I&#8217;m saying this can mostly be avoided by my not eating animal products.</p>\n<p style=\"text-align: justify;\">Not to blame anyone but could we say that a lot of disease is self-inflicted?  What if we ate a vegetarian diet, supplemented appropriately  and exercised regularly?  Then most of the suffering that we as humans could be avoided.</p>\n<p style=\"text-align: justify;\">What&#8217;s the first step in changing your way of life by eliminating meat?  I will give you the steps that I took to become a vegetarian and then a vegan.</p>\n<h2 style=\"text-align: justify;\"><span style=\"color: #008000;\">Vegetarian/Vegan</span></h2>\n<ol style=\"text-align: justify;\">\n<li>If you can&#8217;t stop eating meat all at once, then try eliminating one animal at a time until you get to the no meat part.  This can easily be done within thirty days or so.</li>\n<li>Replace meat with plant proteins like <strong>beans, tofu, nuts, Quinoa, Lentils, Seitan, Tempeh, Green Peas, nut butters, veggie burgers, protein drinks, and beans and brown rice.  </strong>These are only some examples of many.</li>\n<li>Start adding more fruits and veggies with your proteins.</li>\n<li>Eat more frequently in smaller meals.</li>\n<li>When dining out, order off the sides and veggie menu and eat plenty.  You will see that you can eat way more than most and still not gain weight. Use the ratio of example number seven below.</li>\n<li>To avoid gaining weight, don&#8217;t swing to the other side and just eat carbs instead of meat.  Many people go from eating meat to only eating lot&#8217;s of carbs and this will make you heavy and, it will not be good for your health.</li>\n<li>My food plate consists of fifty percent veggies, twenty-five percent good carbs and twenty-five percent protein.</li>\n<li>Contrary to what most people think, you do not need a lot of protein and, you will get protein in just about everything you eat so don&#8217;t worry about the nay sayers that ask &#8220;How will you get your protein?&#8221;  Honestly, have you ever seen someone walking around with a protein deficiency?  It could happen but it&#8217;s rare.</li>\n</ol>\n<p style=\"text-align: justify;\">NOTE:  If you don&#8217;t want to eat like a vegan in the eight steps above, you can eat dairy as in a vegetarian.  I did this for a while but honestly, dairy is not so good for us either.  However, I think transitioning from vegetarian first to vegan is the easiest way to go.</p>\n<p style=\"text-align: justify;\">Let me say that there are a whole lot of yummy vegetarian and vegan foods to eat.  i practically live in Whole Foods and Pinterest has a ton of tasty dishes that you can save to an idea board.</p>\n<p style=\"text-align: justify;\">You can still have Mexican food, Italian food and everything else that you like.  You simply replace the meat with another protein and that&#8217;s it!  Simple right?</p>\n<p style=\"text-align: justify;\">The Pinterest boards that I have save me when I&#8217;m eating out and I sometimes don&#8217;t know what to eat or when, I&#8217;m craving something yummy.  I simply scroll down on my phone and find creative meals and deserts to eat.  Also, who carries around or probably even reads cookbooks anymore?</p>\n<p style=\"text-align: justify;\">I usually pack snacks like bars and nuts and fruit so I&#8217;m not tempted to eat chips or other bad foods when I&#8217;m starving and believe me, I&#8217;m always eating because, well, I just love to eat.</p>\n<p style=\"text-align: justify;\">That&#8217;s the thing, you can eat a lot being a Vegan.  People always ask me if I have a hollow leg 🙂  My business partner (who is a 6&#8217;2&#8243; man who body builds) says that I eat twice as much as him and that he always has to wait for me to finish all of my food when we go out!  You can&#8217;t do that with other diets.</p>\n<p style=\"text-align: justify;\">If you go to Whole Foods and probably in your grocery store, you will see that there are deserts like rice ice-cream, almond ice-cream and so much more.  Spend some time looking at all your options and trust me, there are way more than one can imagine.  Not to mention all of the new Vegan protein options out there.</p>\n<p style=\"text-align: justify;\">Don&#8217;t worry, you won&#8217;t have to be rigid.  As you go along, your journey will evolve and you will learn so many ways to keep your palate happy.  Everything starts with the first step.</p>\n<p style=\"text-align: justify;\">I also recommend that you consume at least one smoothie per day when beginning the transition and keep them up if you enjoy them like I do!</p>\n<p style=\"text-align: justify;\">I mix one scoop of vegan protein powder, 1/2 of a banana, almond milk and some ice and this is my post workout recovery smoothie.  Tastes like a milkshake and so good.</p>\n<p style=\"text-align: justify;\">For an antioxidant smoothie (which we should all do daily) I simply mix two handfuls of organic kale, 1/2 cup of the almond mile, probiotics, organic blueberries, ginger, turmeric, cinnamon, quarter banana, 1/2 of lemon or lime, a little ice and blend!</p>\n<p style=\"text-align: justify;\">The above smoothie is amazing and I drink it every morning and in the course of three months, it has reduced my cholesterol and all of my lab tests have improved dramatically.  You can always switch out the fruit for different flavors but always use the kale as your base.</p>\n<p style=\"text-align: justify;\">Before I go, I have to mention some amazing things about not eating meat and that is how you will transform.  Your skin will change, you&#8217;ll have more energy (because you&#8217;re eating live things not dead things, am I right?) and,  you will have better clarity.  You will also probably lose a lot of fat too.</p>\n<p style=\"text-align: justify;\">And did I mention that you just might save the planet?</p>\n<p>&nbsp;</p>\n<h3 style=\"text-align: center;\"><span style=\"color: #008000;\">If you would like to find more ways to Rejuvenate.  I have created a six-step course called &#8220;The Rejuvenation Program&#8221;</span></h3>\n<h3 style=\"text-align: center;\"><span style=\"color: #008000;\"> You can check it out by clicking this link: <a href=\"http://www.therejuvenationprogram.com\">http://www.therejuvenationprogram.com</a></span></h3>\n<p>&nbsp;</p>\n<div id=\"attachment_8361\" style=\"width: 310px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-8361\" class=\"size-medium wp-image-8361\" src=\"https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-300x251.png\" alt=\"The Rejuvenation Program\" width=\"300\" height=\"251\" srcset=\"https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-300x251.png 300w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-768x644.png 768w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-624x523.png 624w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program-600x503.png 600w, https://myagingandwellness.com/wp-content/uploads/2018/08/The-Rejuvenation-Program.png 940w\" sizes=\"(max-width: 300px) 100vw, 300px\" /><p id=\"caption-attachment-8361\" class=\"wp-caption-text\">The Rejuvenation Program</p></div>\n<h3></h3>\n<p>&nbsp;</p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"5d0634da-a92a-5514-922c-498f8a21fce0"}}