{"data":{"wordpressPost":{"title":"Overcoming Anxiety Part #2","content":"<h2 style=\"text-align: center;\">Overcoming Anxiety Part #2</h2>\n<p style=\"text-align: center;\">You Are What You Eat</p>\n<p style=\"text-align: center;\"> &#8220;Let food be thy medicine and medicine be thy food.&#8221; – Hippocrates</p>\n<p style=\"text-align: justify;\">This probably goes without saying because I’m hoping that you already know what you put into your body makes all the difference in the way you feel.  A diet that is rich in sugar and fat may be linked to poor mental health.</p>\n<p style=\"text-align: justify;\">We don’t need science to confirm this because anyone who hasn’t eaten for a day or so knows the feeling of being light headed and having a feeling of non-mental clarity.  It’s hard to think right let alone make good decisions when our brains are starving.</p>\n<p style=\"text-align: justify;\">A poor diet, energy drinks, large coffees, etc. can have a negative effect.  Caffeine is a stimulant and it’s bad news for someone with an anxiety disorder.</p>\n<p style=\"text-align: justify;\">Why?  Because caffeine it gives us that jittery feeling and stimulates our “flight or fight” response and we all know that we have enough of that feeling in public on our own so we certainly don’t need to add to the problem.  Caffeine can make anxiety symptoms worse and can even be attributed to bringing on a full blown panic attack.</p>\n<p style=\"text-align: center;\"><strong>Start eating like the quality of your life depends on it!</strong></p>\n<ul>\n<li><em>Eat a small breakfast of lean protein, fruit and a small amount of good carbohydrates.</em></li>\n</ul>\n<ul>\n<li><em>Try and eliminate or slow down your consumption of caffeine. If you can’t then try and drink tea for a while until you can.    Believe it or not once you have completely eliminated caffeine your anxiety symptoms may decrease by one-half.</em></li>\n</ul>\n<ul>\n<li><em>Eat small meals throughout the day.  Preferably with proteins like nuts, low fat cheese, low sugar fruits, etc.  Don’t reach for chips, cookies, candy, or the cake that someone brought to work or school for a birthday!  You have to be mindful .</em></li>\n</ul>\n<ul>\n<li><em>Eat as if the food you put into your body is helping you control your anxiety.  Unlike the other way around.</em></li>\n</ul>\n<ul>\n<li><em>Get prepared in the mornings before you leave the house and pack  the days  meals.</em></li>\n</ul>\n<ul>\n<li><em>Choose fruits, veggies and, lean protein before anything else.</em></li>\n</ul>\n<ul>\n<li><em>By all means, stay off sugar! It will raise your glucose and then like the evil thing that it is, it will drop it like a rock leaving you tired, moody and most likely vulnerable to anxiety.</em></li>\n</ul>\n<ul>\n<li><em>Stay hydrated.</em></li>\n</ul>\n<p style=\"text-align: justify;\">Try and make this small change and see how you feel in thirty days.  The point here is to acknowledge that what we put or don’t put into our bodies makes a huge impact on the way we feel and the way we make decisions.</p>\n<p style=\"text-align: justify;\">If changing your diet changes at least fifty percent of your symptoms, thus, your life, then why not do it?</p>\n<p style=\"text-align: justify;\">It sure beats the alternative of going on medication, being treated by a Psychiatrist and, having to live with anxiety because medicine only treat the symptom and not the cause.</p>\n<p style=\"text-align: justify;\">Why not eliminate the causes and be done with it?</p>\n<p style=\"text-align: justify;\">To recap eat better because “You are what you eat.”</p>\n<p style=\"text-align: center;\"><strong>Overcoming Anxiety Part #2</strong></p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"e34b7814-4299-5fcb-aa16-ce8e21d089c8"}}