{"data":{"wordpressPost":{"title":"Is it worth it to take medication?","content":"<p style=\"text-align: justify;\">Is it worth it to take medication?</p>\n<p style=\"text-align: justify;\">About two years ago, my doctor put me on thyroid medication.</p>\n<p style=\"text-align: justify;\">Let me start from a quick beginning with out boring you to death!</p>\n<p style=\"text-align: justify;\">I go to an OBGYN who practices natural medication as much as possible. I started going to her because I was working out pretty hard with weights and not seeing any real results. Long story short, this was the beginning of all the damn medication I&#8217;m on now!</p>\n<p style=\"text-align: justify;\">She did a blood test and said everything looked good but my Testosterone was low. This was why I wasn&#8217;t seeing results. That was about six years ago. She put me on a bio-identical cream and off I went. I gained ten pounds and gained a little muscle.</p>\n<p style=\"text-align: justify;\">At my next check up, my Progesterone was low so I got a compound prescription and off I went again. Now I was on Testosterone and Progesterone.</p>\n<p style=\"text-align: justify;\">Two years later after blood tests and refills, my doctor wanted to do a Boston Heart test to see where I was with my future indicators of heart disease, etc. I gave some blood and then came back for the results.</p>\n<p style=\"text-align: justify;\">I was told that my cholesterol was high (something I never had before as I was a Vegan for 22 years) and I was shocked and saddened. This had only happened since taking the hormones more specifically, the Testosterone.</p>\n<p style=\"text-align: justify;\">She told me to get the book Wheat Belly and adhere to it. I did and I ate not one carbohydrate or wheat for three months. When I went back to see her, she said I gained weight. I was beside myself because I was starving myself with what the book at said to do.</p>\n<p style=\"text-align: justify;\">She said she would check my thyroid levels and sure enough she said, my thyroid was on the cusp of the normal level but descending downward for the past several years. Guess what? She put me on thyroid medicine.</p>\n<p style=\"text-align: justify;\">I didn&#8217;t trust the diagnosis so I went to a Endocrinologist and he checked my thyroid level and found nodules on my thyroid. Long story short, he said I had Hashimotos disease where my thyroid is producing antibodies that attack itself. He told me to keep taking the medication.</p>\n<p style=\"text-align: justify;\">Wow! I asked myself if this all started because I wanted slightly bigger muscles or was I actually falling apart and they were doing what they could to keep me alive (I know a little dramatic).</p>\n<p style=\"text-align: justify;\">Well, I was going to have a small cosmetic procedure and the doctor said &#8220;I can&#8217;t do it you have heart problems&#8221; after listening to my heart. I went to a heart doctor, got some seriously long and expensive tests and turns out, I have PVC&#8217;S (premature ventricular contractions) caused by the thyroid medicine. Basically, 25% of my heart doesn&#8217;t beat right because I have to take thyroid medicine.</p>\n<p style=\"text-align: justify;\">Speed up a year or so later and I&#8217;m 48 years old. I&#8217;m sitting outside in the middle of the night, naked, on my porch from being so freaking hot, I can&#8217;t stand it. Of course, my doctor puts me on Estrogen and my hot flashes end but, I get fibroids and lots of liver spots from it!</p>\n<p style=\"text-align: justify;\">By this time, I am deficient in iron from having fibroids, deficient in a ton of other stuff too. I won&#8217;t go into everything that I take but I have to wonder if all of the medication is a domino effect. I think often about stopping completely to see what my body will do.</p>\n<p style=\"text-align: justify;\">Now, my doctor tells to get off of gluten! She said that gluten attacks the thyroid like an allergen. Well you can probably guess that I got off of gluten and now I&#8217;m on month three.</p>\n<p style=\"text-align: justify;\">Do I feel any better? I don&#8217;t think so. I have lost a few pounds and that&#8217;s good. However, I know that I will go back for my blood work and then, my doctor will find one more pill to shove down my throat or a food group to take away that I have to wonder if my quality of life is worth the exchange.</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"caa86aa7-f361-5509-9c90-3abbaf54c516"}}