{"data":{"wordpressPost":{"title":"The antidote to aging is renewal","content":"<h2 style=\"text-align: center;\"><em><strong><a href=\"https://theresaskrobanek.leadpages.co/the-5-huge-mistakes\">The antidote to aging is renewal.</a></strong></em></h2>\n<p style=\"text-align: justify;\">We are to minimize cell damage created by free radicals and supply our bodies with ample amounts of raw materials to protect healthy cells and repair the damaged ones.  It is important that our bodies replace irreparable and dead cells.</p>\n<p style=\"text-align: justify;\">In order to live a long and healthy life we must defeat free radicals.  In a nut shell, this is how free radicals wreak havoc on our bodies:  without going into all the science about atoms and electrons and how free radicals hate to be alone therefore, they grab onto a healthy cell and destroy it; I will tell you that free radicals left unchecked do a lot of structural damage to healthy cells.</p>\n<p style=\"text-align: justify;\">When a healthy cell has been damaged by a free radical, the cell can’t function properly and may die, so, it’s important to repair or replace it.</p>\n<p style=\"text-align: justify;\">Disease linked to aging is prolonged exposure to free radicals which fast forwards aging.  Free radicals foster disease and also, reduces our life span.  You have to know where free radicals come from in order to avoid and dispose of them.</p>\n<p style=\"text-align: justify;\">We will never be able to eliminate them entirely because, unfortunately, even our own bodies create free radicals.  We eat them, breathe them and, drink them.  We are programmed to dispose of them however, when our bodies have more than we can manage, is when we have problems such as health issues, disease or even premature death.</p>\n<p style=\"text-align: justify;\">I have a friend who just had a major stroke at 49 and is bed ridden for the rest of his life.  I am not a doctor but I would contribute his stroke to smoking two packs of cigarettes a day, drinking a twenty-four pack of beer nightly, high blood pressure and living a high stress life that did him in.</p>\n<p style=\"text-align: justify;\">As sad as his situation is, we have to have some accountability.  My mother has a quirky motto and that is “Do one thing only and do it good.”  While I agree that we shouldn’t abuse our bodies with tons of bad things at once, we shouldn’t do major things like smoking even if it is just one thing.</p>\n<p style=\"text-align: justify;\">I say, do ninety percent right and then do ten percent of whatever the heck you want to.  There are things we can do to offset that bad and I will get to that soon.  However, on the flip side, we can’t abuse our bodies most of the time and think our bodies wont make us pay for it.</p>\n<p style=\"text-align: justify;\"><em> Our DNA is very forgiving so long as we don’t abuse and punish it consistently.</em></p>\n<p style=\"text-align: justify;\">What are some of the usual causes of free radicals?  The American diet is a major free radical creator.  A diet high in fat, trans-fat, chemicals, pesticides and radiation can cause free radical damage. Cancer is not the only tragic side effect of free radicals.</p>\n<p style=\"text-align: justify;\">Cumulative free radical damage causes or contributes to Alzheimer’s, arthritis, and atherosclerosis, infections, Parkinson’s, Multiple Sclerosis and many other degenerative diseases.   Okay finally, I get to the point here.</p>\n<p style=\"text-align: justify;\">How can we lay the foundation for renewal?  We can start with a powerful weapon called antioxidants to neutralize free radicals.  How do we get antioxidants?  By way of nutrients of course.  Our body depends on antioxidant nutrients and antioxidant enzymes to renew itself.  We get these nutrients from food and supplements.</p>\n<p style=\"text-align: justify;\">Once we get these nutrients, our bodies can then synthesize them so our body can repair itself.</p>\n<p style=\"text-align: center;\"><em><strong>If you would like to get my PDF on how to get started </strong></em></p>\n<p style=\"text-align: center;\"><em><strong>renewing here is the link below:</strong></em></p>\n<p style=\"text-align: center;\"><em><strong><a href=\"https://theresaskrobanek.leadpages.co/the-5-huge-mistakes\">https://theresaskrobanek.leadpages.co/the-5-huge-mistakes-/</a></strong></em></p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/d95e82b2cc210e0f04699408a4acd8ce/1a478/13071119_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"be8dd495-f3ee-5c88-94f2-2ab084c4b629"}}