{"data":{"wordpressPost":{"title":"MIDLIFE AWAKENING","content":"<h2 style=\"text-align: center;\"><em>MIDLIFE AWAKENING</em></h2>\n<p style=\"text-align: justify;\">Just when I get my mind right, my body falls apart.</p>\n<p style=\"text-align: justify;\">&#8211;Anonymous</p>\n<p style=\"text-align: justify;\">Whenever I heard the term midlife crisis, I always thought of a bald man in a red sports car. That’s the stereo type we think of when we are younger. Rarely do we think of women in a midlife episode unless you count menopause. However, a midlife crisis can affect both men and women.</p>\n<p style=\"text-align: justify;\">Conversely, I think of a midlife crisis the same as I do a nervous breakdown, unreasonable to put that title on anyone. To me it’s more of a midlife awakening, which shouldn’t lead to a crisis. A midlife crisis reminds me of the state of mind an African tribe goes into when they do a ritual.</p>\n<p style=\"text-align: justify;\">If we do feel certain undesirable states, then it’s because something is out of balance in our mind, body or spirit, and it’s caught up with us. The crisis could just be all the things you once pushed down that have now come up for you to deal with. The question then becomes, do we deal with it now, or do we push it down for the next fifty years?</p>\n<p style=\"text-align: justify;\">If we choose to acknowledge that which we don’t deal with, than we can overcome and, therefore, move through this phase in life with grace and splendor.</p>\n<p style=\"text-align: justify;\">When many women face menopause, it is a huge physiological change, which can alter how we look and feel, especially when it comes to our libido. Let’s not mention what menopause does to our emotional state. But is it a huge change, or are we mentally changing, and focused on a new future? Maybe we should change menopause to “future modification.” They used to call it, in my mother’s day, the “change.”</p>\n<p style=\"text-align: justify;\">I remember my mom saying, “Oh, she’s like that because she is going through the change.” I didn’t know what that was as a kid, but from the tone of my mom’s voice and the expression on her face, I knew it was not something that was good. I knew not to talk to whomever it was that was changing.</p>\n<p style=\"text-align: justify;\">For both men and women, middle age is a time for reflection and a time of transformation. Change is definitely the key word for women. It’s time to make changes and begin to take care of our needs, hopes and desires. We need to stop feeling guilty and feel happy that we can now put ourselves first.</p>\n<p style=\"text-align: justify;\">The key words being <em>you first</em>. I’m not talking about being selfish by spending the grocery money on Botox, or the mortgage payment on a new piece of jewelry (although, I do know a woman who does this), but to make it okay to be about what makes your heart, soul and spirit feel free and blissful.</p>\n<p style=\"text-align: justify;\">Many women report feeling a sense of dissatisfaction in their lives in middle age, and perhaps this is why divorces peak at this time. Many women don’t like the fact that their role as mother or nurturer has changed. For me, even though I love my adult kids dearly, I am ready for them to start their lives so I can do the same.</p>\n<p style=\"text-align: justify;\">Maybe this is where my sports car comes in. I know one thing for sure, when they do move on, I will get that much needed raise, and then I can use it to travel or for whatever I have been waiting for, or to buy that silver convertible Porsche I’ve had my eye on for twenty-plus years. Ahh, I can just feel the wind in my hair and the music turned up full blast (the kind I only like).</p>\n<p style=\"text-align: justify;\">I, like many other women, rightfully so, put other’s needs first, and now it is my turn to put me first. This is exciting and thrilling to know I can do whatever I want to now. However, this is probably the time grandkids will arrive, and that’s okay too. I can give them back to their parents whenever I want, and there is the beauty of getting older.</p>\n<p style=\"text-align: justify;\">Another issue women have in middle age is uncertainty in the work place. When reaching our fifties and sixties, we have fewer opportunities for advancement. Sometimes this is the age where we are dispensed for lower paid workers. I have a business degree, but I am back in school for a psychology degree because I know the psychology field, like a few others, is a field of work where it’s okay to be older.</p>\n<p style=\"text-align: justify;\">It’s okay being older as others may feel you have more wisdom being middle-aged, rather than the reverse in fields like sales, marketing and management. If I were to try and find a new job with my business degree, I don’t think I would have much luck competing with the younger generation.</p>\n<p style=\"text-align: justify;\">I know this is just a fact of life and, like I always say, “It is what it is.” Call it age discrimination or whatever you want, but until things change in our society, it’s no use fighting the order. Just move on and keep your energy for better things to come. The important thing in our lives now is to keep moving in an optimistic direction and not dwelling. Dwelling and rehashing what may or may not be is the same as worrying. It’s no good and it gets you nowhere.</p>\n<p style=\"text-align: justify;\">Women should continue to reinvent themselves to stay in the game, and when I say game, I don’t mean to try to complete by looking younger. I mean keep yourselves fresh both mentally and physically, and don’t rest on your attainments. We need to remain educated, creative, and keep up with technology, and definitely keep your social skills sharp.</p>\n<p style=\"text-align: justify;\">It doesn’t matter if you are a doctor, a hairdresser, a teacher, or whatever. The compassion that you give to others through your kindness and your actions is what will keep good people around you with respect to employment opportunities or otherwise. If you don’t maintain enthusiastic social skills, you are out of the game no matter what you do.</p>\n<p style=\"text-align: justify;\">Don’t feel jaded, and try to be excited about your life. We should be amazed by the life we have, the choices we have, and the gift we have in front of us, and that’s ourselves. We are amazing women with so much to offer.</p>\n<p style=\"text-align: center;\">Do these 5 things daily and slow down aging by 10 years:</p>\n<p style=\"text-align: center;\"><img class=\"\" src=\"https://myagingandwellness.com/wp-admin/admin-ajax.php?action=imgedit-preview&amp;_ajax_nonce=c3b68c6a16&amp;postid=98&amp;rand=17258\" width=\"123\" height=\"123\" /></p>\n<p style=\"text-align: center;\"><a href=\"https://theresaskrobanek.leadpages.co/the-5-huge-mistakes/\">https://theresaskrobanek.leadpages.co/the-5-huge-mistakes/</a></p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/376e7e875bae868f59f53f79ec942284/1a478/6564010_s-400x257.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"305c117a-8b51-52f5-b5ac-887ffaffcde8"}}