{"data":{"wordpressPost":{"title":"His Menopause is not your fault","content":"<p style=\"text-align: center;\">His Menopause is not your fault</p>\n<p style=\"text-align: justify;\">I&#8217;m about to turn 50 in a few months and although it&#8217;s kind of scary, it&#8217;s also a little exhilarating to know that I am at a place in my life where I can start doing things for me.</p>\n<p style=\"text-align: justify;\">My kids have grown, I have a little money and, all of the mistakes that I made when I was younger are thankfully behind me!</p>\n<p style=\"text-align: justify;\">With that said, I have also gotten my hormones balanced and added a good supplement program to my life.  All of this so that I can offset the side effects of menopause and so that I won&#8217;t be that dreaded hormonal bitch that women are stereotyped at 50 and above!</p>\n<p style=\"text-align: justify;\">I think balancing my hormones has helped me maintain a better quality of life and emotional state so that, I have a good foundation to live happily for the rest of my life.</p>\n<p style=\"text-align: center;\"><em>His Menopause is not your fault.</em></p>\n<p style=\"text-align: justify;\">Let me back up a second and give you a quick story from a couple of weeks ago (don&#8217;t worry, I&#8217;ll make it short).</p>\n<p style=\"text-align: justify;\">I&#8217;m at a spa in Mississippi just minding my own business (which thankfully I do these days). I was laying on the pod chase, in a white luxurious robe, eyes closed, champagne in my hand and waiting for my therapist to come and take me away to my blissful day of pampering.</p>\n<p style=\"text-align: justify;\">I began to dose off when the lady next to me says &#8220;I don&#8217;t know what&#8217;s wrong with my husband, but he&#8217;s so angry all of the time.&#8221;  Of course I wondered if she was talking to me so I removed my eye pads and looked to my right.  She was just talking while looking up at the ceiling and I guess she wanted me to listen.</p>\n<p style=\"text-align: justify;\">I told her that it was too bad that he was angry at her all the time and she gave me some more back story and I told her that it wasn&#8217;t her fault that he&#8217;s angry all the time.  This is when she said, every since he turned fifty-five, he&#8217;s been a different person.</p>\n<p style=\"text-align: justify;\">I let her talk and I felt sad for her because I know that sometimes others want to put the burden of their unhappiness on another person and if that person will take the blame, they will pay a pretty heavy price for someone else&#8217;s unhappiness.</p>\n<p style=\"text-align: justify;\">I also know that if we let others put their unhappiness on us then we should be responsible enough into making them accountable even if that means they are not happy with you.</p>\n<p style=\"text-align: justify;\">Let&#8217;s face it.  People grow apart, people are not the same as they were when they first got married, etc.  Sometimes people get lost and they need to find their balance and when they can&#8217;t a lot of people tend to look at the person by their side and blame them for being unhappy.</p>\n<p style=\"text-align: justify;\">Maybe it&#8217;s just coincidental that this usually happens for men and women around middle age and we blame it on menopause and hormone inbalance or whatever.  But true to the fact that it happens a lot.</p>\n<p style=\"text-align: justify;\">While I&#8217;ve digressed a bit, I will get back to my point of this blog post and that is, not only women go through menopause.  Sure we get the bad wrap and we are held to a different standard then men, men also go through &#8220;male menopause&#8221; too.</p>\n<p style=\"text-align: justify;\">Although a woman at middle age doesn&#8217;t need me to go into depth about the symptoms of menopause, however, I am fairly sure that most women don&#8217;t know the symptoms of male menopause.</p>\n<p style=\"text-align: center;\">Here is a short overview on male menopause:</p>\n<p style=\"text-align: justify;\">At midlife, just like women, men&#8217;s hormones begin to decline.   The symptoms manifest themselves with sleep problems, fatigue, less muscle strength, weight gain around the mid section, joint issues, depression, mood problems, panic attacks and a host of other symptoms.</p>\n<p style=\"text-align: justify;\">This is also called andropause and is usually noticed when a man is in his fifties.  Men, just like women, can offset the symptoms by getting their hormones balanced and, seeing a therapist if needed.</p>\n<p style=\"text-align: justify;\">So if your husband or partner of many years all of a sudden becomes angry at you for being the person that you are, one, don&#8217;t change who you are for anyone and consider talking to them about seeing a physician to get their hormone levels checked and two, don&#8217;t blame yourself.  This only creates damage.</p>\n<p style=\"text-align: justify;\">Of course, sometimes people are not happy and it&#8217;s because they are simply not happy and they don&#8217;t see they have an issue therefore, everyone around them becomes miserable.</p>\n<p style=\"text-align: justify;\">It is each person job not anyone else&#8217;s job to make themselves happy.  When they can&#8217;t and they won&#8217;t and it starts to become your problem, sometimes a life worth living is not that life anymore.</p>\n<p style=\"text-align: center; margin: 9.6pt 0in 9.6pt 0in;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">Before you go, I created “The 7 Steps to Rejuvenate and Renewal.” In just seven</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">steps you can feel amazing without depriving your self!  Click the link below:</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><em><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\">THE REJUVENATION AND RENEWAL PLAN</span></em></p>\n<p style=\"text-align: center;\" align=\"center\"><strong><i><span style=\"font-size: 10.0pt; font-family: 'Verdana','sans-serif'; color: #111111;\"><a href=\"https://theresaskrobanek.leadpages.co/rejuvenate-renew/\"><span style=\"color: #ba1111; text-decoration: none; text-underline: none;\">https://theresaskrobanek.leadpages.co/rejuvenate-renew/</span></a></span></i></strong></p>\n<p>&nbsp;</p>\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/0b436be8602fb968c13272578e344cb8/1a478/35570495_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"9f0d761f-7e35-5ebd-9dd6-9a68415e74a4"}}