{"data":{"wordpressPost":{"title":"ANTI-AGING WAY TO EAT","content":"<h2 style=\"text-align: center;\"><span style=\"color: #ff00ff;\">THE ANTI-AGING WAY TO EAT</span></h2>\n<p>&nbsp;</p>\n<p style=\"text-align: justify;\">This is not a diet blog or a blog that will give you specific meal plans.  However, once you understand that you must consume antioxidants and adequate supplies of nutrients, you will have the knowledge to create meals that include the essentials required to renew your cells.</p>\n<p style=\"text-align: justify;\">There are about six nutrients that will accommodate the renewal process.  If anyone one these are lacking then the renewal process will slow down conversely, if all of them are highly functioning, the process will speed up with the goal of a healthy and disease free body. These nutrients are:</p>\n<p style=\"text-align: justify;\"><strong><u>Amino Acids</u></strong> which are enzymes and enzymes are proteins.  These proteins are building blocks.  It is best to get these by consuming whole grains and beans rather than by consuming meats.  Meat and other animal based products are acidic and they cause free radicals in the body, whereas whole grains and beans do not.  Plant based foods are neutralizers.</p>\n<p style=\"text-align: justify;\"><strong><u>Complex Carbohydrates </u></strong>provide energy to our cells.  Again, unrefined, whole grains and beans offer the best quality.  Don’t be fooled by natural sugars because they undermine the cells ability to regenerate by fueling your body with junk instead of clean fuel.</p>\n<p style=\"text-align: justify;\"><strong><u>Essential Fatty Acids</u></strong> are the fat vitamins that serve as building blocks for our cells membranes.  They are free radical killers and they enhance our body’s immune system.  Essential fatty acids are used by the body as an anti-inflammatory protector.  Foods like seeds, beans and vegetables have minimal amounts of essential fatty acids however, for the optimal amount needed; we can supplement our diet with flax seed and borage oil.  Fish oil is another good source.</p>\n<p style=\"text-align: justify;\"><strong><u>Vitamins and Minerals </u></strong>are needed to help with the chemical process of our bodies.  For example when we talk about antioxidants which are the scavengers that eat free radicals, we are relating to vitamins such as A, C and E.  With regard to minerals, these are cofactors that help our enzyme systems, thus helping our enzymes perform the tasks necessary to renew our cells.</p>\n<p style=\"text-align: justify;\"><strong><u>Phytochemicals </u></strong>These are the difference between basic nutrition and super nutrition. They are key factors in preventing heart disease and cancer.  Phytochemicals are only found in plant foods.  The brighter the food colors the better.</p>\n<p style=\"text-align: justify;\">There are approximately 100 trillion cells that make up the human body.  The body needs food to generate energy.  Our cells try to stay healthy.  When we don’t take care of them, we are fighting against their natural ability to heal themselves.  They greatly need our help in the process.</p>\n<p style=\"text-align: justify;\">Every cell in the body is dependent upon key nutrients.  When we don’t feed our body with the right nutrients and, when key nutrients are not available, a cell may become compromised.</p>\n<p style=\"text-align: justify;\">With today’s American diet, we may be losing the battle to create cell renewal by eating processed foods, pesticides, foods whose vitamins have been depleted, saturated fats and sugar.  These foods create free radicals and little nutrition to our cells.  Foods like meat, dairy products,  fried foods and, fast foods, taste good and, they satisfy but, they shorten our life.</p>\n<p style=\"text-align: justify;\">To counter the effects of the American diet and, to provide us with the necessary nutrients to our cells, it is advisable to eat a low-fat and vegetarian diet and, supplement with vitamins and minerals.</p>\n<p style=\"text-align: justify;\">Our cells are where everything that goes into our mouth ends up and, they have a purpose even if we are not mindful at the time we are shoving a donut down the hatch.  If our cells could talk, they would not allow us to eat unhealthy, but instead, guide us as we eat, in the right direction to optimize our cells.</p>\n<p style=\"text-align: justify;\">Until they can talk, it is up to us to improve our diets therefore, improving our life span.  We may be able to live to 100 and beyond without degenerative disease if we make an effort to.</p>\n<p style=\"text-align: center;\" align=\"center\">\n","featured_media":{"localFile":null}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"4d70b432-ec37-5500-9044-faa10ec905f8"}}