{"data":{"wordpressPost":{"title":"11 Ways to curb your appetite","content":"<h3 style=\"text-align: justify;\">11 Ways to curb your appetite!</h3>\n<p style=\"text-align: justify;\">I like to eat.  I hate being hungry.  I especially hate how my stomach hurts when I&#8217;m hungry.  I don&#8217;t like feeling light headed either and, I absolutely hate looking for healthy food options when I&#8217;m starving.</p>\n<blockquote><p><span style=\"text-decoration: underline;\"><strong><span style=\"color: #ff0000; text-decoration: underline;\">11 Ways to curb your appetite</span></strong></span></p></blockquote>\n<ol style=\"text-align: justify;\">\n<li style=\"text-align: center;\">Be prepared.  Always have a low calorie meal/snack with you at all times so that as soon as you get that hungry feeling, you can eat!</li>\n</ol>\n<p style=\"text-align: justify;\">2.  East small meals often.  I try and eat about five to six times a day.</p>\n<p style=\"text-align: justify;\">3.  Eat protein and veggies and try and keep it to no more than 300 calories each time.</p>\n<p style=\"text-align: justify;\">4.  Sip on hot cups of veggie broth throughout the day.  This warms and soothes the stomach and, provides lot&#8217;s of healthy benefits.</p>\n<p style=\"text-align: justify;\">5.  Drink a couple of dark green veggie smoothies during the day.  Throw a couple of hand fulls of kale, a hand full of blueberries, some almond milk and, Stevia Sweetener.</p>\n<p style=\"text-align: justify;\">This will be about 125 calories or so and you&#8217;ll get your greens and your fill.  Great for hair, skin and nails too.  I know because I&#8217;ve seen my hair grow about three inches since doing this for the past nine months!</p>\n<p style=\"text-align: justify;\">For even better results, add in some probiotics (open a couple of capsules).  AMAZING!</p>\n<p style=\"text-align: justify;\">6.  When dining out.  Don&#8217;t let the server bring bread or any appetizer and then, eat the meal that you want but, ask for a to go box right away and box half of your meal.  You can eat the other half later or the next day!</p>\n<p style=\"text-align: justify;\">7.  If you have to eat a lot (like I do) then SPIRALIZE! This is using an attachment to make spaghetti zucchini noodles and then cut up a tomatoe, one teaspoon olive oil, salt, pepper, shredded basil and, a tablespoon of Parmesan cheese.</p>\n<p style=\"text-align: justify;\">Heat in microwave for about two minutes.  It&#8217;s lovely and filling and, about 160 calories!</p>\n<p style=\"text-align: justify;\">8.  When you do eat a meal, consume lot&#8217;s of veggies.  I eat 80% veggies and then 20% protein.  Others will tell you to probably reverse this and yes, protein does make you feel fuller however, I think with regards to health and aging, we absolutely need those phytonutrients that plants provide rather than too much protein which is acidic to the body. Plants neutralize our body.</p>\n<p style=\"text-align: justify;\">9.  When you want to eat, step back and ask yourself if you are really hungry?  Is it habit, boredom or, are you actually hungry?  If you are, then eat!  If you can wait, go do something for a while and come back to eating.</p>\n<p style=\"text-align: justify;\">10.  Always have small GO TO meals in your fridge or freezer to pop in the microwave, that way you won&#8217;t stand in pantry grazing and over eating.</p>\n<p style=\"text-align: justify;\">11.  Okay, number eleven is a mini list 🙂  Hydrate, get enough sleep, drink hot green tea, take in  tablespoon of apple cider vinegar, keep tempting food out of the house, use small plates for your meals.</p>\n<p style=\"text-align: justify;\">This isn&#8217;t a diet of any kind.  Only mindful ways to keep you from over eating, eating when you&#8217;re not hungry or, binge eating because of boredom.</p>\n<p style=\"text-align: justify;\">What I also do is, when I find myself constantly thinking about eating while at home, I take my keys, jump in my car and go the mall and WALK around.  Of course I always find something that I don&#8217;t need but, I&#8217;m working on that too.</p>\n<p style=\"text-align: justify;\">\n","featured_media":{"localFile":{"childImageSharp":{"resolutions":{"src":"/static/207274a219ea1b2a25032cda16616adc/1a478/4547024_s-400x280.jpg","width":300,"height":300}}}}},"site":{"siteMetadata":{"title":"A sample site using gatsby-source-wordpress","subtitle":"Data fetched from a site hosted on wordpress.com"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"id":"db8b562a-296a-5b8c-8972-f44d97669ca6"}}